{
  "id": "9GrfdZhKky",
  "name": "KoS Quest - Celebrating Les Femmes (womens footage all the way)",
  "weakness": "NoWeakness",
  "grouping": "Celebrating Les Femmes (womens footage all the way)",
  "category": "",
  "subcategory": "None",
  "description": "**Congrats on accepting the Knighthood Challenge!**\n\nThis plan will load 10 women\u0027s racing featured workouts available for you to complete your Knighthood.\n\nA reminder of the rules:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
  "planDescription": "Quest",
  "fixedEndDate": "",
  "level": "",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "1 Week",
  "progression": "None",
  "hidden": false,
  "createdAt": "2024-04-16T15:38:22.393Z",
  "updatedAt": "2025-05-19T16:23:46.342Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": null,
  "metadata": {
    "internalNotes": ""
  },
  "primary": [
    {
      "day": 0,
      "type": "Event",
      "rank": 222,
      "prospects": [
        {
          "type": "Event",
          "name": "Knighthood Quest ",
          "style": null,
          "compatibility": 100,
          "description": "Today is the big day! A few reminders and tips before you begin your quest:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 0,
              "nm": 0,
              "map": 0,
              "ftp": 0
            },
            "tss": null,
            "intensityFactor": null
          },
          "workoutId": "",
          "contentId": "zo5GHq3hvi",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 223,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Fight Club",
          "style": null,
          "compatibility": 100,
          "description": "A full remastering of one of our earliest sessions (the original is still available to those of you who are Knights of Sufferlandria), Fight Club is scrappy, messy, and unpredictable. Like a real bike race, you\u0027re working hard to stay with the leaders while fending off attacks and doing your best to make the race by attacking as well.\n\n​\n\nWith significant time spent at power well above your threshold, this is a solid session to improve your Anaerobic Capacity. The fact that all those surges take place during sustained efforts right around threshold makes this one of the most difficult (yet beneficial) workouts in The Sufferfest Library. Repeated surges followed by sustained riding near your threshold stress your body\u0027s ability to clear metabolites (like lactate) and your mental ability to “deal” with the extreme discomfort all those metabolites cause. You\u0027re going to come out of this one a bit battered but a lot stronger for it.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9272222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 1,
              "map": 3,
              "ftp": 4
            },
            "tss": 80,
            "intensityFactor": 0.93
          },
          "workoutId": "C0q3WCPXm2",
          "contentId": "tJpZlAA0hq",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 224,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Hell Hath No Fury",
          "style": null,
          "compatibility": 100,
          "description": "This takes one of the oldest FTP building workouts, the venerable 2 x 20, and makes it exciting. Forcing your body to churn out power right below, at, and just above threshold for 20-minute intervals dramatically improves your ability to generate sustainable power. It\u0027s great for building your FTP (unless you have an unusually low MAP...in which case you\u0027re going to find this session a bit challenging).\n\n​\n\nBy itself, the 3-minute time trial effort at the end would not be much to deal with, but after churning out threshold power for 40 minutes, hitting this 3-minute effort at 100% will ensure you stress your MAP enough to give this session a slight edge over other FTP Builder workouts.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.0686111111111112,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 2,
              "ftp": 5
            },
            "tss": 92,
            "intensityFactor": 0.93
          },
          "workoutId": "lVqtKuf15P",
          "contentId": "OIoXe9I4bh",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 225,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Revolver",
          "style": null,
          "compatibility": 100,
          "description": "The simple idea of going hard for one minute and then easy for one minute, and then repeating, has been around since whatever evil genius realized that intervals were the best way to train. There is a reason this simple session has stuck around: it works.\n\n​\n\n30 seconds into a high-intensity effort, enough of your anaerobic energy sources have been depleted that your body shifts to producing that power aerobically. Follow that effort with only 60 seconds of recovery, and your body hasn’t fully replenished those anaerobic stores, meaning it will have to produce that power aerobically after just 25 seconds.\n\n​\n\nWith a total of just 15 (cough, cough) efforts, you will have not only forced your body to replenish its Anaerobic Capacity (AC) over and over, but you\u0027ve just spent several minutes producing lots of power with lots of oxygen. That combination ensures this session hits both your Maximal Aerobic Power (MAP) and AC with just the right stress they need to start increasing.\n\n​\n\n_Revolver has recently been remastered (Aug \u002722) to include all new footage and music. The workout has a longer warm-up than previous editions._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8208333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 1,
              "map": 5,
              "ftp": 1
            },
            "tss": 63,
            "intensityFactor": 0.93
          },
          "workoutId": "3e8ekr1Ff9",
          "contentId": "xjx8cV9fzM",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 226,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Omnium",
          "style": null,
          "compatibility": 100,
          "description": "Do you know what we love about you? Your versatility. You can Suffer anywhere, anytime, and in any way. That\u0027s why Grunter von Agony, Sufferlandrian Team Director, is sending you to compete in The Omnium at the UCI World Track Championships. Over the course of 50 minutes, you\u0027ll do battle in the six different races.\n\n​\n\nNo two intervals in this workout are the same, with each one working slightly different Neuromuscular (NM), Anaerobic Capacity (AC), and Maximal Aerobic Power (MAP) variations. No need for FTP here, friends. It\u0027s the perfect session to improve top-end power without having to do a ton of repetitive efforts.\n\n​\n\nThe Scratch Race and Flying Lap have an easy enough lead-in that you get to put your max sprint to the full test. Add in the standing starts for the Individual Pursuit and Kilo, and you give your NM a real run-through. The repeated surges of the Elimination Race, the all-out nature of the Kilo, and the massive efforts you have to make in the points race really test your powers of recovery while working your AC all the way to the max.\n\n​\n\nSince the efforts come in quick succession, and with most being over four minutes in length, your cardiovascular system never catches a real break, ensuring your MAP doesn’t get left out of the equation.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7888888888888889,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 5,
              "nm": 3,
              "map": 5,
              "ftp": 2
            },
            "tss": 68,
            "intensityFactor": 0.93
          },
          "workoutId": "ZBJBTvvtfe",
          "contentId": "e0fpoQCSWR",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 227,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Rue The Day",
          "style": null,
          "compatibility": 100,
          "description": "Those who have completed SUF icons like Blender, Mini Blender or the Chores will be familiar with the 40-seconds-hard/20-seconds-easy variety of Pain Shakes that Rue the Day delivers in three enticing courses. While the first few efforts in each set will feel \u0022easy,\u0022 since these blocks are stretched out to 8-minutes in length, you\u0027ll be deep into the red by the end of each set.\n\n​\n\nWhile the efforts aren\u0027t continuous, they are long enough that you accumulate plenty of time near your VO2max, which is the goal of any MAP workout. Each 8-minute set gives you more than five minutes at 90% or higher of your 5-minute peak power. By the end, you\u0027re looking at 16 minutes of accumulated MAP efforts, so get ready to say \u0027Hello, Pain!\u0027\n\nAlong the way, we\u0027ll give you some interesting mental tips on how to prepare for, and better manage, the discomfort (to put it mildly) that comes with such intense efforts. In the end, you\u0027ll be both a faster and a mentally stronger cyclist.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[Demystifying VO2 and VO2MAX](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/it-takes-vo2-to-tango-demystifying-vo2-and-vo2max)\u0027 and \u0027[The Power of Positive Mental Strategies](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/episode-29-how-to-use-positive-self-talk-to-get-through-tough-moments-on-a-ride-mental-strategies)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7580555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 57,
            "intensityFactor": 0.87
          },
          "workoutId": "1uKA4J5DIs",
          "contentId": "VBEbqmsmYl",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 228,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Blender",
          "style": null,
          "compatibility": 100,
          "description": "A smorgasbord of Suffering, this session has it all. Originally created in Coach Sir Neal Henderson\u0027s Penn State dorm room in 1992, it\u0027s his weapon of choice for bringing the pain (shakes).\n\n​\n\nWhat\u0027s in the Blender? First, a variety of longer efforts build sustained power while also making sure you\u0027re sufficiently fatigued. This initial beatdown is necessary to ensure you get the maximum benefit from _Blender_\u0027s infamous \u0027Pain Shakes.\u0027 Three sets of these little devils help you develop a supernatural ability to recover from big efforts. The bonus is that you also beef up your ability to produce high-end power, building Anaerobic Capacity and Maximal Aerobic Power simultaneously.\n\n​\n\nThe threshold efforts at the end are the bitter cherry on the sundae, improving your body\u0027s ability to produce aerobic power and helping make sure your FTP will get the same boost as your AC and MAP. A rising tide of lactic acid raises all boats. Oh, and clocking in at one hour and 40 minutes, Blender will also help whip your endurance into a frenzy.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.696388888888889,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 1,
              "map": 5,
              "ftp": 5
            },
            "tss": 133,
            "intensityFactor": 0.89
          },
          "workoutId": "ZWePe15MOH",
          "contentId": "14TmGHiqpC",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 230,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Model",
          "style": null,
          "compatibility": 100,
          "description": "They say that beauty is in the eye of the beholder. And through the bleeding eyes of Sufferlandrians, what could possibly be more beautiful than the sharp, saw-tooth profile of the workout you see before you? Full of gorgeous, shapely, shimmering blocks of yellow Maximal Aerobic Power (MAP) efforts interspersed with mercifully brief and slightly inadequate recoveries, it\u0027s a real stunner.\n\n​\n\nBut you know what\u0027s even better looking than this alluring workout? You (after you\u0027ve completed the workout, that is). Originally designed by our Head of Sports Science, Neal Henderson, for his professional athletes, The Model is a beautiful portrait of MAP brutality. It\u0027s one of those sessions that you think you can\u0027t finish, but always somehow do. It will leave you breathless, feeling all tingly, a bit confused and lying in a blubbering heap. It\u0027s a look. It will also deliver a nice boost to your fitness that always looks and feels good.\n\n​\n\nA true love letter to the beauty of professional cycling, The Model features a banging soundtrack and thrilling footage from both the men\u0027s and women\u0027s pelotons. With its eclectic design, effects, and graphics, you\u0027ll find yourself unable to tear your eyes away from the action on screen (assuming you can lift them from your stem).\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9844444444444445,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 1,
              "map": 5,
              "ftp": 5
            },
            "tss": 86,
            "intensityFactor": 0.9
          },
          "workoutId": "WQk9TYaUhj",
          "contentId": "NkctG9Onu1",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 231,
      "prospects": [
        {
          "type": "Cycling",
          "name": "A Very Dark Place",
          "style": null,
          "compatibility": 100,
          "description": "You know that ride where you thought you went harder, deeper, and to a darker place than you\u0027d ever gone before? HAHAHAHA. This takes you further, deeper, and darker than that. _A Very Dark Place_ (AVDP) is about maximum effort for shorter durations: five, four-minute intervals that take you to the limit. If you struggle with longer, high-intensity efforts and want to improve your ability to make repeated attacks, you need to spend some time in _A Very Dark Place_. Those little punches in the third and fifth efforts will teach you just how dark it can get.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8155555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 63,
            "intensityFactor": 0.88
          },
          "workoutId": "LTjVzi8Lrj",
          "contentId": "vCBrff5o6l",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 232,
      "prospects": [
        {
          "type": "Cycling",
          "name": "14 Vise Grips",
          "style": null,
          "compatibility": 100,
          "description": "You can never have too many tools in the shed. After years of lobbying, we finally convinced Grunter von Agony to share his favorite set of implements with us: the fabled _14 Vise Grips_. Taken individually, each of the 14 intervals might appear tame, incapable of inflicting a significant squeeze. But when expertly applied in the correct order, they apply just the right kind of pressure to turn a Couchlandrian into a Sufferlandrian, just like turning coal into diamonds.\n\n​\n\nWhile the duration of each Vise Grip varies (from 30 seconds to 2 minutes), the power targets and recovery durations between them remain constant. The first 30-second interval should feel like a Sunday stroll in the park, but by the end of the first 2-minute Vise Grip, you\u0027ll be cursing Grunter\u0027s name. As the intervals get shorter, time will appear to stretch. That final 30-second effort will feel like an eternity. When you roll up to the second set, you\u0027ll know what you\u0027re in for, so just put your head down and prepare yourself to crush or be crushed.\n\n​\n\nOnce you make it through all 14 Vise Grips, you will have been north of your Maximal Aerobic Power (MAP) for a total of 16 minutes. Changing the duration of the efforts (while keeping the same recovery) stresses your Anaerobic Capacity (AC) in a more dynamic way than, say, a more straightforward on/off session like _Half is Easy_. Since the longer efforts have the same recovery duration as the shorter ones, you will eventually deplete your AC, forcing your body to rely on your MAP to hit the required power targets. As the intervals get shorter in the second half of each set, you\u0027ll find that you have just enough left in the tank to complete the next effort.\n\n​\n\nUltimately this workout combines the advantages of shorter, higher-power intervals with longer recovery (great for building muscular strength) with the advantages of longer, higher-power intervals with inadequate recovery (great for driving up your MAP and improving your AC).\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9191666666666667,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 77,
            "intensityFactor": 0.91
          },
          "workoutId": "q92iqWDfcB",
          "contentId": "PexwKSHyz6",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 229,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Who Dares",
          "style": null,
          "compatibility": 100,
          "description": "Imagine you’re out on a group ride where the tempo is high, and you’re working hard. Suddenly, someone surges. You do a quick sprint to go after them and quickly get their wheel. The stress of the effort catches up with you, and even though the pace settles down to where it was before, you struggle to hold the wheels.\n\n​\n\nWho Dares is a workout that teaches your body to recover from those efforts more effectively so you can keep riding hard. The workout is based on three 9.5-minute, sub-FTP intervals that feature three sprints: one at the start, one in the middle, and one at the end. These sprints flood your body with metabolites like lactate, then the sustained sub-FTP efforts force your body to clear them out while still working hard.\n\n​\n\nTo make the session even more effective, Who Dares also asks your body to do this work at different cadences, stimulating the nervous system and forcing your body to become even more efficient.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8825,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 3,
              "map": 1,
              "ftp": 5
            },
            "tss": 71,
            "intensityFactor": 0.9
          },
          "workoutId": "azNGdXLGqX",
          "contentId": "3rLnRlTdQ3",
          "notes": "",
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": []
}