{
  "id": "ElH7Kq2BKv",
  "name": "Wahoo X June Challenge: Foundation First",
  "weakness": "NoWeakness",
  "grouping": "June: Foundation First",
  "category": "",
  "subcategory": "None",
  "description": "#### Lay the groundwork.\n\nThis month, slow it down to level up. With these four workouts, you’ll train your body to ride smarter, not harder — developing low-cadence strength, pedaling efficiency, and aerobic endurance that lasts all summer long. No intervals to fear. No max efforts to dread. Just four powerful sessions to build the base every rider needs.\n\nComplete all 4 cycling workouts by June 30 to earn your badge.\n\n​\n\nComplete all 4 workouts by June 30 to earn your badge:\n\n- Elements of Style\n- The Way Out\n- Cadence Builds and Holds\n- G.O.A.T.\n\nFind out more about the Wahoo X Monthly Challenge [**HERE**](https://wahoox.forum.wahoofitness.com/t/wahoo-x-june-challenge-foundation-first/29191)**.**\n",
  "planDescription": "Wahoo X Monthly Challenge",
  "fixedEndDate": "",
  "level": "",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "1 Week",
  "progression": "None",
  "hidden": true,
  "createdAt": "2023-04-17T20:13:38.289Z",
  "updatedAt": "2025-09-11T10:46:26.728Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": true,
  "metadata": {
    "internalNotes": ""
  },
  "primary": [
    {
      "day": 0,
      "type": "Cycling",
      "rank": 223,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Elements Of Style",
          "style": null,
          "compatibility": 100,
          "description": "Can you ride? With Style? Make riding under pressure look effortless? Although this is a sub-threshold session, _Elements of Style_ may just be our most important session ever.\n\nDeveloped together with the team at CyclingTips and shot on location in Wanaka, New Zealand, this workout provides the foundation for building power and speed. Over the course of six specific drills, you\u0027ll learn and practice:\n\n- An exclusive 9-point \u0027Systems Check\u0027 you can use on any ride to get into your optimal position.\n- A 4-step process for standing up on a climb and generating more power. How to engage your core, including your glutes, for more stability and power.\n- The components of a smooth pedal stroke and how to bring them together at both low and high cadences.\n- How to stay relaxed and efficient under pressure.\n\nNarrated by one of the best cycling commentators in the world, Eurosport\u0027s Carlton Kirby, you\u0027ll get clear instructions about exactly what to do, when, and why. We guarantee it will change the way you think about your riding style after doing it just once. Do it five times, and you\u0027ll automatically adjust your position while out on rides. Do it 10 times, and Sufferlandrian Angels will burst into tears at the sheer epic beauty of you kicking the crap out of your competition while making it look oh so effortless.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6158333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 1,
              "ftp": 4
            },
            "tss": 41,
            "intensityFactor": 0.82
          },
          "workoutId": "6EG2ChOeVd",
          "contentId": "hNNHBG5PEv",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 1,
      "type": "Cycling",
      "rank": 222,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Way Out",
          "style": null,
          "compatibility": 100,
          "description": "One of the few Sufferfest sessions that can be viewed as a sweet-spot session since the intervals aren’t above threshold (except for the very end) but are harder than a tempo effort.\n\n​\n\nThis session pushes your body close to the limit of what it can comfortably handle without going any further. Why? Going above threshold causes a considerable amount of hormonal stress that takes a lot of time to recover from. But you don’t actually have to ride above threshold to improve your FTP. The difference in fitness gains between 30 minutes at 90% of threshold and at 102% of threshold is minimal. Still, the stress on your body from the latter is much greater, and the recovery much longer.\n\n​\n\nThat\u0027s why this session is a key component to any training plan: It gives you enough training stress to help improve your FTP but remains \u0027easy\u0027 enough that you can do it when you\u0027re tired or before a big block of harder efforts.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9836111111111111,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 5
            },
            "tss": 68,
            "intensityFactor": 0.83
          },
          "workoutId": "sG7DReLUhT",
          "contentId": "AnUAo2ZSsd",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 2,
      "type": "Cycling",
      "rank": 221,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Cadence Builds and Holds",
          "style": null,
          "compatibility": 100,
          "description": "This workout is another excellent addition to our \u0022Drills\u0022 series. Over the next 45 minutes, you will complete four 30-second cadence builds, and six 60-second high cadence holds. This workout places a considerable demand on your Neuromuscular System, as your muscles are forced to contract and relax as quickly as possible. At the same time, the shorter recovery period between these drills will keep your heart rate, and breathing rate elevated, giving you a great cardiovascular workload.\n\n​\n\nLet\u0027s breakdown the two drills you will be doing.\n\n​\n\n**Cadence Builds:** The name of the game here is absolute peak cadence, not peak power. To achieve this, you need to be in a small gear and have very light resistance. Starting at 90-RPM, steadily increase your cadence until you reach your absolute max with about 5-seconds left, and hold that to the end. Your limiting factor on these efforts needs to be leg speed. If resistance/power output is your limiting factor, try starting in an easier gear, or shift into an easier gear 15-seconds in. Bouncing in the saddle is okay for this drill.\n\n​\n\n**Cadence Holds**: These efforts require you to maintain the highest cadence you can without starting to bounce in the saddle. For some of you that will be 100-RPM, for others, it will be 150-RPM. The key is to settle into YOUR peak sustainable cadence. Like the Builds, the goal here is not high power, so these efforts are limited to 90% of FTP. Do not be surprised if your heart rate is well into Zone 4 by the time you hit the last few holds.\n\nTo properly execute this session, your effort between drills needs to be low. With limited recovery time between these maximal Neuromuscular Efforts, riding above Zone 1 between efforts will only reduce your ability to max out your cadence. While the power targets between are Zone 1, do not be surprised if your heart rate does not drop below Zone 2 after the first couple builds.\n\n​\n\nWORKOUT GOALS:\n\n- Improved muscle recruitment and firing patterns\n- Improved muscle coordination at higher cadences\n- Deliver a high Neuromuscular and Cardiovascular load while minimizing the power demands placed on your muscles\n- Help you develop a silky smooth pedal stroke\n\nCADENCE TARGETS:\n\n- Warm-up 80-90rpm\n- Build: 90-150rpm\n- Hold: 115rpm\n\n**Warm Up**\n\n6 minutes @ RPE32 -- 55% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort **Number of Sets: 2, each unique\n\nRest Between Sets: N/A\n\nInterval Repeats Per Set: N/A\n\n**Set 1: x4 Cadence Build**\n\n30 seconds @ RPE 8 -- Starting at 90RPM Build to Max RPM -- Max Power is NOT Goal\n\n2 minutes 30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n**Set 2: x6 Cadence Hold**\n\n60 seconds @ RPE 7.5 -- \u003C100% FTP -- Highest RPM you can hold without Bouncing\n\n3 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n3 minutes @ RPE 1.5 -- 45% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.75,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 5,
              "map": 1,
              "ftp": 2
            },
            "tss": 29,
            "intensityFactor": 0.62
          },
          "workoutId": "yS7hWOEZqp",
          "contentId": "wzRaKLHBxv",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 3,
      "type": "Cycling",
      "rank": 220,
      "prospects": [
        {
          "type": "Cycling",
          "name": "G.O.A.T.",
          "style": null,
          "compatibility": 100,
          "description": "This session is all about high-torque efforts, very similar to the efforts you would experience riding up the steep slopes of Mt Sufferlandria. While these efforts are short and the intensity isn’t too high, the low cadence targets combined with minimal recovery will leave some begging for the high-cadence sprints of _The Omnium_. High-torque efforts like these have two primary benefits: improved neuromuscular coordination and increased muscular endurance.\n\n​\n\nDuring each pedal revolution, your legs have to “switch on” and “switch off” almost all of the muscles in your legs. High-cadence efforts in something like _Cadence Builds_ are great for teaching these groups to make that switch quickly. These low-cadence efforts are better for teaching ALL of the muscles in your legs to “switch on.” Done properly, you should be pulling with your hamstrings with one leg while the other leg is pushing down with all the force your glutes and quads can muster. If you feel like you are pushing yourself up out of the saddle during harder efforts (like seated sprints), your hamstrings are not being utilized since they should pull you back down into your saddle.\n\n​\n\nThe second main benefit is improved muscular endurance. Even though the session is under 45 minutes, **you\u0027ll put a similar amount of muscular fatigue into your legs as a steady, multi-hour base ride.** You can almost view this session as hitting the leg press for 8 sets of 100 reps. And just like the weight room, proper form is absolutely key. That means:\n\n- You should focus on pushing down AND pulling back up. You want your glutes and quads activated on the way down and your hamstring and hip flexors activated on the way up.\n- To properly engage your hamstrings think about trying to pulling your heel up to your butt when your crank arm is going from 6 o’clock to 10 o’clock.\n- Your knees should be tracking straight up and down, no collapsing in or out.\n- Your core should be fully engaged to keep your hips steady in the saddle. This will be easier if you are both pushing and pulling during each pedal revolution.\n\nThis session is very similar to _Power Station_. Both help improve your muscular endurance and coordination; the biggest difference is the work to rest ratio between the two. While the intervals here are shorter than those in _Power Station_, the decreased recovery duration means fatigue will build faster, especially for those with a weakness in repeated efforts.\n\nModifying interval length and recovery duration can also be seen between sessions like _Revolver_ and _A Very Dark Place_. Both serve up a healthy dose of MAP/VO2 work, but the overall feeling of those two sessions is different.\n\nIf you find that your lower back starts to ache during this session or that you have to start rocking in the saddle to keep the power up, then it’s time for you to get started on the SYSTM Yoga program. Kick it off with “Core Strengtheners ” to make sure your core is just as strong as those legs.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[When to Train with Low Cadence](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/when-to-train-with-low-cadence)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6986111111111111,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 3,
              "map": 1,
              "ftp": 4
            },
            "tss": 49,
            "intensityFactor": 0.84
          },
          "workoutId": "4tEUYuJNcB",
          "contentId": "cCBhlcg2Ye",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": []
}