{
  "id": "eYPgqAsTbg",
  "name": "2022 Post ToS - Yoga addon",
  "weakness": "NoWeakness",
  "grouping": "Post Tour",
  "category": "Tour of Sufferlandria",
  "subcategory": "None",
  "description": "### Goal\n\nTo properly structure your post-ToS recovery week, and get you ready for another crack at Full Frontal\n\n### Best for\n\nThose who are feeling exceptionally fatigued, and/or completed the Nuclear option and need some proper rest before another crack at Full Frontal\n\n### Training volume\n\n2 to 4 hours per week\n\n### Plan ends with\n\nFull Frontal\n\n### Special Notes\n\nRecovery is important, don\u0027t be afraid to take it nice and easy for the first week after stage 9!\n",
  "planDescription": "For those who had to dig deep every day to finish the tour",
  "fixedEndDate": "2022-03-13",
  "level": "Very Fatigued",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "None",
  "progression": "None",
  "hidden": true,
  "createdAt": "2021-12-20T22:15:35.537Z",
  "updatedAt": "2025-07-01T16:04:49.568Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": true,
  "metadata": {
    "internalNotes": ""
  },
  "primary": [
    {
      "day": 6,
      "type": "Cycling",
      "rank": 206,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Cool Down: 20 Minutes",
          "style": null,
          "compatibility": 100,
          "description": "This extended cool-down gives you an extra 20 minutes of pedaling time. Similar to the other cool-down protocols, this one includes two short efforts in the tempo zone to help speed your recovery by flushing clean, fresh blood through the working muscles and clearing metabolites from the hard session you just completed. Turn up that playlist and let\u0027s get pedaling!\n",
          "intensity": {
            "master": null,
            "nm": 1,
            "ac": 1,
            "map": 1,
            "ftp": 0.85
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.3333333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 16,
            "intensityFactor": 0.69
          },
          "workoutId": "yMCmUt2f2w",
          "contentId": "codNfJPCdo",
          "notes": "",
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 8,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Other French Race",
          "style": null,
          "compatibility": 100,
          "description": "🎬 Film: Rupert Guinness entered the Haute Route Alps in France looking for a new challenge to test his physical and mental strength. But after 800km of cycling through the Alps from Nice to Megève, the cycling journalist and author realized that the experience had delivered to him and the 400-plus starters something far greater. It had provided them with the adventure of a lifetime; from a sense of what it would be like to ride in the fabled Tour de France that he has reported on more than 30 times, to the creation of friendships with fellow riders forged by their shared suffering and encouragement for one another as they cycled through some of the toughest and most spectacular mountains that cycling has to offer.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5291666666666667,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 19,
            "intensityFactor": 0.6
          },
          "workoutId": "fiQklsxqiH",
          "contentId": "X7LsDQ8h23",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 10,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
          "style": null,
          "compatibility": 100,
          "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6011111111111112,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 1,
              "ftp": 2
            },
            "tss": 20,
            "intensityFactor": 0.62
          },
          "workoutId": "rUrrfvb8ii",
          "contentId": "p6E2zIaYNZ",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 12,
      "type": "Cycling",
      "rank": 205,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Serbia Upside Down Ep. 4",
          "style": null,
          "compatibility": 100,
          "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.4261111111111111,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 2
            },
            "tss": 15,
            "intensityFactor": 0.6
          },
          "workoutId": "6ITstvyaRu",
          "contentId": "xQ2H675VAR",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 13,
      "type": "Cycling",
      "rank": 204,
      "prospects": [
        {
          "type": "Cycling",
          "name": "French Pyrenees: Cirque du Litor",
          "style": null,
          "compatibility": 100,
          "description": "The Cirque du Litor is one of the absolute highlights of the French Pyrenees. This ride starts at the top of the Col du Soulour and, after a short downhill, steadily climbs up to the legendary Col d\u0027Aubisque. And, like the climb itself, we\u0027ll gradually increase the effort on the way up until we\u0027re at our limit by the top. Along the way, you\u0027ll try some world-class Pan au Chocolat, keep your eye out for eagles, dive into the local mining history, and relive an epic moment in Tour de France history.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/3778593533)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5238888888888888,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 4
            },
            "tss": 33,
            "intensityFactor": 0.81
          },
          "workoutId": "gNx2FQGTcV",
          "contentId": "SjTO6Y0ANo",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 15,
      "type": "Cycling",
      "rank": 203,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Cadence Builds",
          "style": null,
          "compatibility": 100,
          "description": "One of the best sessions for neuromuscular training, this drill asks you to progressively build from a cadence of 90 RPM to your MAX over 30 seconds, recover, and repeat several times. Cadence builds improve how you recruit your leg, gluteal, and core muscles throughout your pedal stroke by progressing to your maximal cadence. By reaching your highest cadence possible, you are training the \u0027on/off\u0027 switch in each muscle group to not only work faster but to have less overlap with your other muscle groups. This session trains your hamstring muscles to \u0027turn off\u0027 when your quads \u0027turn on\u0027 and vice-versa, resulting in a more efficient pedal stroke at both high and low cadences.\n\n​\n\n**LEARN MORE**\n\nListen to The Knowledge podcast, by Wahoo Sports Science - The Benefits of High Cadence Training: [https://wahoosystm.com/BenefitsofHighCadence](https://wahoosystm.com/BenefitsofHighCadence)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5480555555555555,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 5,
              "map": 1,
              "ftp": 1
            },
            "tss": 21,
            "intensityFactor": 0.62
          },
          "workoutId": "04BfbUGDMk",
          "contentId": "n3WrizBr1g",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 16,
      "type": "Cycling",
      "rank": 202,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Half Monty (Ramp Test)",
          "style": null,
          "compatibility": 100,
          "description": "**Half Monty: The Easy One.**\n\n​\n\nWe recommend this fitness test for:\n\n- Newer riders\n- Athletes with limited experience pacing maximal efforts / fitness testing.\n- Those who are mid-plan or who just want to get a sense of where their fitness is.\n\nThe _Half Monty_ 4DP fitness test is the most accurate and complete ramp test available. While it\u0027s not as comprehensive or as accurate as our main fitness test, _Full Frontal_, it\u0027s far more approachable and easier to pace for new riders. It also doesn\u0027t require any special preparation. You just need to feel relatively fresh.\n\n​\n\nBased on more than a year of research (and after dozens of lab tests and thousands of online tests) and using sophisticated analysis of power and heart rate data, _Half Monty_ is far more accurate and comprehensive than standard ramp tests.\n\n​\n\nIt also tells you more about who you are as an athlete. _Half Monty_ provides you with your FTP, Maximal Aerobic Power (MAP), and Cycling Threshold Heart Rate (cTHR), all of which we use to personalize your workout targets.\n\n​\n\nIf you\u0027re still using the 4DP estimates when you set up your account, _Half Monty_ will also refine your AC and NM estimates (but will not do so if you\u0027ve done _Full Frontal_ or manually adjusted your estimates). If you want fully accurate AC and NM, as well as your Rider Type, Strengths, Weaknesses, and training plans adjusted to those Strengths and Weaknesses, you\u0027ll need to expose yourself to the _Full Frontal_ 4DP fitness test.\n\n​\n\nReady to climb the ramp? You\u0027ll need the following before you start:\n\n- A heart rate monitor if you want the most accurate results. Don\u0027t have one? Order one [HERE](https://wahoofitness.com/devices)\n- Some kind of power device connected (trainer, power meter, virtual power, etc.)\n- Be ready to pay close attention to the instructions in the workout\n- Be sure your profile is complete and up-to-date (Profile \u003E About You). Accurate information helps us make our calculations\n\n**LEARN MORE**\n\nListen to \u0027[Why Fitness Testing Matters](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/testing-testing-1-2-3-why-fitness-testing-matters)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n\n​\n\n[Here\u0027s some more information on how to get the most from your fitness test.](https://wahoosystm.com/HelpCenterFitnessAssessment)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9666666666666667,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 3
            },
            "tss": 71,
            "intensityFactor": 0.85
          },
          "workoutId": "0SmbqUIZZo",
          "contentId": "OIJSfIrGTL",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 19,
      "type": "Cycling",
      "rank": 201,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Primers",
          "style": null,
          "compatibility": 100,
          "description": "Whether you have a 4DP® fitness test coming up, a group ride you want to smash, that event you have been training all winter for, or even just a fun route you want to have a great ride on, this is the perfect session to do the day before. Unlike other SYSTM sessions, this one should not be viewed as a stand-alone “training” session, but rather, the ace up your sleeve you pull out when that big ride comes around. The key to this session is having you spend just enough time right around threshold, with sufficient recovery between efforts and a handful of sprints to prime all of your systems for tomorrow\u0027s event.  \n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7252777777777778,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 42,
            "intensityFactor": 0.76
          },
          "workoutId": "ZH40tnQwpo",
          "contentId": "J4Qiw1pvbL",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 20,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Full Frontal (4DP Assessment)",
          "style": null,
          "compatibility": 100,
          "description": "Full Frontal: The Complete One.\n\nWe recommend the Full Frontal 4DP fitness assessment for:\n\n- Experienced riders.\n- Athletes with experience pacing maximal efforts / fitness testing.\n- Those about to start—or who have just finished—a training plan.\n\nThis is our full 4DP fitness test and is the only test that exposes every aspect of your unique physiology in a single hour. Developed by Head of Wahoo Sports Science Coach Neal Henderson, Full Frontal uses the same lab-verified testing protocol that Coach Neal has used at the highest level for over a decade with professional and amateur athletes.\n\n​\n\nThis test will provide you with a complete Four-Dimensional Power profile, identify your Rider Type, and tell you exactly what aspects of your fitness you need to focus on to become a more complete cyclist. More importantly, SYSTM will then use your results to set personalized power targets for all of your workouts based on your unique profile, resulting in the most precise, effective workouts available. Your results will also be used to tailor all of your training plans.\n\n​\n\nWe recommend re-testing with Full Frontal every 8-12 weeks or as prescribed by your training plan.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[Why Fitness Testing Matters](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/testing-testing-1-2-3-why-fitness-testing-matters)\u0027 on The Knowledge Podcast by Wahoo Sports Science\n\n​\n\n[Here\u0027s some more information on how to get the most from your fitness test.](https://wahoosystm.com/HelpCenterFitnessAssessment)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9819444444444444,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 5,
              "nm": 5,
              "map": 5,
              "ftp": 5
            },
            "tss": 83,
            "intensityFactor": 0.92
          },
          "workoutId": "dRcyg09t6K",
          "contentId": "XFMPELnuFo",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": []
}