{
  "id": "GSpDW86vBO",
  "name": "A Week With UCI World Cycling Center",
  "weakness": "NoWeakness",
  "grouping": "A Week With",
  "category": "",
  "subcategory": "None",
  "description": "A Week With UCI World Cycling Center\n\n​\n\nSelecting a Monday start day will see the plan finishing on Sunday, Selecting a Tuesday start date will see the plan finishing on Monday.\n\n​\n\nIf you are in need of any technical help or want to know more about the training terms used in this plan check out the [Wahoo SYSTM Help Center.](https://wahoosystm.com/HelpCenter)\n\n​\n\nHave a more specific question that isn\u0027t addressed in the Help Center? Head over to our [forum](https://wahoox.forum.wahoofitness.com/) to see if your question has been answered, or just post it for yourself.\n\n​\n\n",
  "planDescription": "World Cycling Center",
  "fixedEndDate": "",
  "level": "",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "1 Week",
  "progression": "None",
  "hidden": false,
  "createdAt": "2022-10-31T19:09:57.931Z",
  "updatedAt": "2023-09-25T17:03:10.338Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": null,
  "metadata": {
    "internalNotes": ""
  },
  "primary": [
    {
      "day": 0,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 1: Introduction",
          "style": null,
          "compatibility": 100,
          "description": "The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the[ UCI World Cycling Centre](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN) (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders per year across BMX Racing \u0026 Freestyle, Road, Track, and Mountain Bike.\n\n​\n\nA phone call with an invitation to spend a season living and training at the exclusive WCC can change the life of these young athletes. _And….hey….is that your phone ringing?_\n\n​\n\nThat’s right - you’ve been noticed! In this introduction to A Week With the World Cycling Centre, WCC Performance Manager [Liam Phillips](https://en.wikipedia.org/wiki/Liam_Phillips) invites you to come and spend a week with his team (insert frenzied screams of delight here). He’ll outline the week, introduce you to the staff and coaches, and help you prepare for what’s sure to be an incredible experience of training, stories, friendships, and behind-the-scenes insights. Pack your bags!\n\n​\n\n_Schedule for A Week with the World Cycling Centre (full series released November 29th!):_\n\n_**Day 1/7: Introduction**_\n\n_Day 2/7: Tour_\n\n_Day 3/7: Velodrome_\n\n_Day 4/7: Road_\n\n_Day 5/7: Off_\n\n_Day 6/7: BMX_\n\n_Day 7/7: Mountain Bike_\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.07555555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": null,
              "nm": null,
              "map": null,
              "ftp": null
            },
            "tss": 1,
            "intensityFactor": 0.44
          },
          "workoutId": "5EXsuhMJ9G",
          "contentId": "xJLEea7WGq",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 1,
      "type": "Cycling",
      "rank": 205,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 2: Tour",
          "style": null,
          "compatibility": 100,
          "description": "You’ve made it to Switzerland to start your week-long residence at the [UCI World Cycling Centre](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN). Liam Phillips and the rest of the performance staff are keen to see whether you’re best at BMX Racing, Road, Track, or MTB – but they understand you’ve had a long trip and need to ease into things with a little tour of your new home away from home.\n\n​\n\nAnd who could be better to give you a full behind-the-scenes tour of the facility than the Director of the World Cycling Center, [Jacques Landry](https://www.uci.org/article/uci-world-cycling-centre-introducing-jacques-landry-head-of-training-and/1rG3ppkZehv6VaGu9EeqDP)? Starting from reception, Jacques will take you on a personal walk around the building, telling stories and giving you an insight into what it takes to run such an incredible complex (Is this the only office in the world where you can spend your lunch break on a velodrome?) Along the way, you’ll meet the coaches and staff who are entirely focused on helping athletes (athlete’s like you!) achieve their dreams.\n\n​\n\n_About the workout_: This is an easy 30-minute session that is perfect to get you ready for the hard sessions which follow over the rest of the week.\n\n​\n\n_Schedule for A Week with the World Cycling Centre:_\n\n_Day 1/7: Introduction_\n\n_**Day 2/7: Tour**_\n\n_Day 3/7: Velodrome_\n\n_Day 4/7: Road_\n\n_Day 5/7: Off_\n\n_Day 6/7: BMX_\n\n_Day 7/7: Mountain Bike_\n\n​\n\n​\n\n_The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the _[_UCI World Cycling Centre_](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN)_ (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders a year across BMX Racing \u0026 Freestyle, Road, Track, and Mountain Bike. The A Week With the UCI World Cycling Centre series workouts give you a never-before-seen behind-the-scenes experience of what it\u0027s like to live and train at this exclusive centre._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5147222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 15,
            "intensityFactor": 0.53
          },
          "workoutId": "CqVmBaRnvC",
          "contentId": "a0JlW7eH0H",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 2,
      "type": "Cycling",
      "rank": 201,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 3: Velodrome",
          "style": null,
          "compatibility": 100,
          "description": "Today, you\u0027re at the [UCI World Cycling Centre](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN) and face-to-face with legendary Track Coach [Craig McClean](https://en.wikipedia.org/wiki/Craig_MacLean). Craig\u0027s been excited to meet you and really wants to see what you\u0027re capable of. So, to really uncover that, he has you join a paceline behind the motorbike as a solid warm-up. After you\u0027ve had a chance to recover from that, he throws you into a 20 lap scratch race with the women\u0027s team to see whether you\u0027ve got what it takes to finish up front.\n\n​\n\nOnce that\u0027s over, it\u0027s time to really push the limits and find out what you can do in a series of track sprints. Along the way, Craig will share his thoughts on what it takes to be a world-class sprinter, explain the equipment track cyclists use and even tell you how velodromes are made. You\u0027ll also get to meet some of the track athletes-in-residence, listen to their stories and why they\u0027re at the WCC. At the end of the day, you\u0027ll head to the Velodrome restaurant and learn what the chef believes is most important when feeding the athletes -- and it\u0027s not nutrition!\n\n​\n\n_About the workout_: Don\u0027t be fooled by all those recovery efforts. This 52-minute workout will give you a real taste of what it\u0027s like to be on the track. A long and solid warm-up gets you near threshold, and the 6-minute scratch race will have you on the red-line as you handle multiple surges above threshold. The four maximum-effort sprints will help develop your Neuromuscular capacity. Throughout it all, you\u0027ll be riding at a rather high cadence to more closely mimic what happens out on the boards.\n\n​\n\n_Schedule for A Week with the World Cycling Centre:_\n\n_Day 1/7: Introduction_\n\n_Day 2/7: Tour_\n\n_**Day 3/7: Velodrome**_\n\n_Day 4/7: Road_\n\n_Day 5/7: Off_\n\n_Day 6/7: BMX_\n\n_Day 7/7: Mountain Bike_\n\n​\n\n_The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the _[_UCI World Cycling Centre_](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN)_ (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders a year across BMX Racing \u0026 Freestyle, Road, Track and Mountain Bike. The A Week With the UCI World Cycling Centre series workouts give you a never-before-seen behind-the-scenes experience of what it\u0027s like to live and train at this exclusive centre._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8652777777777778,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 4,
              "map": 2,
              "ftp": 3
            },
            "tss": 99,
            "intensityFactor": 0.98
          },
          "workoutId": "A7Hd4xSEaj",
          "contentId": "Dak3Hw1Y1E",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 3,
      "type": "Cycling",
      "rank": 202,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 4: Road",
          "style": null,
          "compatibility": 100,
          "description": "Yesterday was a pretty tough session on the Velodrome. So let\u0027s get some fresh air and head out with the UCI [World Cycling Centre Women\u0027s Team](https://www.uci.org/article/uci-world-cycling-centre-wcc-team-already-rubbing-shoulders-with-the-worlds/42DE3MewXH6qWfqvxaC9op). With riders from South Africa, Eritrea, Argentina, Japan, Colombia \u0026 Belarus, and with a coach from Spain, [Cristina San Emeterio](https://www.uci.org/article/introducing-cristina-san-emeterio-the-new-wcc-team-coach/7bTthBndY5j7vyXrZ3n3R4), you\u0027re in for quite a multicultural experience.\n\n​\n\nAnd a fast one. This team isn\u0027t messing around as they take you out for a team time trial up the infamous climb of Torgon, a true proving ground for WCC athletes. After a short break, you\u0027ll get to do a race simulation with the team up the final climb of the day -- can you stay with their South African climbing ace?\n\n​\n\nAlong the way, you\u0027ll get a behind-the-scenes look at what it\u0027s like to live at the WCC, learn more about these very special riders, take a tour of the Mechanic\u0027s Service Course, and get plenty of insight and coaching from Cristina as she steers the team to ever greater success.\n\n​\n\n**About the workout: **We\u0027re hitting nearly all the energy systems today in this long session. You\u0027ll get a nice FTP push from the team time trial as you gradually ratchet up the intensity and really squeeze things near the top. In the race simulation, you\u0027ll dig into those MAP reserves as you follow moves and try to make your mark. The long descent (as well as the warm-up) provides some additional aerobic volume.\n\n​\n\n_Schedule for A Week with the World Cycling Centre:_\n\n_Day 1/7: Introduction_\n\n_Day 2/7: Tour_\n\n_Day 3/7: Velodrome_\n\n_**Day 4/7: Road**_\n\n_Day 5/7: Off_\n\n_Day 6/7: BMX_\n\n_Day 7/7: Mountain Bike_\n\n​\n\n_The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the _[_UCI World Cycling Centre_](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN)_ (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders a year across BMX Racing \u0026 Freestyle, Road, Track, and Mountain Bike. The A Week With the UCI World Cycling Centre series workouts give you a never-before-seen behind-the-scenes experience of what it\u0027s like to live and train at this exclusive centre._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.4575,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 3,
              "ftp": 5
            },
            "tss": 140,
            "intensityFactor": 0.96
          },
          "workoutId": "komBihdemF",
          "contentId": "uXDmbon4O2",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 5,
      "type": "Cycling",
      "rank": 203,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 5: BMX",
          "style": null,
          "compatibility": 100,
          "description": "And so, here you are, on the 8-meter high starting ramp with some of the most talented young riders in the world. Yesterday was a day off, so you\u0027ve had plenty of time to rest and prepare for the intensity of BMX Racing. UCI [World Cycling Centre](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN) Performance Manager \u0026 BMX Coach [Liam Phillips](https://en.wikipedia.org/wiki/Liam_Phillips) understands you haven\u0027t ridden a BMX since you were a kid, so he takes the time to explain the track, the bikes, the physiological demands, and the tactics of this high-speed sport.\n\n​\n\nYou\u0027ll get to warm up while you [meet the riders](https://www.uci.org/article/2022-for-the-uci-world-cycling-centres-bmx-racing-group-a-uci-world-champion/3arQkzPzAAx3YKGLw2smGU) and do a few laps of the pump track. From there, it\u0027s straight up the ramp to face five flat-out laps of the circuit with the BMX riders-in-residence at the UCI WCC. Ready for action? Then pull down that full-face helmet, adjust your protective gear and get ready to fly.\n\n​\n\n_About this workout_: This is an absolutely stellar session to drive improvements in your Anaerobic Capacity (AC). With efforts just a bit longer than the ones you experienced in the Velodrome session, you\u0027ll need to hang onto these high-power efforts until the very end. With long recoveries, you\u0027ll be able to repeat the efforts again and again -- which will improve your ability to do the same out on the road.\n\n​\n\n_Schedule for A Week with the World Cycling Centre:_\n\n_Day 1/7: Introduction_\n\n_Day 2/7: Tour_\n\n_Day 3/7: Velodrome_\n\n_Day 4/7: Road_\n\n_Day 5/7: Off_\n\n_**Day 6/7: BMX**_\n\n_Day 7/7: Mountain Bike_\n\n​\n\n_The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the _[_UCI World Cycling Centre_](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN)_ (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders a year across BMX Racing \u0026 Freestyle, Road, Track, and Mountain Bike. The A Week With the UCI World Cycling Centre series workouts give you a never-before-seen behind-the-scenes experience of what it\u0027s like to live and train at this exclusive centre._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7594444444444445,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 3,
              "map": 3,
              "ftp": 2
            },
            "tss": 59,
            "intensityFactor": 0.88
          },
          "workoutId": "EXYlLnZXXf",
          "contentId": "a4TVWzhFsz",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 6,
      "type": "Cycling",
      "rank": 204,
      "prospects": [
        {
          "type": "Cycling",
          "name": "UCI Centre 6: MTB Race",
          "style": null,
          "compatibility": 100,
          "description": "Here it is -- your last chance to impress the UCI [World Cycling Centre](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN) coaches. You\u0027re up early and off to La Thuile, Italy with the WCC Mountain Bike Team and Coach [Charlie Evans](https://ch.linkedin.com/in/charlieevansbikelife) for a [high-level MTB race](https://www.internazionaliditaliaseries.it/la-thuile/) that\u0027s a World Cup warm-up for many elite riders. But this isn\u0027t just any race -- it\u0027s one of the most technical and challenging on the circuit, something that Coach Charlie drives home quite clearly when you first meet him.\n\n​\n\nAfter a good solid-warm up, you\u0027ll line up for two laps of the course. First with Argentina\u0027s Luli Brand in the Women\u0027s Elite/U23 event and then with Namibia\u0027s Hugo Hahne in the Men\u0027s Elite/U23s. Along the way, you\u0027ll get to know the riders on the team, and learn from Coach Charlie what he expects from the riders and what he\u0027s hoping they learn.\n\n​\n\nAt the end, it\u0027s back on the bus for the ride home and a meeting with Performance Manager Liam Phillips and WCC Director Jacques Landry. _Have you done enough to secure a place at the WCC?_\n\n​\n\n_About the workout:_ This is probably as close as you\u0027re going to get to the thrill and excitement of an actual UCI MTB race without actually entering one. A long warm-up gets you ready for the two, intense laps of the La Thuile circuit. It\u0027ll be tough at the end of this UCI WCC week, but you\u0027ll need to dig deep into your MAP power to get through each lap. The frequent downhills, although short, do provide enough rest to help you get through it as does the long recovery between laps. You\u0027ll be immensely proud of yourself after finishing this and your MAP and FTP levels will get a boost as a result of all the hard work. Just what the coaches ordered.\n\n​\n\n_Schedule for A Week with the World Cycling Centre:_\n\n_Day 1/7: Introduction_\n\n_Day 2/7: Tour_\n\n_Day 3/7: Velodrome_\n\n_Day 4/7: Road_\n\n_Day 5/7: Off_\n\n_Day 6/7: BMX_\n\n_**Day 7/7: Mountain Bike**_\n\n​\n\n_The Union Cycliste Internationale (UCI) is the governing body for world cycling. In 2002, the _[_UCI World Cycling Centre_](https://www.uci.org/uci-wcc/5LpWb6Az76H9o9eyfzLweN)_ (WCC) was opened in Aigle, Switzerland to give promising athletes from developing nations a better chance to realize their dreams. Today, the elite training facility - an impressive building on the banks of the Rhone River at the Eastern edge of Lake Geneva - supports more than 100 riders a year across BMX Racing \u0026 Freestyle, Road, Track, and Mountain Bike. The A Week With the UCI World Cycling Centre series workouts give you a never-before-seen behind-the-scenes experience of what it\u0027s like to live and train at this exclusive centre._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9980555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 1,
              "map": 4,
              "ftp": 3
            },
            "tss": 114,
            "intensityFactor": 0.88
          },
          "workoutId": "hcjevWmVOD",
          "contentId": "Fm82f7CTIw",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": []
}