{
  "id": "QWEv625kp4",
  "name": "KoS Quest - Scenic Lactic Acid Coastline (shortest)",
  "weakness": "NoWeakness",
  "grouping": "Scenic Lactic Acid Coastline (shortest route)",
  "category": "",
  "subcategory": "None",
  "description": "**Congrats on accepting the Knighthood Challenge!**\n\nThis plan will load the 10 shortest workouts available for you to complete your Knighthood.\n\nA reminder of the rules:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
  "planDescription": "Quest",
  "fixedEndDate": "",
  "level": "",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "1 Week",
  "progression": "None",
  "hidden": false,
  "createdAt": "2024-04-16T15:47:11.247Z",
  "updatedAt": "2025-07-01T18:09:49.699Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": null,
  "metadata": {
    "internalNotes": ""
  },
  "primary": [
    {
      "day": 0,
      "type": "Event",
      "rank": 222,
      "prospects": [
        {
          "type": "Event",
          "name": "Knighthood Quest ",
          "style": null,
          "compatibility": 100,
          "description": "Today is the big day! A few reminders and tips before you begin your quest:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 0,
              "nm": 0,
              "map": 0,
              "ftp": 0
            },
            "tss": null,
            "intensityFactor": null
          },
          "workoutId": "",
          "contentId": "zo5GHq3hvi",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 223,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Do As You\u0027re Told",
          "style": null,
          "compatibility": 100,
          "description": "The little voice in your head is telling you to stop. The screams from your legs are nearly deafening. But you hear none of it. You\u0027re following orders to ATTACK.\n\n​\n\nThis is the story of two men in a car—your team directors—who guide you to GLORY. Ignore them at your own risk: They will not tolerate insubordination.\n\n​\n\nIn this session, you\u0027ll tackle two sets of 11 intervals each. The first set has high-intensity efforts with matching recoveries. This pushes your body\u0027s ability to recover right to the limit -- just what you need to improve Anaerobic Capacity (AC). The shorter, super-high intensity efforts also help with your Neuromuscular Power (NM). The second set features inverse intervals with opposite efforts and recoveries. This really depletes your body\u0027s AC, so you need to rely on your aerobic system. This helps develop your Maximal Aerobic Power.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7077777777777777,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 5,
              "nm": 2,
              "map": 4,
              "ftp": 1
            },
            "tss": 57,
            "intensityFactor": 0.9
          },
          "workoutId": "q7Keljwoqq",
          "contentId": "89HeFQSbGE",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 224,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Best Thing In The World",
          "style": null,
          "compatibility": 100,
          "description": "Just like a real race, the two race-paced efforts in TBTITW offer few moments of truly “settling” into a steady effort. The constant surging below, at, and well above threshold push your ability to recover to the max, making this a fantastic session for building your Anaerobic Capacity (AC). Since you are often forced to “recover” at high intensities, your cardiovascular system hardly gets a real break, which means your Maximal Aerobic Power (MAP) gets pushed hard too. With each effort ending in an all-out sprint, you really get to test out how much you have left in the tank. You might surprise yourself.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7522222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 2,
              "map": 4,
              "ftp": 4
            },
            "tss": 59,
            "intensityFactor": 0.89
          },
          "workoutId": "0M0KnAMPu3",
          "contentId": "ereX1jTlGO",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 225,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Rue The Day",
          "style": null,
          "compatibility": 100,
          "description": "Those who have completed SUF icons like Blender, Mini Blender or the Chores will be familiar with the 40-seconds-hard/20-seconds-easy variety of Pain Shakes that Rue the Day delivers in three enticing courses. While the first few efforts in each set will feel \u0022easy,\u0022 since these blocks are stretched out to 8-minutes in length, you\u0027ll be deep into the red by the end of each set.\n\n​\n\nWhile the efforts aren\u0027t continuous, they are long enough that you accumulate plenty of time near your VO2max, which is the goal of any MAP workout. Each 8-minute set gives you more than five minutes at 90% or higher of your 5-minute peak power. By the end, you\u0027re looking at 16 minutes of accumulated MAP efforts, so get ready to say \u0027Hello, Pain!\u0027\n\nAlong the way, we\u0027ll give you some interesting mental tips on how to prepare for, and better manage, the discomfort (to put it mildly) that comes with such intense efforts. In the end, you\u0027ll be both a faster and a mentally stronger cyclist.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[Demystifying VO2 and VO2MAX](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/it-takes-vo2-to-tango-demystifying-vo2-and-vo2max)\u0027 and \u0027[The Power of Positive Mental Strategies](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/episode-29-how-to-use-positive-self-talk-to-get-through-tough-moments-on-a-ride-mental-strategies)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7580555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 57,
            "intensityFactor": 0.87
          },
          "workoutId": "1uKA4J5DIs",
          "contentId": "VBEbqmsmYl",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 226,
      "prospects": [
        {
          "type": "Cycling",
          "name": "# Power Station (November Groundwork Challenge)",
          "style": null,
          "compatibility": 100,
          "description": "This workout is part of the Wahoo X Monthly Challenge. Click [\u002B\u002Bhere\u002B\u002B](https://wahoox.forum.wahoofitness.com/t/wahoo-november-challenge-groundwork/30430) to find out more.\n\n​\n\nOn the surface, this seems like a rather tame session: a series of intervals that are all under five minutes and which are almost all under threshold. But there is more here than the power file shows. The lack of obvious intensity in these short intervals is made up for by the very low cadence targets each effort requires. This creates minimal cardiovascular stress but places a tremendous load on your muscular system. The goal is to keep your upper body absolutely rock solid during these efforts. If you find that you bob back and forth for each pedal stroke, then your core is not up to the task your legs are giving it (better get onto our yoga videos and strengthen that core).\n\n​\n\nThis session can be a great test to see how your lower back will hold up over a longer ride outside. A core that will fail you after 3 hours of road riding can often be identified fairly quickly during this session. If your back is burning just as badly as your legs, it\u0027s a signal to do some additional core strengthening. With so much stress on your muscles, this is a great session for improving your overall endurance and your ability to produce lots of high torque, giving your Neuromuscular Power a nice boost along the way.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[When to Train with Low Cadence](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/when-to-train-with-low-cadence)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8108333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 3,
              "map": 1,
              "ftp": 5
            },
            "tss": 59,
            "intensityFactor": 0.85
          },
          "workoutId": "n82Uw5UOEN",
          "contentId": "1tViNkXwKQ",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 227,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Wretched",
          "style": null,
          "compatibility": 100,
          "description": "A SUF classic, this session is not for the faint of heart, or the fatigued of legs. What it may lack in polish it more than makes up for with results. With large continuous blocks above threshold, and the only “recovery” coming in the form of tempo efforts (but only after massive surges), you need to bring your A-game to make it through this one. Actually, bring your A\u002B game.\n\n​\n\nWith so much time right at or above threshold you really push your ability to efficiently produce aerobic power to its limits, which is the key to a quality FTP session (when you are fresh). All that time above threshold, those large surges, and that inadequate recovery also punishes your Anaerobic Capacity (AC) and Maximal Aerobic Power (MAP) harder than other FTP-focused sessions.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7708333333333334,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 1,
              "ftp": 5
            },
            "tss": 59,
            "intensityFactor": 0.87
          },
          "workoutId": "gMoGczvcAS",
          "contentId": "MzBfwwDxEB",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 228,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Rollercoaster",
          "style": null,
          "compatibility": 100,
          "description": "Get ready for a workout designed to take you on a wild ride of intensity and focus. _RollerCoaster_ pushes you near your VO2 max, with intervals carefully broken into smaller chunks that gradually build to your peak effort before dropping slightly to keep you going. These dynamic shifts allow you to sustain high-intensity work without hitting your absolute limit the entire time. The structure ensures maximum time spent near VO2 max, boosting endurance and power while helping you mentally tackle each challenge one manageable piece at a time.\n\n​\n\nRecovery is tailored to the effort you just completed, giving your legs the reset they need to dive into the next wave of intensity. Paired with inspiring footage of the Brabantsje Pils Spring Classics, you\u0027ll feel the grit of the cobbles and the thrill of the chase as you power through climbs and recover on the descents. Remember: keep your form smooth, your breathing controlled, and your mind locked into each effort. Treat every interval as a race within the ride. The dips in intensity are there to help you, not let you off the hook—this is one ride you won’t forget!\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7883333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 4,
              "ftp": 2
            },
            "tss": 65,
            "intensityFactor": 0.89
          },
          "workoutId": "EFRztgyTqJ",
          "contentId": "3aJ8nMrgLd",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 229,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Omnium",
          "style": null,
          "compatibility": 100,
          "description": "Do you know what we love about you? Your versatility. You can Suffer anywhere, anytime, and in any way. That\u0027s why Grunter von Agony, Sufferlandrian Team Director, is sending you to compete in The Omnium at the UCI World Track Championships. Over the course of 50 minutes, you\u0027ll do battle in the six different races.\n\n​\n\nNo two intervals in this workout are the same, with each one working slightly different Neuromuscular (NM), Anaerobic Capacity (AC), and Maximal Aerobic Power (MAP) variations. No need for FTP here, friends. It\u0027s the perfect session to improve top-end power without having to do a ton of repetitive efforts.\n\n​\n\nThe Scratch Race and Flying Lap have an easy enough lead-in that you get to put your max sprint to the full test. Add in the standing starts for the Individual Pursuit and Kilo, and you give your NM a real run-through. The repeated surges of the Elimination Race, the all-out nature of the Kilo, and the massive efforts you have to make in the points race really test your powers of recovery while working your AC all the way to the max.\n\n​\n\nSince the efforts come in quick succession, and with most being over four minutes in length, your cardiovascular system never catches a real break, ensuring your MAP doesn’t get left out of the equation.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7888888888888889,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 5,
              "nm": 3,
              "map": 5,
              "ftp": 2
            },
            "tss": 68,
            "intensityFactor": 0.93
          },
          "workoutId": "ZBJBTvvtfe",
          "contentId": "e0fpoQCSWR",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 230,
      "prospects": [
        {
          "type": "Cycling",
          "name": "A Very Dark Place",
          "style": null,
          "compatibility": 100,
          "description": "You know that ride where you thought you went harder, deeper, and to a darker place than you\u0027d ever gone before? HAHAHAHA. This takes you further, deeper, and darker than that. _A Very Dark Place_ (AVDP) is about maximum effort for shorter durations: five, four-minute intervals that take you to the limit. If you struggle with longer, high-intensity efforts and want to improve your ability to make repeated attacks, you need to spend some time in _A Very Dark Place_. Those little punches in the third and fifth efforts will teach you just how dark it can get.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8155555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 63,
            "intensityFactor": 0.88
          },
          "workoutId": "LTjVzi8Lrj",
          "contentId": "vCBrff5o6l",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 231,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Revolver",
          "style": null,
          "compatibility": 100,
          "description": "The simple idea of going hard for one minute and then easy for one minute, and then repeating, has been around since whatever evil genius realized that intervals were the best way to train. There is a reason this simple session has stuck around: it works.\n\n​\n\n30 seconds into a high-intensity effort, enough of your anaerobic energy sources have been depleted that your body shifts to producing that power aerobically. Follow that effort with only 60 seconds of recovery, and your body hasn’t fully replenished those anaerobic stores, meaning it will have to produce that power aerobically after just 25 seconds.\n\n​\n\nWith a total of just 15 (cough, cough) efforts, you will have not only forced your body to replenish its Anaerobic Capacity (AC) over and over, but you\u0027ve just spent several minutes producing lots of power with lots of oxygen. That combination ensures this session hits both your Maximal Aerobic Power (MAP) and AC with just the right stress they need to start increasing.\n\n​\n\n_Revolver has recently been remastered (Aug \u002722) to include all new footage and music. The workout has a longer warm-up than previous editions._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8208333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 4,
              "nm": 1,
              "map": 5,
              "ftp": 1
            },
            "tss": 63,
            "intensityFactor": 0.93
          },
          "workoutId": "3e8ekr1Ff9",
          "contentId": "xjx8cV9fzM",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 0,
      "type": "Cycling",
      "rank": 232,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Rookie",
          "style": null,
          "compatibility": 100,
          "description": "These race simulations steadily get harder and harder as the workout progresses, so don’t be too keen to increase the intensity after the first 10-minute effort if it felt “too easy.” Just wait. The pain will come.\n\n​\n\nDuring each interval, you\u0027ll be ducking and diving right under and over threshold, forcing your body to churn through all the metabolites you\u0027re producing (that\u0027s the nasty stuff that the Painsuckers love so much). This is one of the best ways to improve your FTP without really overloading your system with too much training stress.\n\n​\n\nThe final two intervals allow you to really charge over your threshold to unleash whatever power you have left in your legs. These two all-out bursts of power, in addition to the constant surges above threshold, means this session works your Anaerobic Capacity more than some of the other FTP-focused sessions.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8816666666666667,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 1,
              "map": 2,
              "ftp": 5
            },
            "tss": 75,
            "intensityFactor": 0.92
          },
          "workoutId": "iPO62IOLa3",
          "contentId": "54dYn0oExU",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": []
}