{
  "id": "S1QApXlco6",
  "name": "Etape Caledonia 40 (2023)",
  "weakness": "NoWeakness",
  "grouping": "Etape Caledonia 40",
  "category": "None",
  "subcategory": "None",
  "description": "If you are in need of any technical help or want to know more about the training terms used in this plan check out the [Wahoo SYSTM Help Center.](https://wahoosystm.com/HelpCenter)\n\n​\n\nHave a more specific question that isn\u0027t addressed in the Help Center? Head over to our [forum](https://wahoox.forum.wahoofitness.com/) to see if your question has been answered, or just post it for yourself.\n\n​\n\n",
  "planDescription": "",
  "fixedEndDate": "2023-05-14",
  "level": "",
  "type": "Cycling",
  "uniqueToPlan": "None",
  "volume": "None",
  "option": "None",
  "duration": "None",
  "progression": "None",
  "hidden": false,
  "createdAt": "2023-03-24T02:19:52.604Z",
  "updatedAt": "2025-07-01T16:06:40.956Z",
  "version": "1.0.1",
  "isAddOn": false,
  "deleted": null,
  "metadata": {
    "internalNotes": "Gravel"
  },
  "primary": [
    {
      "day": 42,
      "type": "Cycling",
      "rank": 205,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
          "style": null,
          "compatibility": 100,
          "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6011111111111112,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 1,
              "ftp": 2
            },
            "tss": 20,
            "intensityFactor": 0.62
          },
          "workoutId": "rUrrfvb8ii",
          "contentId": "p6E2zIaYNZ",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 43,
      "type": "Cycling",
      "rank": 204,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Half Monty (Ramp Test)",
          "style": null,
          "compatibility": 100,
          "description": "**Half Monty: The Easy One.**\n\n​\n\nWe recommend this fitness test for:\n\n- Newer riders\n- Athletes with limited experience pacing maximal efforts / fitness testing.\n- Those who are mid-plan or who just want to get a sense of where their fitness is.\n\nThe _Half Monty_ 4DP fitness test is the most accurate and complete ramp test available. While it\u0027s not as comprehensive or as accurate as our main fitness test, _Full Frontal_, it\u0027s far more approachable and easier to pace for new riders. It also doesn\u0027t require any special preparation. You just need to feel relatively fresh.\n\n​\n\nBased on more than a year of research (and after dozens of lab tests and thousands of online tests) and using sophisticated analysis of power and heart rate data, _Half Monty_ is far more accurate and comprehensive than standard ramp tests.\n\n​\n\nIt also tells you more about who you are as an athlete. _Half Monty_ provides you with your FTP, Maximal Aerobic Power (MAP), and Cycling Threshold Heart Rate (cTHR), all of which we use to personalize your workout targets.\n\n​\n\nIf you\u0027re still using the 4DP estimates when you set up your account, _Half Monty_ will also refine your AC and NM estimates (but will not do so if you\u0027ve done _Full Frontal_ or manually adjusted your estimates). If you want fully accurate AC and NM, as well as your Rider Type, Strengths, Weaknesses, and training plans adjusted to those Strengths and Weaknesses, you\u0027ll need to expose yourself to the _Full Frontal_ 4DP fitness test.\n\n​\n\nReady to climb the ramp? You\u0027ll need the following before you start:\n\n- A heart rate monitor if you want the most accurate results. Don\u0027t have one? Order one [HERE](https://wahoofitness.com/devices)\n- Some kind of power device connected (trainer, power meter, virtual power, etc.)\n- Be ready to pay close attention to the instructions in the workout\n- Be sure your profile is complete and up-to-date (Profile \u003E About You). Accurate information helps us make our calculations\n\n**LEARN MORE**\n\nListen to \u0027[Why Fitness Testing Matters](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/testing-testing-1-2-3-why-fitness-testing-matters)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n\n​\n\n[Here\u0027s some more information on how to get the most from your fitness test.](https://wahoosystm.com/HelpCenterFitnessAssessment)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9666666666666667,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 3
            },
            "tss": 71,
            "intensityFactor": 0.85
          },
          "workoutId": "0SmbqUIZZo",
          "contentId": "OIJSfIrGTL",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 44,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Cash Register",
          "style": null,
          "compatibility": 100,
          "description": "Over/under intervals, where you alternate going just below and just above threshold, are the foundation of many classic workouts. Cash Register is an adaptation of that idea and comes in the format of a sprint/settle/surge session consisting of 4 intervals that get a little shorter (but not easier) each round.\n\n​\n\nEach interval kicks off with a sprint effort that targets your Neuromuscular (NM) power. Then you settle into a controlled, below-FTP effort that will accelerate the rate at which you can clear lactate from your muscles. You\u0027ll finish each effort off with a big surge based on your Anaerobic Capacity (AC). In just 30 minutes, you\u0027ll be doing efforts targeting your sprint power, FTP, and AC for an exceptionally well-rounded workout.\n\n​\n\nSupport the Wahooligan Tour by [donating to the Davis Phinney Foundation](https://secure2.convio.net/dpf/site/TR?pg=pfind\u0026fr_id=1391) and their programs to help people living with Parkinsons.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5380555555555555,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 4,
              "map": 1,
              "ftp": 3
            },
            "tss": 37,
            "intensityFactor": 0.86
          },
          "workoutId": "HSb6Gc8uIZ",
          "contentId": "6LnpmGMTMG",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 47,
      "type": "OutdoorCycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Sub-Threshold With Starting Surge: 2 x 20",
          "style": null,
          "compatibility": 100,
          "description": "The idea behind this session can be seen in Who Dares, Fight Club, and Standing Starts into sustained efforts. Your bodies ability to clear out metabolites and process oxygen is nearly identical between 90% of FTP and 100% of FTP, the difference is that at 100% of FTP your body is producing those metabolites at the same rate it is clearing them.  At 90% of FTP your body can clear things at the same rate, but your body isn\u0027t producing them at the same rate.  \n\nLong Sub-Threshold efforts represent an effort that your body can just about handle (assuming you are properly fueled and not completely exhausted), clearing things out faster than they can accumulate.  To really stress that clearance rate each of these Sub-Threshold efforts start with a 20-second effort well above FTP.  By the time you settle into the Sub-Threshold effort, your body will be flooded with those metabolites that cause your legs and lungs to burn.  However, since you are below FTP (clearing things out faster than you are producing them), the concentration of those metabolites will slowly drop over the course of the whole effort.  Not only does this train your body to clear things faster, but it will also mentally prepare for the discomfort associated with efforts above FTP.\n\n​\n\nFor this session, we are asking you to dance on that razor\u0027s edge of your FTP, ideally the side that allows you to complete the session.  If your legs or lungs aren\u0027t feeling great, you are better off dropping the steady effort by 5% and keeping the starting effort at 100%.\n\nAnother component of this is settling into a good rhythm of breathing and pedaling.  Everyone has a preferred cadence, and this is an instance where your preferred cadence supersedes the cadence targets onscreen.  We want you dancing right on that edge of your comfort, and you can get much closer to that edge riding your preferred cadence.\n\n​\n\n**Warm Up **\n\n20 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 5.5 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n30 seconds @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n6 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort **\n\nNumber of sets: 2\n\nRest between sets: \n\n10 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval repeats per set: NA \n\n**Interval**\n\n20 seconds @ RPE 9.5 -- 180% of FTP -- HR \u003E105%\n\n20 minutes @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume **\n\n25 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down **\n\n4 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 2,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 1,
              "ftp": 5
            },
            "tss": 113,
            "intensityFactor": 0.75
          },
          "workoutId": "S3zmnxb7va",
          "contentId": "gR0sSwX5Gp",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 48,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Endurance  2",
          "style": null,
          "compatibility": 100,
          "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\n​\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\nWarm-Up\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\nMain Effort\n\nNumber of Sets\n\n5\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set\n\n1\n\nInterval: 10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\nExtra Volume\n\nN/A\n\n​\n\nCool Down\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 2,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 72,
            "intensityFactor": 0.6
          },
          "workoutId": "dH1eNOMmdA",
          "contentId": "BNVhbAdPic",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 50,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Costa Blanca: Puerto de Tudons",
          "style": null,
          "compatibility": 100,
          "description": "This session is a variation on over-unders, designed to elevate your MAP (maximal aerobic power) while keeping your cardiovascular system under constant strain. You\u0027ll alternate between hard MAP intervals and “recoveries” that are still above endurance level — forcing your heart rate and respiration to stay elevated throughout.\n\n​\n\nSet on the consistent, climb-friendly terrain of Port de Tudons, this workout encourages rhythm and control, with a focus on maintaining high cadence to emphasize cardio over muscular strain. The structure builds your ability to sustain high power outputs under stress, improving your breakaway potential and fatigue resistance without requiring extended time at VO₂ Max power.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/14035782507)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.0183333333333333,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 5
            },
            "tss": 75,
            "intensityFactor": 0.88
          },
          "workoutId": "2pd4pKh1zE",
          "contentId": "sx2F4VUMLJ",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 51,
      "type": "Cycling",
      "rank": 202,
      "prospects": [
        {
          "type": "Cycling",
          "name": "# Getting Away With It (November Groundwork Challenge)",
          "style": null,
          "compatibility": 100,
          "description": "This workout is part of the Wahoo X Monthly Challenge. Click [\u002B\u002Bhere\u002B\u002B](https://wahoox.forum.wahoofitness.com/t/wahoo-november-challenge-groundwork/30430) to find out more.\n\n​\n\nWouldn\u0027t it be great if you could leave work to go for a ride? Even for an hour? Well, now\u0027s your chance. _Getting Away With It_ gets you out of the office and onto the roads of the French Pyrenees with your guide Michael Cotty of The Col Collective.\n\n​\n\nThis is a great session to add toward the end of a training block. The shorter duration, sub-threshold efforts are fantastic for getting some extra FTP building while you are in a fatigued state. Extra emphasis on cadence stresses your nervous system, making your body more efficient at higher and lower RPMs while improving your form. The Neuromuscular training you get from this session is fantastic, so while your power never exceeds threshold, your body will learn to bring more energy to the pedals at all intensities.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.74,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 1,
              "ftp": 4
            },
            "tss": 45,
            "intensityFactor": 0.78
          },
          "workoutId": "ZF95hVWWkr",
          "contentId": "P2T4sgv1yX",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 52,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "A Very Dark Place",
          "style": null,
          "compatibility": 100,
          "description": "You know that ride where you thought you went harder, deeper, and to a darker place than you\u0027d ever gone before? HAHAHAHA. This takes you further, deeper, and darker than that. _A Very Dark Place_ (AVDP) is about maximum effort for shorter durations: five, four-minute intervals that take you to the limit. If you struggle with longer, high-intensity efforts and want to improve your ability to make repeated attacks, you need to spend some time in _A Very Dark Place_. Those little punches in the third and fifth efforts will teach you just how dark it can get.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.8155555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 5,
              "ftp": 2
            },
            "tss": 63,
            "intensityFactor": 0.88
          },
          "workoutId": "LTjVzi8Lrj",
          "contentId": "vCBrff5o6l",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 54,
      "type": "Cycling",
      "rank": 201,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Endurance 1.5",
          "style": null,
          "compatibility": 100,
          "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high and your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride, especially one under 90 minutes should not leave you fatigued or your legs wasted.\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in low to mid Zone 2 heart rate, which is 70-80% of LTHR up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can; for most this is 80-90rpm. Also, your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster, but you will have to trust us on this one! When you see this session in your Training Plan, follow these instructions, or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats Per Set: 4\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n**Extra Volume**\n\nNA\n\n**Cool Down**\n\n5 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.5,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 52,
            "intensityFactor": 0.59
          },
          "workoutId": "tzTwzPCAqr",
          "contentId": "18VxkKVYn4",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 55,
      "type": "OutdoorCycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Sub-Threshold With Surges: 3 x 9",
          "style": null,
          "compatibility": 100,
          "description": "While some of you will know this intensity level as \u0022Sweet-Spot\u0022, we prefer the name Sub-Threshold, because we want to drive home the fact that you should keep your power below FTP. In the same way that longer Tempo efforts can feel \u0022easy,\u0022 these shorter Sub-Threshold efforts can also feel \u0022easy\u0022. After all, if you can hold 100% of FTP for about an hour, then holding less than that for 5-minutes should be a piece of cake right? We know you can go harder for 5-minutes, but that is not what we are asking for.\nThis session is not intended to push you to your limits, nor is it designed to be a massive training load. The real purpose is to essentially keep your fatigue levels right where they are, by giving your body just enough intensity to ensure that you are not \u0022more recovered\u0022 after today.\nWhile some folks will say that there is no training benefit to such short Sub-Threshold efforts, when viewed in a bigger picture sense (like a 3-week training block) they can be the perfect efforts to ensure you get the most out of a longer training block.\nWe would even ask that you view this session as more of an assessment, rather than strictly a workout. That\u0027s because you should be comparing this power output to heart rate response and your own internal RPE. When you have heavy fatigue, your heart rate will struggle to hit its normal peaks. When fresh you would be getting into Z4 heart rate by the end of the last two intervals, and your RPE should never really climb above a 7. When holding onto excess fatigue, your heart rate won\u0027t climb above Z3, and your RPE will be above an 8. At the same time, if you have gained a significant amount of fitness, your Heart Rate will stay in Z3, and your RPE won\u0027t climb above 6. The secondary tell between improved fitness and fatigue is how quickly your heart rate drops after each effort. When fatigued, your heart rate won\u0027t drop below Z2 during the recovery.\nWhile it is easy to rely solely on Power, you should always refer back to RPE and Heart Rate, and today is the perfect session to practice comparing the 3.\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C95%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest Between Sets: 10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\nInterval Repeats per Set: 3\n\n**Interval**\n\nSurge: 30 sec @ RPE 8.5 -- 90% of MAP (105-130% of FTP)\n\nSteady: 2 minutes 30 seconds @ RPE 7 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n30 minutes @ RPE 3 -- 60% of FTP -- HR \u003C85%\n\n​\n\n**Cool Down**\n\n8 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 2,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 98,
            "intensityFactor": 0.7
          },
          "workoutId": "kt5fPn4lAN",
          "contentId": "lgDIJtwAYG",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 57,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Serbia Upside Down Ep. 2",
          "style": null,
          "compatibility": 100,
          "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.4072222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 2
            },
            "tss": 15,
            "intensityFactor": 0.6
          },
          "workoutId": "MGb1NCbPVj",
          "contentId": "saI89XPgSw",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 59,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Ruta Chingaza",
          "style": null,
          "compatibility": 100,
          "description": "🎬 Film (2020): In February, legendary ultra-endurance cyclist Lael Wilcox, Joe Cruz, and filmmaker Rugile Kaladyte traveled to the Colombian capital, in partnership with Conservation International, Wahoo, and Bikepacking.com to launch the Bikepacking for Conservation Program. The project was designed to explore and scout a bikepacking route that would connect the bustling metropolis of Bogota, Colombia with rural communities and the Chingaza National Park. The resulting route — Ruta Chingaza — will help cyclists connect to nature and better understand the ecosystems upon which life and livelihoods in this area depend.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. Intensity is low, with power remaining at or below 50% of FTP (2.5 on a scale from 1 to 10) with heart rate targets entirely in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5752777777777778,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 12,
            "intensityFactor": 0.46
          },
          "workoutId": "5jKjnMyGq3",
          "contentId": "8O9dFBGSA4",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 61,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Bavaria: Oberjoch",
          "style": null,
          "compatibility": 100,
          "description": "Saddle up and prepare to conquer Oberjoch, the signature climb of the region, taking us through Bavaria’s lush pastures towards Austria’s scenic Lake Haldensee.\n\n​\n\nThis workout features a series of low and high cadence drills with a progressive intensity build. We’ll kick off the climb with a 4-minute low cadence interval at 80-85% FTP, followed by a 2-minute recovery. From there, each interval shortens by one minute, while the cadence and effort increase slightly, alternating between low and high cadence to maintain focus and form.\n\nOnce we reach the summit, it’s time to recover briefly before diving into the second part of the session: five 60-second tempo-to-threshold builds on the flat toward Haldensee. This workout is designed to improve aerobic efficiency, strength, and your ability to recover between hard efforts. Sounds simple? Let’s chat at the end—good luck!\n\n​\n\nThe intervals will alternate between low and high cadence requiring you to ride at an exceptionally low cadence to stress your muscular system more than your cardiovascular system and then riding at 100\u002B RPM has the exact opposite effect with less strain on your muscles, but a greater strain on your cardiovascular system. Alternating back and forth between low and high cadence will ensure both your muscular system and cardiovascular system get pushed hard.\n\nThe tempo builds will work you hard but flush out your legs making your recovery quicker so you can go hard tomorrow.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/9853644571)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9197222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 3,
              "map": 2,
              "ftp": 4
            },
            "tss": 69,
            "intensityFactor": 0.84
          },
          "workoutId": "xBnMN5lQMf",
          "contentId": "CQRHzkcyOP",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 62,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Endurance  1",
          "style": null,
          "compatibility": 100,
          "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high and your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride, especially one under 90 minutes should not leave you fatigued or your legs wasted.\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in low to mid Zone 2 heart rate, which is 70-80% of LTHR up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can; for most this is 80-90rpm. Also, your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster, but you will have to trust us on this one! When you see this session in your Training Plan, follow these instructions, or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats Per Set: 2\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 35,
            "intensityFactor": 0.59
          },
          "workoutId": "MoHJtkSmht",
          "contentId": "SmypIMDui1",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 63,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Tour de Suisse Women 2",
          "style": null,
          "compatibility": 100,
          "description": "**Featured rider: **Clara KOPPENBURG of Germany\n\n**Event: **Tour de Suisse Women\n\n​\n\nAfter the racing in Vaduz as part of the Tour de Suisse Women, the peloton leaves Liechtenstein and heads towards Chur, the oldest town in Switzerland. With the riders having ridden 96 kilometers over some tough climbs already, you\u0027ll join the action on-board with Cofidis Professional Clara Koppenburg with less than 28 kilometers to go. The final climb of the day up to St Luzisteig is coming up. Be ready for plenty of attacks before you get there and a high pace once on the slopes. You have all to play for in this stage. Can you pull it off?\n\n​\n\n**About ProRides**\n\n_Here’s your chance to experience what it’s like to ride in the biggest races in the world, thanks to SYSTM’s 4DP platform. We’ve taken the first-person camera footage and power data from a pro cyclist and analyzed it to determine which part of their 4DP® profile each of their efforts corresponds to. But since few of us can put down pro-level watts, we made it so all of the efforts are scaled to your own personal 4DP® profile. That means you get to experience exactly what the pros experience relative to your own abilities. When they sprint, you sprint. When they attack, you attack. When they sit up, you get to take it (relatively) easy. It\u0027s the most immersive, realistic race simulation out there._\n\n​\n\n[Here\u0027s some more information on how to create the most immersive ProRides experience.](https://wahoosystm.com/HelpCenterProRides)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9077777777777778,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 1,
              "map": 2,
              "ftp": 4
            },
            "tss": 134,
            "intensityFactor": 0.76
          },
          "workoutId": "sbfGA201Wo",
          "contentId": "tBEu9LdjEy",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 65,
      "type": "Cycling",
      "rank": 201,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Tour of Norway 2",
          "style": null,
          "compatibility": 100,
          "description": "**Featured rider:** Carl Fredrick HAGEN of Norway\n\n**Event: **Tour of Norway\n\n**Mission - \u0022Wonderkid\u0022:** Experience the thrill of the breakaway with the peloton breathing down your neck - You\u0027re riding for Team Lotto Soudal - You\u0027ve been in the breakaway all day. There\u0027s just one hour of racing left and you\u0027re sitting at the top of the virtual GC on the last day of the Tour of Norway, your home tour — Of any day to go all out and empty the tank, today is the day — Take your pulls, lead the breakaway and fight to stay away from the peloton.\n\n​\n\n**About ProRides**\n\nHere’s your chance to experience what it’s like to ride in the biggest races in the world, thanks to SYSTM’s 4DP platform. We’ve taken the first-person camera footage and power data from a pro cyclist and analyzed it to determine which part of their 4DP® profile each of their efforts corresponds to. But since few of us can put down pro-level watts, we made it so all of the efforts are scaled to your own personal 4DP® profile. That means you get to experience exactly what the pros experience relative to your own abilities. When they sprint, you sprint. When they attack, you attack. When they sit up, you get to take it (relatively) easy. It\u0027s the most immersive, realistic race simulation out there.\n\n​\n\n[Here\u0027s some more information on how to create the most immersive ProRides experience.](https://wahoosystm.com/HelpCenterProRides)\n\n​\n\n**Featured Footage: **Velon\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.0125,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 2,
              "map": 4,
              "ftp": 5
            },
            "tss": 75,
            "intensityFactor": 0.86
          },
          "workoutId": "68C7P2aLJk",
          "contentId": "ucHaD8XSLK",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 67,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "P. Gaimon 3: Short KOM Training Session",
          "style": null,
          "compatibility": 100,
          "description": "As part of his ‘Worst Retirement Ever,’ Phil made a name for himself by sniping Strava KOMs around the world. But if you’re going to travel around globe stealing crowns from some of the world’s fastest climbers, you need to bring your A-game.\n\n​\n\nIn this short, 35-minute workout, Phil takes you through a warm-up on the famous Pacific Coast Highway before climbing into two short, maximal efforts on the way up Dekker Canyon. You’ll be in the hurt box, but be sure to pay attention as Phil drops his top tips for KOM / QOM segment success.\n\n​\n\nIn between efforts, Phil keeps you entertained with stories about his Cookie Fondo, life in LA, a tour of his garage, a face lick from his dog and his personal recommendation for the best cold-pressed juice in town.\n\n​\n\n_Do this on: Day 3 of the 5-day plan._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5986111111111111,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 3,
              "nm": 1,
              "map": 5,
              "ftp": 3
            },
            "tss": 37,
            "intensityFactor": 0.78
          },
          "workoutId": "rTp6HTUgAS",
          "contentId": "H4PzHKpiwc",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 68,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Galicia: Muros to Ezaro",
          "style": null,
          "compatibility": 100,
          "description": "Waterfalls? Check. Fishing villages? Check. Clear sky and blue sea? Yep. Unbelievable coastline that makes you actually consider moving your entire life to this incredible region? Well then, we must be in Galicia for another On Location workout. This time, we’re sticking close to the coast and avoiding the hills\\* so we can get in a fantastic sprint session while taking in some of the main tourist attractions (\\* Except for that nasty one at the end. But let’s just ignore that for now.)\n\n​\n\nIf you\u0027re looking to improve your sprint and improve your neuromuscular coordination, while finishing off with a solid threshold climb, then look no further than this workout.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/7397420116)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.3022222222222222,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 3,
              "map": 1,
              "ftp": 4
            },
            "tss": 79,
            "intensityFactor": 0.8
          },
          "workoutId": "v599aF8ERY",
          "contentId": "VL1eE3CZG1",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 69,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Endurance  3",
          "style": null,
          "compatibility": 100,
          "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\n​\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\nWarm-Up\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\nMain Effort\n\nNumber of Sets\n\n8.5\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set\n\n1\n\nInterval: 10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\nExtra Volume\n\nN/A\n\n​\n\nCool Down\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 3,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 107,
            "intensityFactor": 0.6
          },
          "workoutId": "8JKSfu17fM",
          "contentId": "0jGdGoG1Rq",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 71,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "The Frozen Road",
          "style": null,
          "compatibility": 100,
          "description": "🎬 Film (2017): From the creator: \u0022Self-shot and edited whilst cycling around the world, this film charts a winter journey into the Canadian Arctic as I completed my bike ride up the American continent. Compelled by Jack London’s assertion, that ‘any man who is a man can travel alone,\u0027 I sought an adventure of perfect solitude. Yet, as I came to realize, the harsh truths of traveling in such a formidable environment were a long way from the romantic images I’d held of this land. _The Frozen Road_’ is an honest reflection on my solo trip; of the wonder, terror and frustration I experienced when riding through the unforgiving emptiness of one of the world’s ‘last great wildernesses.\u0022\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.41805555555555557,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 8,
            "intensityFactor": 0.44
          },
          "workoutId": "bHz6eBsicH",
          "contentId": "fwzyQcEcGW",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 72,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Gran Canaria: Serenity",
          "style": null,
          "compatibility": 100,
          "description": "Starting at the islands iconic rainbow rocks at Los Azulejos de Veneguera in this session we tackle one of the most stunning climbs on the whole island, known locally as “Serenity”. We’ll be breaking this 10km climb down into three distinct sections, kicking off with a block of 6 x 50 second high tempo efforts with a 10 second burst out of the saddle before taking a swift breather before getting back on it. As we climb through the pine forest we’ll switch things up a touch, alternating between low and high cadence for 30 seconds at a time for around 7 minutes. We’ll then revert back to our 50 second high tempo with 10 second burst out of the saddle efforts before we build up our effort to the summit. This is going to be a challenging workout so make sure you’re ready and whatever you do don’t forget to take a moment to look at the views!!\n\n​\n\nThis workout combines multiple different interval types that focus on improving threshold power via over-under style efforts along with low cadence work for your muscular endurance. The first and last climbs also fire up your whole energy systems with some sprints to the summit.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/8735613403)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.9230555555555555,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 2,
              "map": 3,
              "ftp": 5
            },
            "tss": 62,
            "intensityFactor": 0.86
          },
          "workoutId": "keD5MA4ABE",
          "contentId": "sXC2D7jqYs",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 73,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Recovery Spin",
          "style": null,
          "compatibility": 100,
          "description": "Don’t be afraid of the Two Rs: rest and recovery. Believe it or not, you get faster when your body is taking it easy after all that suffering. A recovery spin is a very low intensity ride, so easy that you’d feel embarrassed to ride so slowly if you didn’t know you were helping your body get so much faster.\n\n​\n\nA good recovery spin is done at a cadence above 90 RPM. While keeping power below 50% of FTP, or an RPE less than 2.5, and keeping your heart rate in Zone 1 the entire time. Recovery spins can be done outdoors, but due to the low power demands, they are often easier done on the trainer. Resist the voice of your inner Sufferlandrian telling you to go faster.\n\n​\n\n**Main Set**\n\n30 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 1
            },
            "tss": 10,
            "intensityFactor": 0.45
          },
          "workoutId": "jeZrkThiTw",
          "contentId": "b16D760xKz",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 75,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Tempo Alternating: 1 x 20",
          "style": null,
          "compatibility": 100,
          "description": "This short, 36-minute workout will get you in and out of Sufferlandria in no time, with a solid 20 minute tempo block to boot. This continuous tempo effort will have you alternate between 75 \u0026 85% of FTP every minute. Not only does this help pass the time rather quickly, it will help improve your aerobic fitness. Time spent in this intensity range will help increase your stroke volume (amount of blood your heart can pump every minute), your lactate threshold, and the mitochondrial density of your muscles (mitochondria are the \u0022power houses\u0022 of the cells that create energy). All of these things are very important parts of aerobic metabolism and performing your best- especially if you like group rides. This is the typical intensity range that most group rides fall into- not a leisurely pace, but not so fast that people are falling off the back within minutes. So if you find that you commonly struggle with group rides, gradually spending more time on workouts at this intensity will have you holding on longer and taking your pulls without missing a beat!\n\n​\n\n**Warm Up**\n\n6 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n4 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 10\n\nRest between sets: NA\n\nInterval repeats per: NA\n\n**Interval**\n\nWork: 1 minute @ RPE 6 -- 85% of FTP -- HR \u003C100\n\nSteady: 1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 32,
            "intensityFactor": 0.73
          },
          "workoutId": "kTQ9v8O2Ws",
          "contentId": "xURzYXES4v",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 76,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Endurance 1.5",
          "style": null,
          "compatibility": 100,
          "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high and your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride, especially one under 90 minutes should not leave you fatigued or your legs wasted.\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in low to mid Zone 2 heart rate, which is 70-80% of LTHR up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can; for most this is 80-90rpm. Also, your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster, but you will have to trust us on this one! When you see this session in your Training Plan, follow these instructions, or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats Per Set: 4\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n**Extra Volume**\n\nNA\n\n**Cool Down**\n\n5 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 1.5,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 1,
              "ftp": 3
            },
            "tss": 52,
            "intensityFactor": 0.59
          },
          "workoutId": "tzTwzPCAqr",
          "contentId": "18VxkKVYn4",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 78,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Cadence Builds",
          "style": null,
          "compatibility": 100,
          "description": "One of the best sessions for neuromuscular training, this drill asks you to progressively build from a cadence of 90 RPM to your MAX over 30 seconds, recover, and repeat several times. Cadence builds improve how you recruit your leg, gluteal, and core muscles throughout your pedal stroke by progressing to your maximal cadence. By reaching your highest cadence possible, you are training the \u0027on/off\u0027 switch in each muscle group to not only work faster but to have less overlap with your other muscle groups. This session trains your hamstring muscles to \u0027turn off\u0027 when your quads \u0027turn on\u0027 and vice-versa, resulting in a more efficient pedal stroke at both high and low cadences.\n\n​\n\n**LEARN MORE**\n\nListen to The Knowledge podcast, by Wahoo Sports Science - The Benefits of High Cadence Training: [https://wahoosystm.com/BenefitsofHighCadence](https://wahoosystm.com/BenefitsofHighCadence)\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.5480555555555555,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 5,
              "map": 1,
              "ftp": 1
            },
            "tss": 21,
            "intensityFactor": 0.62
          },
          "workoutId": "04BfbUGDMk",
          "contentId": "n3WrizBr1g",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 79,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
          "style": null,
          "compatibility": 100,
          "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.6011111111111112,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 2,
              "map": 1,
              "ftp": 2
            },
            "tss": 20,
            "intensityFactor": 0.62
          },
          "workoutId": "rUrrfvb8ii",
          "contentId": "p6E2zIaYNZ",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 80,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Tapers",
          "style": null,
          "compatibility": 100,
          "description": "When it comes to \u0022peaking\u0022, or performing at your absolute best on a given day, the key is nailing your Taper. The term \u0022Taper\u0022 refers to how you train in the week or so before your target event to ensure you deliver your best performance. Generally, tapering means reducing your total training volume but continuing to hit some high-intensity efforts. While there are individual variations in the best way to taper, this session has been used by countless professionals leading into the biggest races of their lives -- athletes like World Champions Rohan Dennis and Flora Duffy.\n\n​\n\nWith 3 sets of micro-intervals (40/20s, 30/30s, and 20/40s) you will hit your system with just enough intensity to keep your legs sharp and responsive, without adding any real fatigue. Outside of those 3 sets of micro-intervals, this session is purposefully short and easy. This is a preparation session, not a training session! After all, your event is just around the corner and all of the important training is behind you. Riding harder or longer today will do absolutely nothing to increase your fitness by event day; in fact, all that would do is increase your fatigue, which will only hurt your performance. Rather, this session makes sure your body is humming along and ready to perform on the big day.\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.7805555555555556,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 2,
              "nm": 1,
              "map": 2,
              "ftp": 2
            },
            "tss": 52,
            "intensityFactor": 0.82
          },
          "workoutId": "HHWEa0SVBb",
          "contentId": "QYxdHH9lsF",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 82,
      "type": "Cycling",
      "rank": 200,
      "prospects": [
        {
          "type": "Cycling",
          "name": "Openers",
          "style": null,
          "compatibility": 100,
          "description": "Whether you have power testing, a group ride you want to smash, that event you have been training all winter for, or even just a fun route you want to have a great ride on, this is the perfect session to do the day before. The key to this session is just enough time right around threshold, with sufficient recovery between efforts and a handful of sprints to prime all of your systems for tomorrow\u0027s event.\n\n​\n\n**Warm-Up**\n\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C65%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n30 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-190% of FTP)\n\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 3, all unique\n\nRest Between Sets: 8 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n**Set 1**\n\nInterval Repeats per set: 1\n\nInterval: Effort: 3 minutes at @ RPE 7 -- 90% of FTP --HR \u003C95%\n\n**Set 2**\n\nInterval Repeats per set: 1\n\nInterval: Effort: 2 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\n**Set 3**\n\nInterval Repeats per set: 3\n\nInterval: Effort: 30 seconds @ RPE 9 -- 95% of MAP (110-130% of FTP)\n\nRecovery: 90 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n6 minutes @ RPE 1.5 -- \u003C45% of FTP\n",
          "intensity": {
            "master": 1,
            "nm": null,
            "ac": null,
            "map": null,
            "ftp": null
          },
          "trainerSetting": {
            "mode": "ERG",
            "level": null
          },
          "plannedDuration": 0.75,
          "durationType": "Time",
          "metrics": {
            "ratings": {
              "ac": 1,
              "nm": 1,
              "map": 2,
              "ftp": 3
            },
            "tss": 32,
            "intensityFactor": 0.65
          },
          "workoutId": "nQPP9Fwg2G",
          "contentId": "qsoBpYxlEc",
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    },
    {
      "day": 83,
      "type": "Event",
      "rank": 200,
      "prospects": [
        {
          "type": "Event",
          "name": "Etape Caledonia 40",
          "style": null,
          "compatibility": null,
          "description": "Time to Crush it!",
          "intensity": null,
          "trainerSetting": null,
          "plannedDuration": null,
          "durationType": null,
          "metrics": null,
          "workoutId": null,
          "contentId": null,
          "notes": null,
          "fourDPWorkoutGraph": null
        }
      ]
    }
  ],
  "addOns": [
    {
      "id": "7yvR2Rb4ey",
      "level": "Intro",
      "type": "Yoga",
      "schedule": [
        {
          "day": 1,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Total Newbie Yoga",
              "style": null,
              "compatibility": 100,
              "description": "Yoga-curious but don\u0027t know where to start? This session is a great place to dip your toes in. This easy, basic routine will introduce you to some simple foundational moves while giving you a little stretch and some light strength work at the same time. Think of it as the gateway drug to bringing yoga into your life.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2513888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "0KXmLMOepk",
              "contentId": "jL7ANnNqRg",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 8,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Super Easy Stretch Routine II",
              "style": null,
              "compatibility": 100,
              "description": "You\u0027ve just finished a difficult training session. You probably just want to curl up in a ball, but to make sure your body stays limber and flexible this sequence will stretch you out and open you up. You\u0027ll be ready to hit it again in no time.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.23916666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 24,
                "intensityFactor": 0.99
              },
              "workoutId": "DDk1BF12pl",
              "contentId": "x3DCCIYEnV",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 11,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "End Of Day Stretch",
              "style": null,
              "compatibility": 100,
              "description": "This slow and stretchy sequence is ideal for practicing at the end of a long day at work or after travel. It focuses on opening up the chest and shoulders, stretching the neck and forearms, and releasing tension in the calves, hamstrings, hips, and lower back. These poses can also be used after a workout for a comprehensive full-body stretch.\n\n​\n\nThe objectives are to stretch the neck, shoulders, triceps, chest, and forearms; release tension in the lower back, hips, hamstrings, calves, ankles, and feet; transition the body into parasympathetic \u0022rest or digest\u0022 mode after exercise; and help alleviate lower and mid back pain.\n\n​\n\n**Poses in this session:**\n\n- Puppy\n- Screaming Toe\n- Neck Stretch\n- Ankle Stretch\n- Chest Stretch\n- Forearm Stretch\n- Downward Dog\n- Revolved Standing Forward Bend\n- Low Lunge Chest Opener\n- Dead Pigeon\n- Reclining Spinal Twist\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.24166666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "GLN8bDnkTz",
              "contentId": "IhB5vyASlP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 16,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Morning Yoga Routine",
              "style": null,
              "compatibility": 100,
              "description": "In this sequence, we start with a short breathing exercise to relax the body and calm the mind, then mobilize joints throughout the body. From there we move into deeper stretches for the hips and hamstrings and finish with a short meditation.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25305555555555553,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "3dSiDxhXEJ",
              "contentId": "4dDcfXlQIK",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 19,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Side Bends",
              "style": null,
              "compatibility": 100,
              "description": "If you\u0027re pushing yourself hard, it\u0027s likely you\u0027re getting stiff and sore all over. Side bends are one of my favorite ways to deal with general soreness. They\u0027re also perfect for cyclists who typically suffer from poor lateral flexibility.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.24138888888888888,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 24,
                "intensityFactor": 0.99
              },
              "workoutId": "PvHKAMB04y",
              "contentId": "uxHo78097o",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 22,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Super Easy Stretch Routine I",
              "style": null,
              "compatibility": 100,
              "description": "Are you looking for a simple stretching routine you can do on a regular basis? New to yoga? Designed for yoga beginners, this gentle yoga session will get you on the road to a more flexible you. You\u0027ve said for years you\u0027d start stretching. Now\u0027s your chance.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2513888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "ZyVk7r3dWj",
              "contentId": "OQbPuzfX7F",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 26,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "The One For Your Hips",
              "style": null,
              "compatibility": 100,
              "description": "This classic yoga sequence is designed to enhance hip mobility by stretching the hip flexors, glutes, groin, hamstrings, and calves through a series of static poses. The routine emphasizes releasing tension with each exhalation. It is particularly effective for alleviating lower back pain and improving hip range of motion. This sequence can be practiced at any time of day.\n\n​\n\nThe objectives are to improve hip mobility, stretch the hip flexors, glutes, groin, hamstrings, and calves, practice nasal breathing with movement, and potentially alleviate lower back pain.\n\n​\n\n**Poses in this session:**\n\n- Mountain\n- Low Lunge\n- Downward Dog Split\n- Lizard\n- Pigeon\n- Happy Baby\n- Final Resting Pose\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.24194444444444443,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "dgMZ96oEct",
              "contentId": "3m7Kj2oYyG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 29,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Post-Workout Cool-Down",
              "style": null,
              "compatibility": 100,
              "description": "This gentle cool-down is designed to completely unwind you after your ride…and potentially send you to sleep. We move systematically through the body, loosening up and stretching out tight muscles. Try to stay relaxed throughout while breathing in and out through your nose.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2525,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "BrqwnuDu68",
              "contentId": "vcXpMpgVXC",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 32,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Morning Yoga Routine",
              "style": null,
              "compatibility": 100,
              "description": "In this sequence, we start with a short breathing exercise to relax the body and calm the mind, then mobilize joints throughout the body. From there we move into deeper stretches for the hips and hamstrings and finish with a short meditation.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25305555555555553,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "3dSiDxhXEJ",
              "contentId": "4dDcfXlQIK",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 36,
          "type": "Yoga",
          "rank": 100,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Pre-Ride Warm-Up",
              "style": null,
              "compatibility": 100,
              "description": "This sequence is designed to activate your posterior chain—the calves, hamstrings, glutes, lower, upper, and mid-back, as well as your core—the abs and obliques. It’s crucial that you engage these muscles before every ride to give you maximum power, speed, and endurance on the bike.\n\n​\n\nListen to why warm-ups are so important in this episode of The Knowledge podcast by Wahoo Sports Science:\n\n[https://wahoosystm.com/WarmingupTheEngine](https://wahoosystm.com/WarmingupTheEngine)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2525,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "pulwu8dOT9",
              "contentId": "tdaKARdZtx",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 38,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Recovery Booster",
              "style": null,
              "compatibility": 100,
              "description": "It may seem counterintuitive, but it\u0027s during recovery when you actually get stronger and consolidate the gains you\u0027ve made while training. Without proper recovery, you won\u0027t improve. This session helps boost your recovery time, relaxing you and ensuring you give your body the chance to grow stronger.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2427777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 24,
                "intensityFactor": 0.99
              },
              "workoutId": "gzgd8DC8J3",
              "contentId": "D6SEBUnjwW",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 41,
          "type": "Yoga",
          "rank": 100,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Breathing to Crush Them",
              "style": null,
              "compatibility": 100,
              "description": "This is the breathing technique used by Navy Seals to help them focus and find calm before major operations. Learn and use this technique before heading into your own major events and races.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.05138888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 5,
                "intensityFactor": 0.97
              },
              "workoutId": "XCJCw2hv7g",
              "contentId": "f0coAivEon",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ]
    },
    {
      "id": "Kv8lFbyj6F",
      "level": "",
      "type": "MentalTraining",
      "schedule": [
        {
          "day": 0,
          "type": null,
          "rank": 400,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "02. Identifying Your Personal Big Mountain",
              "style": null,
              "compatibility": 100,
              "description": "What - exactly - are you trying to accomplish? When you\u0027re ready to answer that question, this module will help you gain clarity on who you are as an athlete and identify your major goal—your Personal Big Mountain.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[The Importance of SMART Goal Setting](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/start-now-goal-setting-basics)\u0027 and \u0027[How to use your personal outlook to set more effective goals](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/know-thyself-how-to-use-your-personal-outlook-to-set-more-effective-goals)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.27444444444444444,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 32,
                "intensityFactor": 0.99
              },
              "workoutId": "U6fXCl3UDt",
              "contentId": "Hei16sQ00t",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 10,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "07. Positive Self-Talk",
              "style": null,
              "compatibility": 100,
              "description": "Improve your confidence and performance through three types of positive self-talk: Motivational, Instructional, and Reward. Here, we’ll look at the subtle and not-so-subtle effects that words have on our attitude and performance. You’ll listen more closely to the way you talk to yourself so you can improve that internal dialogue and become your own biggest fan.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[The Power of Positive Mental Strategies](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/episode-29-how-to-use-positive-self-talk-to-get-through-tough-moments-on-a-ride-mental-strategies)\u0027 on The Knowledge Podcast by Wahoo Fitness.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.24333333333333335,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 26,
                "intensityFactor": 0.99
              },
              "workoutId": "XUrrYkaPzg",
              "contentId": "7MLgmJEEHC",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 14,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "06. Relaxing to Recover",
              "style": null,
              "compatibility": 100,
              "description": "Here you will complete a full Progressive Muscle Relaxation session. It’s part guided meditation and part focus exercise. You should listen to this module at least once per week to get in tune with your body, release tension, and maximize recovery.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3736111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 37,
                "intensityFactor": 0.99
              },
              "workoutId": "mpUCq7UkVc",
              "contentId": "vilPYFsASb",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 20,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "08. Improving Focus",
              "style": null,
              "compatibility": 100,
              "description": "Develop an understanding of why focused concentration is so important to your performance. We will delve into what it means to be in “The Zone,\u0022 look at the psychology and the physiology of peak performance, and what it takes to get there.\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.09916666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 10,
                "intensityFactor": 0.98
              },
              "workoutId": "LHRs6VM57f",
              "contentId": "BNiDBJg2p8",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 26,
          "type": null,
          "rank": 400,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "04. Getting Positive",
              "style": null,
              "compatibility": 100,
              "description": "Thoughts matter. To accomplish big goals you need the ability to maintain a positive mindset, regardless of what life gives you. Here\u0027s an overview of the power of maintaining a positive mindset. We’ll introduce specific techniques that will help you identify negative thoughts, see obstacles as opportunities, and take a more positive path forward.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.2386111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 27,
                "intensityFactor": 0.99
              },
              "workoutId": "0BYNToDCNp",
              "contentId": "5j7NolaDRt",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 40,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "20. Preparing To Crush It",
              "style": null,
              "compatibility": 100,
              "description": "This pre-event visualization exercise will help you get in the zone to deliver what athletes and sports psychologists call a “peak performance;” it’s when everything flows and operates at the highest level almost without any effort.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.14555555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 15,
                "intensityFactor": 0.99
              },
              "workoutId": "LhDAu8UJr9",
              "contentId": "Au7PJtDXCe",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 41,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": "MentalTraining",
              "name": "21. How Did it Go?",
              "style": null,
              "compatibility": 100,
              "description": "Once the dust has settled and your heart rate has returned to normal levels, listen to this module. It\u0027s meant to be completed 15 minutes after the event ends. Part two of this exercise is completed the next day when you’ve had time to process and reflect on everything that happened during the event day.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.1338888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 14,
                "intensityFactor": 0.99
              },
              "workoutId": "i4LQOKHyns",
              "contentId": "h7t11MeQFl",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ]
    }
  ]
}