{
  "previewPlan": [
    {
      "id": "8nc1e8ID3b",
      "name": "SYSTM Sprint Distance Triathlon Training Plan/3:1/Ends on race day (clone)*DEC2020 High volume *delete",
      "weakness": "NoWeakness",
      "grouping": "Sprint Distance Triathlon",
      "category": "Multisport",
      "subcategory": "Without Strength",
      "description": "### Goal  \n  \nTo get you ready to complete or race a sprint distance triathlon in 13 weeks  \n  \n### Best for  \n  \n- Triathletes who have completed a short distance triathlon in the past, or are familiar with training for all three disciplines  \n- Triathletes who have 4-10 hours per week available to train  \n  \n### Training Blocks  \n  \n3 weeks on, 1 week off  \n  \n### Plan ends with  \n  \nRace day: sprint distance triathlon  \n  \n### Special Notes  \n  \n- All rides are scheduled to be completed indoors, with the longest sessions occurring over the weekends (assuming you select a Sunday end date).  \n- Given how technique-driven swimming is; if possible, we recommend subbing 1-2 swim sessions for a coached class with someone who can monitor your swim technique and offer corrective tips.  \n- Ideally, some swims will be completed in open water so that you know what to expect on race day, but if necessary, all swims can be completed in a pool.  \n- Most running workouts can be completed on a treadmill, although we recommend a running track for a select few of the sessions.  \n- The “Pre Tri Plan Testing week” plan is meant to be completed immediately before beginning this program in order to obtain the most accurate training zones.  \n- [Supplementary information](https://support.thesufferfest.com/hc/en-us/sections/333756984716-Triathlon-Tips-Tricks-Definitions) you might need to follow this plan successfully  \n",
      "planDescription": "Transition to a faster you with swim, bike and run plans designed to get you ready to crush your next Sprint Distance Triathlon",
      "fixedEndDate": "",
      "level": " ",
      "type": "Multisport",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "None",
      "progression": "None",
      "hidden": true,
      "createdAt": "2021-03-24T21:26:19.436Z",
      "updatedAt": "2025-11-13T11:14:25.982Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 1,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Recovery Run",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up\r\nNA\r\n\r\nMain Effort \r\nNumber of Sets:\r\n1\r\nRest Between Sets: \r\nNA\r\nInterval Duration:\r\n20 minutes\r\nInterval Repeats Per set:\r\nNA\r\nInterval Effort: \r\n20 minutes @ RPE \u003C2  -- \u003E145% of RTP --HR \u003C70%\r\nRecovery: NA\r\n\r\nExtra Volume \r\nNA \r\n\r\nCool Down \r\nNA",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This jog is so easy and the pace so slow you should be embarrassed to be seen running this slow - except that you know that this slow run is helping you get even faster! The pace is just high enough to be considered a jog, and your focus should be on taking short strides and enjoying the scenery around you. Do this off the bike.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 1,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Frozen Road",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2017): From the creator: \u0022Self-shot and edited whilst cycling around the world, this film charts a winter journey into the Canadian Arctic as I completed my bike ride up the American continent. Compelled by Jack London’s assertion, that ‘any man who is a man can travel alone,\u0027 I sought an adventure of perfect solitude. Yet, as I came to realize, the harsh truths of traveling in such a formidable environment were a long way from the romantic images I’d held of this land. _The Frozen Road_’ is an honest reflection on my solo trip; of the wonder, terror and frustration I experienced when riding through the unforgiving emptiness of one of the world’s ‘last great wildernesses.\u0022\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.41805555555555557,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 8,
                "intensityFactor": 0.44
              },
              "workoutId": "bHz6eBsicH",
              "contentId": "fwzyQcEcGW",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 3,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Other French Race",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Rupert Guinness entered the Haute Route Alps in France looking for a new challenge to test his physical and mental strength. But after 800km of cycling through the Alps from Nice to Megève, the cycling journalist and author realized that the experience had delivered to him and the 400-plus starters something far greater. It had provided them with the adventure of a lifetime; from a sense of what it would be like to ride in the fabled Tour de France that he has reported on more than 30 times, to the creation of friendships with fellow riders forged by their shared suffering and encouragement for one another as they cycled through some of the toughest and most spectacular mountains that cycling has to offer.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5291666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 19,
                "intensityFactor": 0.6
              },
              "workoutId": "fiQklsxqiH",
              "contentId": "X7LsDQ8h23",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 3,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Strides \u0026 Drills",
              "style": null,
              "compatibility": 100,
              "description": "This is a technique-focused session designed to develop your agility, stability, range of motion, and foot speed. There is no focus on heart rate zones so you may choose to leave your monitor at home for these sessions. Between sets of each drill, you should jog/walk easily to fully recover between the efforts. While these efforts shouldn’t be too taxing on you, the key is perfect form, so you want to be hitting each one rested enough that you can maintain great form for the duration. You should take a bit of extra rest between techniques, again to ensure you are rested and can nail the form. Before starting the workout, familiarize yourself with the format for high knees, butt kicks, skipping, carioca and strides. Find a flat track, field, or 50-100m of open space to perform this workout (football and soccer fields are great for this).\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-up:**\n\nStart off with 5-10 minutes of easy jogging/walking.\n\nHigh Knees: 2-3 sets of 50m high knees.\n\nEasy jog/walk for 30-60 seconds between.\n\n- Take short strides, bringing your knees up high enough that your upper legs are parallel to the ground. Focus on achieving high knees AND quick turnover, or performing as many reps as possible in a short distance.\n\n**Butt Kicks:**\n\n2-3 sets of 50m butt kicks.\n\nEasy jog/walk for 30-60 seconds between.\n\n- This should actually look similar to a high knee drill, but with the heels coming up to touch the bottom of your butt. Take short strides while using your hamstrings to lift your heels up beneath your butt. Your knees should come up in front of your body while pulling your heels up beneath your hips, rather than keeping your quads and knees below and in line with your hips.\n\n**Skipping:**\n\n3-4 sets of 50m skipping.\n\nEasy jog/walk for 30-60 seconds between.\n\n- Focus on a high knee drive and swinging your arms at your sides like you would when running.\n\n**Carioca:**\n\n4 sets of 30m Carioca in each direction (8 total).\n\nRest for 20 seconds between direction changes (at your discretion).\n\n- For this drill, you need to face sidewise to the direction you want to go. Start off moving to the right. Bring your left knee up and across your body and put your left foot in front of your right foot. Step your right foot to the right so it is parallel with your left leg again (at this point you should be positioned in the same direction and orientation that you were at the start. Next step your left leg behind your right leg, again so it lands on the right side of your right leg. Then bring your right leg back across your body, once again ending up in the starting position. Repeat this pattern for 25-30m.\n\n**Strides:**\n\n2-3 sets of 60m; Gradually build effort from RPE 3-8.\n\nEasy jog/walk for 30-60 seconds between. These are comprised of a steady acceleration over 60-80m up to 5k pace. The goal is to increase speed after each step, so you are reaching maximum speed at the end of the 60-80m stretch. You want to focus on keeping your shoulders, neck, and jaw relaxed while maintaining strong knee drive, straight and compact arm swing, planting the feet beneath the hips, and fast turnover.\n\n​\n\nHigh Knees \u002B Butt Kicks:\n\nFinish these drills with one set each of 50m high knees and butt kicks.\n\n​\n\n**Cool-down:**\n\nWalk or jog for 5 minutes to cool down.\n\nIn case you need to brush up on your running [drills](https://wahoosystm.com/RunningSessionFAQ)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 12,
                "intensityFactor": 0.6
              },
              "workoutId": "TfKQjysBHT",
              "contentId": "berlHpGqZJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 4,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Speed 25\u0027s to 100\u0027s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n300m stroke of your choice @ RPE 3 -- Z2\n\n​\n\n**Activation**\n\n200m Kick @ RPE 3-4 -- Z2\n\n30 sec rest\n\n300m Pull @ RPE 3-4 -- Z2\n\n30 sec rest\n\n50m Drill @ RPE 3-4 -- Z2\n\n10 sec rest\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nInterval 1: 4 x 25m @ RPE 10 -- Z6 “Flat Out”\n\nRecovery: 15 sec rest\n\nInterval 2: 2 x 50m (Starting @ RPE 7 -- Z4a, increasing to RPE 10 -- Z6 over full distance)\n\nRecovery: 25 sec rest\n\nInterval 3: 2 x 75m (first 25m @ RPE 7 -- Z4a, second 25m @ RPE 5-6 -- Z3, final 25m @ RPE 7 -- Z4a)\n\nRecovery: 40 sec rest\n\nInterval 4: 1 x 100m @ RPE 7 -- Z4a\n\nRecovery: 60sec rest\n\n​\n\n**Cool Down**\n\n300m stroke of your choice @ RPE 5 -- Z3 slowing to RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2250m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 60,
                "intensityFactor": 0.85
              },
              "workoutId": "ZkKNdO8ARD",
              "contentId": "P7M64zfD6d",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 5,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance 1.5",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high and your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride, especially one under 90 minutes should not leave you fatigued or your legs wasted.\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in low to mid Zone 2 heart rate, which is 70-80% of LTHR up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can; for most this is 80-90rpm. Also, your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster, but you will have to trust us on this one! When you see this session in your Training Plan, follow these instructions, or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats Per Set: 4\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n**Extra Volume**\n\nNA\n\n**Cool Down**\n\n5 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 52,
                "intensityFactor": 0.59
              },
              "workoutId": "tzTwzPCAqr",
              "contentId": "18VxkKVYn4",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 5,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 35",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up:**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 30 minutes\n\nInterval Effort: RPE 3-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down:**\n\n5 min @ RPE 1-2 -- \u003E145% of RTP -- HR \u003C 70% (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5833333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 21,
                "intensityFactor": 0.6
              },
              "workoutId": "",
              "contentId": "dbPBxzSWHJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Running",
          "rank": 203,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 45",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\nThis is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\nFor help understanding your run workout and calculating your pace zones, please see this article.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 45 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "tvV3J76Z7l",
              "contentId": "yvcdSYNPIG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 7,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "1K Pyramid (A)",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n300m stroke of your choice @ RPE 2 --Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval Distance: 50m swim \u002B 200m kick\n\nInterval Effort: Increasing RPE 3-6.5 -- Z2-Z4a\n\nRecovery: 20s after 50m swim\n\n30s after 200m kick\n\n​\n\n**Main Effort:**\n\nNumber of Sets: 1\n\nInterval Distance and Effort: 50m @ RPE 7 --Z4a\n\n10 seconds rest\n\n100m @ RPE 7 -- Z4a\n\n20 seconds rest\n\n150m @ RPE 7 -- Z4a\n\n30 seconds rest\n\n200m @ RPE 7 -- Z4a\n\n60 seconds rest\n\n200m @ RPE 7 -- Z4a\n\n60 seconds rest\n\n150m @ RPE 7 -- Z4a\n\n30 seconds rest\n\n100m @ RPE 7 -- Z4a\n\n20 seconds rest\n\n50m @ RPE 7 -- Z4a\n\n10 seconds rest\n\nRecovery: 60 seconds rest\n\nNote: Aim to hold a slightly higher pace for all efforts in the second half of the set\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 60,
                "intensityFactor": 0.85
              },
              "workoutId": "",
              "contentId": "h6BC2Kf4dO",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 8,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "London-Edinburgh-London",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2016): London Edinburgh London follows a group of cyclists from around the world on a remarkable feat of endurance. Join their ride up the length of Britain - from London to Edinburgh and back again - in under five days. Traveling over 1400km, a continuous distance far further than most of them had ever ridden before, our unlikely and eccentric heroes are not only tested physically but face the mental challenge, \u0022can I push myself further? Can I go one more day?\u0022.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9088888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 32,
                "intensityFactor": 0.6
              },
              "workoutId": "u3Zi4ltMFp",
              "contentId": "9SXTIEdocd",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 8,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 15 mins\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\nExtra Volume:NA\n\n​\n\n**Cool Down**\n\nNA (This is a steady Z2 run immediately after your bike session. Use this as an opportunity to practice your second transition!)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 9,
                "intensityFactor": 0.6
              },
              "workoutId": "HE2K3d4eew",
              "contentId": "aw9CrLNISP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 9,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "20 x 75m descending",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warmup**\n\n400 @ RPE 3 -- Z2\n\n15s rest\n\n100 kick on side @ RPE 5 -- Z3\n\n15s rest\n\n4 x 50 (drill 25 \u002B swim 25), change sides each 25 @ RPE 3 -- Z2\n\n15s rest\n\n​\n\n**Activation**\n\n4 x 50m, build RPE 3 -- Z2 to RPE 9 -- Z5\n\nRecovery: 20s between each\n\n​\n\n**Main Effort**\n\n8 x 75m @ RPE 5 -- Z3 (10 sec rest)\n\n6 x 75m @ RPE 6 -- Z3 (15 sec rest)\n\n4 x 75m @ RPE 7 -- Z4a (20 sec rest)\n\n2 x 75m @ RPE 8 -- Z4b (25 sec rest)\n\n​\n\n**Extra Volume**\n\n200m @ RPE 5 -- Z3\n\n​\n\n**Cool down**\n\n100m @ RPE 2 -- Z1, alternate free and non free each 25m if possible\n\n​\n\n**Total Distance**\n\n2700m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 47,
                "intensityFactor": 0.75
              },
              "workoutId": "txEqglqwi5",
              "contentId": "9qn0yZQpMa",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 10,
          "type": "Running",
          "rank": 203,
          "prospects": [
            {
              "type": "Running",
              "name": "8 x 300",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Activation: Strides**\n\nNumber of Sets 5\n\nRest Between Sets 1 min\n\nInterval Distance 50m build\n\nInterval Effort Gradual increase from RPE 3-8 (Z2-Z4)\n\nRecovery RPE \u003C2 --\u003E145% of RTP -- HR \u003C70% (Z1)\n\n​\n\n**Main Effort**\n\nNumber of Sets 8\n\nRest Between Sets 2 minutes\n\nInterval Distance Per set 300m\n\nInterval Effort RPE 9-10 --\u003C85% of RTP --HR NA (Z5)\n\nRecovery RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\nNote: If necessary this can be split into 2 sets of 4 repeats, adding in 5-7 minutes of easy jogging between the 2 sets. The goal here is maximal speed for each and every effort!\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- 145% of RTP -- HR \u003C70% (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 3,
                  "map": 5,
                  "ftp": 3
                },
                "tss": 98,
                "intensityFactor": 0.95
              },
              "workoutId": "3OrDRpHelv",
              "contentId": "C2KAsuoFU8",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 12,
          "type": "OutdoorCycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Tempo Low Cadence: 5 x 2",
              "style": null,
              "compatibility": 100,
              "description": "While the single tempo effort you complete in this session is steady in terms of power, it is the specific cadence targets that set this session apart from other tempo workouts.\n\n​\n\nEven though an effort at 80% of FTP might seem \u0022easy\u0022 the truth is your body is working at processing oxygen and metabolites at nearly the same rate when you are right at FTP. The difference is that the overall stress on your system when riding tempo is considerably less than riding at FTP. That means you can either have harder days before or after a tempo session (compared to a Threshold session) or you can increase the duration of those tempo efforts to make the overall training stimulus equal (or greater) than completing several repeats right at your FTP.\n\n​\n\n**Warm-Up **\n\n25 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort **\n\nNumber of Sets: 1\n\nRest Between Sets: N/A\n\nInterval Repeats per Set: 5\n\n**Interval **\n\nEffort: 2 minutes @ RPE 7 -- 90% of FTP -- 45-55 RPM -- HR \u003C95%\n\nRecovery: 5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C75%\n\n​\n\n**Extra Volume **\n\n35 minutes @ RPE 3 -- 60% of FTP -- HR \u003C85%\n\n​\n\n**Cool Down **\n\n10 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 65,
                "intensityFactor": 0.61
              },
              "workoutId": "VEqTCrCdO7",
              "contentId": "FZJEiO3Qku",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 12,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 45",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up:**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 40 minutes\n\nInterval Effort: RPE 3-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down:**\n\n5 min @ RPE 1-2 -- \u003E145% of RTP -- HR \u003C 70% (Z1\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 32,
                "intensityFactor": 0.65
              },
              "workoutId": "",
              "contentId": "iiIkWWVfB0",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 13,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z1\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent.\n\nCount strokes every 5 laps to ensure that your form is not deteriorating.\n\nPractice your sighting at least once every 100m.\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 42,
                "intensityFactor": 0.65
              },
              "workoutId": "eGJNUinB1C",
              "contentId": "t36WK6pbfA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 13,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 60 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "zddJD9fu8z",
              "contentId": "WEhIpACFzU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 14,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "5 x 200 Descending",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n200m breathing every 3-7 strokes @ RPE 3 -- Z2\n\n40 sec rest\n\n​\n\n**Activation**\n\n3 x 200m Pull @ RPE 5 -- Z3\n\n60 sec rest\n\n8 x 25 Kick @ RPE 7 -- Z4a. Odds on front, Evens on back\n\n30 sec rest\n\n​\n\n**Main Set**\n\nDescending effort \u0026 pace (each effort to be 5 seconds faster than the one before it)\n\n200m @ RPE 5 -- Z3\n\n2 min rest\n\n200m @ RPE 6.5 -- Z4a\n\n2 min rest\n\n200m @ RPE 7.5 -- Z4b\n\n2 min rest\n\n200m @ RPE 3 -- Z2\n\n2 min Rest\n\n200m @ RPE 9 -- Z5\n\n2 min Rest\n\n​\n\n**Extra Volume**\n\n100m @ RPE 2 -- Z1 (Choice of Stroke)\n\n30s rest\n\n8 x 50 as: Odds @ RPE 3 -- Z2, Evens @ RPE 9 -- Z5\n\n30 sec rest\n\n​\n\n**Cool Down**\n\n100-300m @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n3000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 64,
                "intensityFactor": 0.8
              },
              "workoutId": "90Y1S7OxrN",
              "contentId": "LAlHkRlUnE",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 15,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Chasing the Sun",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2023): Fresh from a sold-out tour of UK cinemas, Chasing The Sun is the new documentary film from 2x BAFTA-winning director Michael B.Clifford. It explores extraordinary personal stories of ordinary cyclists taking on iconic endurance event Chase The Sun, revealing the power of the humble bicycle to transform lives and help save the planet.\n\nThe film features contributions from broadcaster and ITV’s voice of the Tour de France Ned Boulting, author and blogger Jools Walker, Turner Prize-winning artist Sir Richard Long and 4x Mountain Bike World Champion Tracy Moseley.\n\n​\n\n🚴 Workout: the workout accompanying this film varies from endurance to tempo to sub-threshold. The higher intensity efforts aren\u0027t the hardest you\u0027ll experience so that you can keep your attention on the film, however, they are just hard enough to help improve your FTP, oxygen utilization efficiency, and the ability to recover quickly between hard efforts. The workout intensity reflects the intensity of the riders in many places, so you may feel as if you\u0027re climbing Mont Ventoux or that you\u0027re a part of Cav\u0027s lead-out train on the run into the finish line.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.181111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 18,
                "intensityFactor": 0.6
              },
              "workoutId": "qbmkMxCVeZ",
              "contentId": "ZkM7ysOcR2",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 15,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic w/pickups Brick",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nInterval Repeats Per Set: 5\n\nInterval Effort: 30 second acceleration from RPE 4 to RPE 8 -- 120% of RTP up to 90% of RTP (Z2-Z4)\n\nRecovery: 4 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\nEnd your workout with 5 minutes of easy jogging (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 2,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 28,
                "intensityFactor": 0.75
              },
              "workoutId": "",
              "contentId": "BTUqFQyHXS",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 16,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "4 sets: Easy/Fast 500\u0027s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n300m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval: 50m Drill @ RPE 2-3 -- Z1-Z2\n\nRecovery: 20 seconds rest\n\n​\n\n**Activation 2**\n\nNumber of Sets: 4\n\nInterval Distance: 50m starting @ RPE 3 -- Z2, building to RPE 7 -- Z4a\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Set**\n\nComplete: Set 1, Set 2, Set 1, Set 2\n\n**Set 1:**\n\n25m @ RPE 2 -- Z1\n\n25m @ RPE 7 -- Z4a\n\n50m @ RPE 2 -- Z1\n\n50m @ RPE 7 -- Z4a\n\n75m @ RPE 2 -- Z1\n\n75m @ RPE 7 -- Z4a\n\n100m @ RPE 2 -- Z1\n\n100m @ RPE 7 -- Z4a\n\nRecovery: 60 seconds rest\n\n**Set 2:**\n\n100m @ RPE 2 -- Z1\n\n100m @ RPE 7 -- Z4a\n\n75m @ RPE 2 -- Z1\n\n75m @ RPE 7 -- Z4a\n\n50m @ RPE 2 -- Z1\n\n50m @ RPE 7 -- Z4a\n\n25m @ RPE 2 -- Z1\n\n25m @ RPE 7 -- Z4a\n\nRecovery: 60 seconds rest\n\n​\n\n**Extra Volume:**\n\nNumber of Sets: 4\n\nInterval Distance and Effort: 25m @ RPE 10 -- Z6\n\nRecovery: 30 seconds rest\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n3000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 52,
                "intensityFactor": 0.75
              },
              "workoutId": "snkHEgff1S",
              "contentId": "SdT60AWwVc",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 17,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "A Dog\u0027s Life 1",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2020): Follow pro downhiller Brendan Fairclough around the island of Madeira for some epic views, custom-built trails, and backflips in Episode 1 of _A Dog\u0027s Life_.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. Intensity is low, with power remaining at or below 50% of FTP (2.5 on a scale from 1 to 10) with heart rate targets entirely in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4102777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 9,
                "intensityFactor": 0.48
              },
              "workoutId": "GlFQgjaoCE",
              "contentId": "bpOoVM39dB",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 17,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "2 sets 4 x 400s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Activation: Strides**\n\nNumber of Sets: 4\n\nRest Between Sets: 1 min\n\nInterval Distance: 50m build\n\nInterval Effort: Gradually increase from RPE 3-8 (Z2-Z4)\n\nRecovery: RPE \u003C2 --\u003E145% of RTP -- HR \u003C70% (Z1)\n\n​\n\n**Main Effort**\n\nNumber of sets: 2\n\nRest between sets: 20 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval repeats per set: 4\n\n**Interval**\n\nWork: 2 minutes @ RPE 9 -- 95-105%% of MAP (115-135% of FTP)\n\nRest: 2 minutes @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 2\n\nRest Between Sets: 7 minute\n\nInterval repeats per set: 4\n\n**Interval**\n\nInterval Distance Per set: 400m\n\nRecovery between Intervals: 1 minute\n\nInterval Effort: RPE 8.5-9.5 --92-85% of RTP --HR 105% \u002B (Z5)\n\nRecovery: RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- 145% of RTP -- HR \u003C70% (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.1666666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 3,
                  "map": 4,
                  "ftp": 4
                },
                "tss": 105,
                "intensityFactor": 0.95
              },
              "workoutId": "ud67NyAiit",
              "contentId": "MqQsghEMUR",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 18,
          "type": "Swimming",
          "rank": 201,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique C",
              "style": null,
              "compatibility": 100,
              "description": "Brush up on your [technique definitions or drills](http://thesuf.com/HCtechswim)\r\n\r\nWarm Up\r\n200m stroke of your choice @ RPE 2\r\n\r\nActivation 1\r\nNumber of Sets:\r\n4 \r\nInterval Distance:\r\n25m Drill\r\nRecovery:\r\n10 seconds rest\r\n \r\nActivation 2\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n100m kick\r\nRecovery:\r\n20 seconds rest\r\n\r\nActivation 3\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n100m Pull\r\nRecovery:\r\n20 seconds rest\r\n\r\nMain Set\r\nComplete at least six of the drills that you struggle the most with. Aim for 150-200m of each one. The only way to get better is to work on your weaknesses! So be honest with yourself and pick the drills you have the hardest time with.\r\n  \r\nCool Down \r\n200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Good swimming technique is the key to efficient swimming.  Today is about improving your technique by challenging you with a series of drills and specific moves.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 19,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "OutdoorCycling",
              "name": "Sub-Threshold: 5 x 4",
              "style": null,
              "compatibility": 100,
              "description": "Warm-Up\n30 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\nMain Effort\nNumber of Sets\n1\nRest Between Sets\nN/A\nInterval Repeats per Set\n5\nInterval\nEffort: 4 minutes @ RPE 6 -- 90% of FTP -- HR \u003C90%\nRecovery: 5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\nExtra Volume\n35 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C85%\n\nCool Down\n10 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C 60%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 0,
                "intensityFactor": 0
              },
              "workoutId": "bBlY448QZQ",
              "contentId": "kzdZ7zFrl2",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 19,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Progressive Brick 20",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 20 minutes\n\nInterval Effort: Building RPE 2-6 -- 145-110% of RTP --HR 70-95% (Z1-Z3)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\n5 min @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4166666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 30,
                "intensityFactor": 0.85
              },
              "workoutId": "ZFH9di6BKa",
              "contentId": "pxDBMixGyX",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 20,
          "type": "Running",
          "rank": 200,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 75",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n**Warm-Up**\n\nNA\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 75 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "8VtH36r1nD",
              "contentId": "CLo1K0MBo2",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 22,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Across the Mountains",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2020): _Across the Mountains_ follows legendary cyclist Michael Cotty through two different adventures. The first, _Les Alpes_, is the story of Mike\u0027s non-stop ride from Evian-Les-Bains to Nice across the heart of the Alps: a journey of 677km with 17 mountain passes and more than 16,000 meters of climbing. The second, _The Road to Mont Blanc_, sees Mike tackle a 1,000 km non-stop journey across 21 mountains in the Dolomites, Eastern and Swiss Alps before finishing at Mont Blanc. Featuring never-before-seen footage and exclusive commentary by Mike Cotty himself.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. Intensity is low, with power remaining at or below 50% of FTP (2.5 on a scale from 1 to 10) with heart rate targets entirely in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6352777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 13,
                "intensityFactor": 0.45
              },
              "workoutId": "WhCO6a7rFS",
              "contentId": "8kavOun8lH",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 23,
          "type": "Swimming",
          "rank": 201,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique A",
              "style": null,
              "compatibility": 100,
              "description": "Brush up on your [technique definitions or drills](http://thesuf.com/HCtechswim)\r\n\r\nWarm Up\r\n200m stroke of your choice @ RPE 2\r\n\r\nActivation 1\r\nNumber of Sets:\r\n4 \r\nInterval Distance:\r\n25m Drill\r\nRecovery\r\n10 seconds rest\r\n \r\nActivation 2\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n200m Pull \r\nRecovery:\r\n20 seconds rest\r\n\r\nMain Effort\r\nInterval 1\r\n150m One Arm Freestyle    \r\nRecovery\r\n20 Seconds Rest   \r\nInterval 2\r\n-200m 3/4 Catch Up   \r\nRecovery \r\n20 Seconds Rest   \r\nInterval 3\r\n-200m Elbow-Hip-Elbow   \r\nRecovery\r\n20 Seconds Rest  \r\nInterval 4 \r\n-150m Fist Drill   \r\nRecovery\r\n20 Seconds Rest  \r\nInterval 5 \r\n-200m Zipper Drill   \r\nRecovery\r\n20 Seconds Rest\r\n\r\nRepeat until full swim time is completed\r\n\r\nCool Down \r\n200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Good swimming technique is the key to efficient swimming.  Today is about improving your technique by challenging you with a series of drills and specific moves.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 24,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Recovery Run",
              "style": null,
              "compatibility": 100,
              "description": "This is as easy as easy gets.\n\nYou should hardly be going fast enough to consider this a jog.\n\nYou want to focus on taking very short strides but keeping your stride rate at least 80 steps per minute.\n\nYou should be embarrassed to be seen going this slowly!\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up **NA\n\n​\n\n**Main Effort** \n\nNumber of Sets 1 \n\nRest Between Sets: NA \n\nInterval Repeats Per Set NA \n\nInterval Effort: 20 minutes @ RPE 1-3 -- 165-140% of RTP -- HR \u003C70% (Z1) \n\nRecovery: NA\n\n​\n\n**Extra Volume** NA\n\n​\n\n**Cool Down** NA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 1,
                "intensityFactor": 0.2
              },
              "workoutId": "NSFBYpA28h",
              "contentId": "ixGIERsp4a",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 24,
          "type": "Cycling",
          "rank": 203,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Cadence Builds",
              "style": null,
              "compatibility": 100,
              "description": "One of the best sessions for neuromuscular training, this drill asks you to progressively build from a cadence of 90 RPM to your MAX over 30 seconds, recover, and repeat several times. Cadence builds improve how you recruit your leg, gluteal, and core muscles throughout your pedal stroke by progressing to your maximal cadence. By reaching your highest cadence possible, you are training the \u0027on/off\u0027 switch in each muscle group to not only work faster but to have less overlap with your other muscle groups. This session trains your hamstring muscles to \u0027turn off\u0027 when your quads \u0027turn on\u0027 and vice-versa, resulting in a more efficient pedal stroke at both high and low cadences.\n\n​\n\n**LEARN MORE**\n\nListen to The Knowledge podcast, by Wahoo Sports Science - The Benefits of High Cadence Training: [https://wahoosystm.com/BenefitsofHighCadence](https://wahoosystm.com/BenefitsofHighCadence)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5480555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 5,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 21,
                "intensityFactor": 0.62
              },
              "workoutId": "04BfbUGDMk",
              "contentId": "n3WrizBr1g",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 25,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "30 min Continuous Swim",
              "style": null,
              "compatibility": 100,
              "description": "Swim continuously in the pool for 30 minutes or 1000-1600m. Practice sighting without stopping and use the pace clock or a watch to monitor your pace throughout the swim.\n\n​\n\nCount strokes every 4-6 lengths to make sure you are staying consistent.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Total Distance**\n\n1600m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 13,
                "intensityFactor": 0.5
              },
              "workoutId": "UlnkBzz75P",
              "contentId": "uHwHFHsbKX",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 26,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 15 mins\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\nExtra Volume:NA\n\n​\n\n**Cool Down**\n\nNA (This is a steady Z2 run immediately after your bike session. Use this as an opportunity to practice your second transition!)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 9,
                "intensityFactor": 0.6
              },
              "workoutId": "HE2K3d4eew",
              "contentId": "aw9CrLNISP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 26,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance  1",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high and your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride, especially one under 90 minutes should not leave you fatigued or your legs wasted.\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in low to mid Zone 2 heart rate, which is 70-80% of LTHR up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can; for most this is 80-90rpm. Also, your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster, but you will have to trust us on this one! When you see this session in your Training Plan, follow these instructions, or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats Per Set: 2\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 35,
                "intensityFactor": 0.59
              },
              "workoutId": "MoHJtkSmht",
              "contentId": "SmypIMDui1",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 27,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n5 minutes @ RPE \u003C 2 -- \u003E 145% of RTP --HR   \u003C 70%\r\n\r\nMain Effort \r\nNumber of Sets\r\n1\r\nRest Between Sets \r\nNA\r\nInterval Duration\r\n20 minutes\r\nInterval Effort: \r\nRPE 2-4 -- 145-120% of RTP --HR 70-87%\r\nRecovery\r\nNA\r\n\r\nExtra Volume \r\nNA\r\n\r\nCool Down \r\n5 minutes @ RPE \u003C 2 -- \u003E 145% of RTP --HR   \u003C 70%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This is an easy, fun and unstructured jog or run, designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!). Avoid any hills as best you can and just keep it steady Sufferlandrian.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 28,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "20 x 25 \u002B 6 x 300 ",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warmup**\n\n200m @ RPE 3 -- Z2\n\nRecovery: 15s rest\n\n200 pull @ RPE 4 -- Z2\n\nRecovery: 15s rest\n\n200 kick @ RPE 5 -- Z3\n\nRecovery: 15s rest\n\n​\n\n**Main Effort:**\n\n**Interval 1**\n\nNumber of Sets: 20\n\nInterval Effort: 25m @ Variable effort:\n\n#s 1-3 @ RPE 4-5 -- Z2-Z3\n\n#4 @ RPE 10 -- Z6\n\nRecovery: 5s rest between each\n\n**Interval 2**\n\nNumber of Sets: 6\n\nInterval Effort: 300m @ RPE 7 -- Z4a\n\nRecovery:\n\n#1 \u0026 4 @ :20 rest\n\n#2 \u0026 5 @ :10 rest\n\n#3 \u0026 6 @ :05 rest\n\n​\n\n**Cool Down:**\n\n200 pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n3100m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 72,
                "intensityFactor": 0.85
              },
              "workoutId": "Uhl5zUVJP5",
              "contentId": "kHnGMMuCtx",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 29,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "I. Boswell 3: Strength Endurance",
              "style": null,
              "compatibility": 100,
              "description": "When he\u0027s riding inside, Ian\u0027s a fan of the Sufferfest workouts Power Station and GOAT. So it\u0027s no surprise he\u0027s taking you on one of his favorite rides: big gear strength efforts on long climbs in the hills around the farmhouse. Not only that, but he\u0027s also going to teach you to cut down a tree and stack firewood! What a day!\n\n​\n\n_Do this on: Day 2 of the 7-day plan._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0608333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 4,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 56,
                "intensityFactor": 0.73
              },
              "workoutId": "zegk6vzC6N",
              "contentId": "Xiauj3wr2s",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 29,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic w/pickups Brick",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\n5 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nInterval Repeats Per Set: 5\n\nInterval Effort: 30 second acceleration from RPE 4 to RPE 8 -- 120% of RTP up to 90% of RTP (Z2-Z4)\n\nRecovery: 4 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\nEnd your workout with 5 minutes of easy jogging (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 2,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 28,
                "intensityFactor": 0.75
              },
              "workoutId": "",
              "contentId": "BTUqFQyHXS",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 30,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "45 min Continuous Swim",
              "style": null,
              "compatibility": 100,
              "description": "Swim continuously in the pool for 45 minutes or 2000-3000m. Practice sighting without stopping and use the pace clock or a watch to monitor your pace throughout the swim.\n\n​\n\nCount strokes every 4-6 lengths to make sure you are staying consistent.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Total Distance**\n\n3000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 19,
                "intensityFactor": 0.5
              },
              "workoutId": "fqOQmN2pkN",
              "contentId": "6ODy9Aj2ih",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 31,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "A Dog\u0027s Life 2",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2020): Join pro downhiller Brendan Fairclough, the_ Dog\u0027s Life_ crew, and Vinny T as they ride on the snowy slopes of Châtel and fly down Vinny\u0027s infamous gully trails.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. Intensity is low, with power remaining at or below 50% of FTP (2.5 on a scale from 1 to 10) with heart rate targets entirely in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4102777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 10,
                "intensityFactor": 0.49
              },
              "workoutId": "RxFT3qeRVm",
              "contentId": "Oc3aF5Xq38",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 31,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Crazy 8\u0027s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Activation: Strides**\n\nNumber of Sets: 2\n\nRest Between Sets: 1 min\n\nInterval Distance: 100m build\n\nInterval Effort: Gradual increase @ RPE 3-8 (Z2 building to Z4)\n\nRecovery: RPE \u003C2 --\u003E145% of RTP -- HR \u003C70% (Z1)\n\n​\n\nMain Effort- (6 X 800 at 95% MAP)\n\nNumber of Sets: 6\n\nRest Between Sets: 2 minutes\n\nInterval Distance Per set: 800m\n\nInterval Effort: Gradually build from RPE 7.5-9 --100-85% of RTP --HR 100-105% (Z4a - Z4b)\n\nRecovery Effort: RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\nNote: Do the first few sets conservatively and finish stronger and faster in the second half of the workout. If you can no longer keep the pace for the full 800m then stop the workout and begin your cool down.\n\n​\n\n**Extra Volume**\n\nStrides: 2-4 x 100m strides, on grass if possible.\n\nGradual increase @ RPE 3-8 (Z2-Z4b)\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- 145% of RTP -- HR \u003C70% (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 2,
                  "map": 4,
                  "ftp": 4
                },
                "tss": 81,
                "intensityFactor": 0.9
              },
              "workoutId": "kw9bkIk0wa",
              "contentId": "Qr2HeDJMlQ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 32,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "4 sets: Easy/Fast 500\u0027s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n300m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval: 50m Drill @ RPE 2-3 -- Z1-Z2\n\nRecovery: 20 seconds rest\n\n​\n\n**Activation 2**\n\nNumber of Sets: 4\n\nInterval Distance: 50m starting @ RPE 3 -- Z2, building to RPE 7 -- Z4a\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Set**\n\nComplete: Set 1, Set 2, Set 1, Set 2\n\n**Set 1:**\n\n25m @ RPE 2 -- Z1\n\n25m @ RPE 7 -- Z4a\n\n50m @ RPE 2 -- Z1\n\n50m @ RPE 7 -- Z4a\n\n75m @ RPE 2 -- Z1\n\n75m @ RPE 7 -- Z4a\n\n100m @ RPE 2 -- Z1\n\n100m @ RPE 7 -- Z4a\n\nRecovery: 60 seconds rest\n\n**Set 2:**\n\n100m @ RPE 2 -- Z1\n\n100m @ RPE 7 -- Z4a\n\n75m @ RPE 2 -- Z1\n\n75m @ RPE 7 -- Z4a\n\n50m @ RPE 2 -- Z1\n\n50m @ RPE 7 -- Z4a\n\n25m @ RPE 2 -- Z1\n\n25m @ RPE 7 -- Z4a\n\nRecovery: 60 seconds rest\n\n​\n\n**Extra Volume:**\n\nNumber of Sets: 4\n\nInterval Distance and Effort: 25m @ RPE 10 -- Z6\n\nRecovery: 30 seconds rest\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n3000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 52,
                "intensityFactor": 0.75
              },
              "workoutId": "snkHEgff1S",
              "contentId": "SdT60AWwVc",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 33,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "OutdoorCycling",
              "name": "Sub-Threshold: 5 x 4",
              "style": null,
              "compatibility": 100,
              "description": "Warm-Up\n30 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\nMain Effort\nNumber of Sets\n1\nRest Between Sets\nN/A\nInterval Repeats per Set\n5\nInterval\nEffort: 4 minutes @ RPE 6 -- 90% of FTP -- HR \u003C90%\nRecovery: 5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\nExtra Volume\n35 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C85%\n\nCool Down\n10 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C 60%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 0,
                "intensityFactor": 0
              },
              "workoutId": "bBlY448QZQ",
              "contentId": "kzdZ7zFrl2",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 33,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Progressive Brick 35",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 35 minutes\n\nInterval Effort: Building RPE 2-6 -- 145-110% of RTP --HR 70-95% (Z1-Z3)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\n5 min @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 0,
                "intensityFactor": 0
              },
              "workoutId": "F6ryHJx7xG",
              "contentId": "4vVUZzn0CF",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 34,
          "type": "Running",
          "rank": 200,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 60 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "zddJD9fu8z",
              "contentId": "WEhIpACFzU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 35,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "20 x 50 (15 Polo, 35 DPS)",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\nNumber of Sets: 2\n\nInterval: 100m starting @ RPE 2 -- Z1 and descending to RPE 5 -- Z3\n\nNumber of Repeats: 3\n\nRecovery: 20 sec rest\n\n​\n\n**Activation**\n\nNumber of sets: 2\n\nInterval: 150m @ RPE 5 -- Z3 as: 50m Kick, 50m Pull, 50m Swim\n\nRecovery: 30s rest\n\n​\n\n**Main Set**\n\nNumber of Sets: 2\n\nInterval 1: 50m as: 15m Polo Swim\n\n35m Distance per Stroke drill\n\nNumber of repeats: 10\n\nRecovery: 20 sec rest\n\n- This is drill is great practice for sighting in open water events and amplifies the feel on the front end of the catch. Begin with your head out of the water focusing on reaching out to the front while keeping your elbows high with a strong, tight, fast kick. Complete this drill by executing 6 freestyle strokes with your head out of the water followed by 6 freestyle strokes with your head in the water.\n\nActive Recovery: 50m @ RPE 2 -- Z1, choice of stroke\n\nInterval 2: 100m @ RPE 9 -- Z5\n\nNumber of repeats: 3\n\nRecovery: 15 sec rest\n\nActive recovery: 100m @ RPE 2 -- Z1 choice of stroke\n\n​\n\n**Cool Down**\n\n100-200m @ RPE 2 -- Z1, choice of strokes\n\n​\n\n**Total Distance**\n\n2600m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 53,
                "intensityFactor": 0.8
              },
              "workoutId": "dVn3iTe3ll",
              "contentId": "yY2zkML2ji",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 36,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Model",
              "style": null,
              "compatibility": 100,
              "description": "They say that beauty is in the eye of the beholder. And through the bleeding eyes of Sufferlandrians, what could possibly be more beautiful than the sharp, saw-tooth profile of the workout you see before you? Full of gorgeous, shapely, shimmering blocks of yellow Maximal Aerobic Power (MAP) efforts interspersed with mercifully brief and slightly inadequate recoveries, it\u0027s a real stunner.\n\n​\n\nBut you know what\u0027s even better looking than this alluring workout? You (after you\u0027ve completed the workout, that is). Originally designed by our Head of Sports Science, Neal Henderson, for his professional athletes, The Model is a beautiful portrait of MAP brutality. It\u0027s one of those sessions that you think you can\u0027t finish, but always somehow do. It will leave you breathless, feeling all tingly, a bit confused and lying in a blubbering heap. It\u0027s a look. It will also deliver a nice boost to your fitness that always looks and feels good.\n\n​\n\nA true love letter to the beauty of professional cycling, The Model features a banging soundtrack and thrilling footage from both the men\u0027s and women\u0027s pelotons. With its eclectic design, effects, and graphics, you\u0027ll find yourself unable to tear your eyes away from the action on screen (assuming you can lift them from your stem).\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9844444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 86,
                "intensityFactor": 0.9
              },
              "workoutId": "WQk9TYaUhj",
              "contentId": "NkctG9Onu1",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 36,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "5 min Threshold Brick",
              "style": null,
              "compatibility": 100,
              "description": "Warm-Up  \n  \nBike Session  \n  \n​  \n  \nMain Effort  \n  \nInterval Duration:  \n  \n5 mins  \n  \nInterval Effort:  \n  \n5 minutes @ RPE 6.5-7 --110-100% of RTP --HR 95-100%  \n  \nRecovery:  \n  \nNA  \n  \n​  \n  \nExtra Volume:  \n  \nNA  \n  \n  \nCool Down:  \n  \n10 min @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% 5 min @ RPE \u003C 2 -- \u003E 145% of RTP -- HR \u003C 70%  \n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": null,
                "intensityFactor": null
              },
              "workoutId": "",
              "contentId": "YnpveiWDEN",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 37,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "1800 Pyramid",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n200m stroke of choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 1\n\nInterval Distance and Effort: 200m Kick @ RPE 3-4 -- Z2\n\nRecovery: 30 sec rest\n\n**Activation 2**\n\nNumber of Sets: 4\n\nInterval Distance and Effort: 75m Increasing from RPE 5-- Z3 to RPE 7 -- Z4a over entire distance\n\nRecovery: 20 sec rest\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nInterval Effort for all: RPE 7 -- Z4a\n\nIntervals Per set:\n\n50m w/ 15sec rest\n\n100m w/ 20sec rest\n\n150m w/ 25sec rest\n\n200m w/ 30sec rest\n\n250m w/ 40sec rest\n\n300m w/ 60sec rest\n\n250m w/ 40sec rest\n\n200m w/ 30sec rest\n\n150m w/ 25sec rest\n\n100m w/ 20sec rest\n\n50m w/ 15sec rest\n\nNote: Aim to hold a slightly higher pace for all efforts in the second half of the set\n\n​\n\n**Extra Volume**\n\n4 x (25m @ RPE 10 -- Z6 w/ 30 sec rest)\n\nPull 300m @ RPE 5 -- Z3\n\n​\n\n**Cool Down**\n\n200m stroke of choice @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n3100m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 81,
                "intensityFactor": 0.9
              },
              "workoutId": "02d8ACYUDY",
              "contentId": "j4FY0lV8Cm",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 38,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 1",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.42527777777777775,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "SxPJhao9ey",
              "contentId": "pbFOwRxEMY",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 38,
          "type": null,
          "rank": 1000,
          "prospects": [
            {
              "type": null,
              "name": "3 x 1K / 1 x 3K",
              "style": null,
              "compatibility": 100,
              "description": null,
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": null,
                "intensityFactor": null
              },
              "workoutId": "LJIs9FIsoY",
              "contentId": "80MbbnwEdY",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 39,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "25s Increasing to 1000",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n200m @ RPE 2-3 -- Z2, breathing every 3, 5 and 7 strokes\n\nRecovery: 20 sec rest\n\n​\n\n**Activation**\n\n2 x 150m as 50m Kick, 50m Pull, 50m swim @ RPE 3-4 -- Z2\n\nRecovery: 20 sec rest\n\n​\n\n**Main Set**\n\n- Think- Long, Strong and Perfect\n\n4 x 25m swim @ RPE 10 -- Z6\n\nRecovery: 30 sec rest\n\n2 x 50m swim @ RPE 9 -- Z5\n\nRecovery: 40 sec rest\n\n2 x 100m @ RPE 7.5 -- Z4a\n\nRecovery: 50 sec rest\n\n2 x 200m Pull @ RPE 5-6 -- Z3\n\nRecovery: 1 min rest\n\n400m swim with Flippers @ RPE 5-6 -- Z3\n\nRecovery: 1.5 min rest\n\n800m @ RPE 7 -- Z4a\n\nRecovery: 2 min rest\n\n1000m with Flippers on as: alternating 100 Pull, 100 swim with Flippers @ RPE 3-4 -- Z2 \\*Focus on driving the stroke from the hips!\n\nRecovery: 2.5 min rest\n\n​\n\n**Cool Down**\n\n200m @ RPE 2 -- Z1, choice of strokes\n\n​\n\n**Total Distance**\n\n3300m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.1666666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 84,
                "intensityFactor": 0.85
              },
              "workoutId": "FCFPPiqy85",
              "contentId": "A0D1Kw2s1w",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 40,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Surges: 3 x 9",
              "style": null,
              "compatibility": 100,
              "description": "While some of you will know this intensity level as \u0022Sweet-Spot\u0022, we prefer the name Sub-Threshold, because we want to drive home the fact that you should keep your power below FTP. In the same way that longer Tempo efforts can feel \u0022easy,\u0022 these shorter Sub-Threshold efforts can also feel \u0022easy\u0022. After all, if you can hold 100% of FTP for about an hour, then holding less than that for 5-minutes should be a piece of cake right? We know you can go harder for 5-minutes, but that is not what we are asking for.\nThis session is not intended to push you to your limits, nor is it designed to be a massive training load. The real purpose is to essentially keep your fatigue levels right where they are, by giving your body just enough intensity to ensure that you are not \u0022more recovered\u0022 after today.\nWhile some folks will say that there is no training benefit to such short Sub-Threshold efforts, when viewed in a bigger picture sense (like a 3-week training block) they can be the perfect efforts to ensure you get the most out of a longer training block.\nWe would even ask that you view this session as more of an assessment, rather than strictly a workout. That\u0027s because you should be comparing this power output to heart rate response and your own internal RPE. When you have heavy fatigue, your heart rate will struggle to hit its normal peaks. When fresh you would be getting into Z4 heart rate by the end of the last two intervals, and your RPE should never really climb above a 7. When holding onto excess fatigue, your heart rate won\u0027t climb above Z3, and your RPE will be above an 8. At the same time, if you have gained a significant amount of fitness, your Heart Rate will stay in Z3, and your RPE won\u0027t climb above 6. The secondary tell between improved fitness and fatigue is how quickly your heart rate drops after each effort. When fatigued, your heart rate won\u0027t drop below Z2 during the recovery.\nWhile it is easy to rely solely on Power, you should always refer back to RPE and Heart Rate, and today is the perfect session to practice comparing the 3.\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C95%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest Between Sets: 10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\nInterval Repeats per Set: 3\n\n**Interval**\n\nSurge: 30 sec @ RPE 8.5 -- 90% of MAP (105-130% of FTP)\n\nSteady: 2 minutes 30 seconds @ RPE 7 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n30 minutes @ RPE 3 -- 60% of FTP -- HR \u003C85%\n\n​\n\n**Cool Down**\n\n8 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 98,
                "intensityFactor": 0.7
              },
              "workoutId": "kt5fPn4lAN",
              "contentId": "lgDIJtwAYG",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 40,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 45",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up:**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 40 minutes\n\nInterval Effort: RPE 3-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down:**\n\n5 min @ RPE 1-2 -- \u003E145% of RTP -- HR \u003C 70% (Z1\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 32,
                "intensityFactor": 0.65
              },
              "workoutId": "",
              "contentId": "iiIkWWVfB0",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 41,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 60 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "zddJD9fu8z",
              "contentId": "WEhIpACFzU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 42,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique C",
              "style": null,
              "compatibility": 100,
              "description": "In case you need to brush up on your swimming [technique definitions or drills](https://wahoosystm.com/HelpCenterSwimDrills).\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\nGood swimming technique is the key to efficient swimming. Today\u0027s session is a low intensity workout that challenges you with a series of drills designed to reinforce proper technique that will make you a more efficient, powerful and faster swimmer.\n\n​\n\n**Warm-Up**\n\n200m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval Distance: 25m Drill of your choice\n\nThe goal of a Drill set is not to swim at any given pace, but instead focus on proper form. Choose a drill or focus on one of these key points for each 25m interval:\n\n- \\*Body position- swim on horizontal plane\n- \\*Enter in front of shoulder- preventing cross over\n- \\*Breathe early- prevent wide stroke- elbow is always widest point\n- \\*Elbow is always the highest point of the stroke\n- \\*Back of hand always faces direction of travel\n- \\*Fingers to point at the bottom of pool\n- \\*Initiate your stroke from the hips\n\nRecovery: 10-sec rest\n\n​\n\n**Activation 2**\n\nNumber of Sets: 1\n\nInterval Distance: 100m kick @ RPE 3-4 -- Z2\n\n- This drill requires you to only use your legs for propulsion. Face the sky with your arms extended above your head, biceps squeezing your ears. Kick from the hips with straight legs, toes just breaking the surface of the water. When you see the flags above your head, flip onto your belly so you don\u0027t hit the wall. Make note if there are no flags at your pool before doing this drill so you can look for another sign that the wall is near.\n\nRecovery: 20-sec rest\n\n​\n\n**Activation 3**\n\nNumber of Sets: 1\n\nInterval Distance: 100m Pull @ RPE 3-4 -- Z2\n\n- This set eliminates the use of your legs to focus on your catch and pull. Squeeze a pull buoy between your legs to keep your hips afloat and body in the correct orientation.\n- While the back of the hand always faces the direction of travel and the elbow remains the highest point of the stroke, your leading hand spears the water and the Catch phase is initiated by obtaining a grasp on the water while reaching forward. This first phase is not about producing power, rather, it sets you up for the Pull and Push Phases. Imagine pulling yourself over a barrel. Hold as much water as possible while pulling, then pushing the water back to your thigh keeping the hand on the inside on the elbow. Your stroke should accelerate as you progress through the Pull and Push Phases. There is a subtle S formation that occurs during the phases, starting with the Pull Phase just above the shoulder and continuing through the Push Phase until your hand exits the water to begin the recovery phase. Always imagine a line dividing your body lengthwise, with your left arm staying on the left side and your right arm staying on the right side. Crossover will result in additional drag and unwanted sway in the lower body.\n\nRecovery: 20-sec rest\n\n​\n\n**Main Set**\n\nComplete at least six of the drills that you struggle the most with. Aim for 150-200m of each one. The only way to get better is to work on your weaknesses! So be honest with yourself and pick the drills you have the hardest time with.\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C 2 -- Z1\n\n​\n\n**Total Distance**\n\n2000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 19,
                "intensityFactor": 0.5
              },
              "workoutId": "q9IFGbUPp4",
              "contentId": "Uq1DR3Zohq",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 43,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 15 mins\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\nExtra Volume:NA\n\n​\n\n**Cool Down**\n\nNA (This is a steady Z2 run immediately after your bike session. Use this as an opportunity to practice your second transition!)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 9,
                "intensityFactor": 0.6
              },
              "workoutId": "HE2K3d4eew",
              "contentId": "aw9CrLNISP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 43,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "AC: 6 x 45s",
              "style": null,
              "compatibility": 100,
              "description": "There\u0027s no getting around the fact that this is a profoundly unpleasant session that will leave your legs feeling like jelly. This session is similar to The Trick, with a few differences. On the plus side, all of the efforts are 15-seconds shorter than those in The Trick. To make up for this, we added two more intervals to this session, bringing the total to 6. That means by the end of this session you will have plowed through 4.5-minutes of AC work.\n\nThis workout is one of the few sessions that we do NOT recommend you complete in ERG mode if you are on a smart trainer. The goal is to hold onto the highest power you can for the full 45-seconds. Inevitably in the later sets, your power will dip before you reach the end of the interval. What we want is for you to complete every effort having given everything for 45-seconds. We don\u0027t want ERG mode grinding you to a halt because you cannot maintain the (ridiculously) high power targets. Even if you drop down below FTP in the final 10-seconds of these efforts, as long as you are going flat out, you are doing it correctly.\n\nJust take this session one interval at a time, and focus on giving your all for this one effort. You can worry about the others when you get to them. If you finish this session without swearing, then you didn\u0027t go hard enough!\n\n​\n\n**Warm Up**\n\n1 minute 30 seconds @ RPE -- 50% of FTP -- HR \u003C70\n\n1 minute 15 seconds @ RPE 2.5 -- 55% of FTP -- HR \u003C70\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C70\n\n30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70\n\n30 seconds @ RPE 4.5 -- 75% of FTP -- HR \u003C70\n\n30 seconds @ RPE 3 -- 60% of FTP -- HR \u003C70\n\n30 seconds @ RPE 6.5 -- 90% of FTP -- HR \u003C70\n\n30 seconds @ RPE 4 -- 70% of FTP -- HR \u003C70\n\n45 seconds @ RPE 7.5 -- 100% of FTP -- HR \u003C90\n\n30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70\n\n15 seconds @ RPE 9 -- 120% of FTP -- HR \u003E105\n\n45 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70\n\n15 seconds @ RPE 10 -- 200% of FTP -- HR \u003E105\n\n1 minute 30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70\n\n​\n\n**Main Effort**\n\nNumber of Sets: 6\n\nRest Between Sets: 5 minutes 15 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70\n\nInterval Repeats Per Set: N/A\n\n**Interval**\n\nEffort: 45 seconds @ RPE 9.5 -- 150% of FTP -- HR \u003E105\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n4 minutes @ RPE 1.5 -- 45% of FTP -- HR \u003C70\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 2,
                  "map": 2,
                  "ftp": 1
                },
                "tss": 61,
                "intensityFactor": 0.9
              },
              "workoutId": "rLJWul8fjz",
              "contentId": "lsGTR48cBt",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 44,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "7 x 300",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n300m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation**\n\nNumber of Sets: 1\n\nInterval Distance: 300m Kick @ RPE 5 -- Z3\n\nRecovery: 45 seconds rest\n\nInterval Distance: 300m Pull @ RPE 5 -- Z3\n\nRecovery: 60 seconds rest\n\n​\n\n**Main Effort**\n\n**Effort 1**\n\nNumber of Sets: 2\n\nInterval Distance and Effort: 150m @ RPE 7 -- Z4a\n\nRecovery: 20 seconds rest\n\n**Effort 2**\n\nNumber of Sets: 3\n\nInterval Distance and Effort: 100m @ RPE 7.5 -- Z4b\n\nRecovery: 15 seconds rest\n\n**Effort 3**\n\nNumber of Sets: 1\n\n300m @ RPE 6 -- Z3\n\nRecovery: 60 seconds rest\n\n**Effort 4**\n\nNumber of Sets: 3\n\nInterval Distance and Effort: 100m @ RPE 7.5 -- Z4b\n\nRecovery: 30 seconds rest\n\n**Effort 5**\n\nNumber of Sets: 6\n\nInterval Distance and Effort: 50m @ RPE 7.5 -- Z4b to RPE 9.5 -- Z5\n\nRecovery: 20 seconds rest\n\n**Effort 6**\n\nNumber of Sets: 1\n\nInterval Distance and Effort: 300m Pull @ RPE 6 -- Z3\n\nRecovery: 60 seconds rest\n\n**Effort 7**\n\nNumber of Sets: 1\n\nInterval Distance and Effort: 300m @ RPE 7 -- Z4a\n\n​\n\n**Cool Down**\n\n300m stroke of your choice @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n3300m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0833333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 78,
                "intensityFactor": 0.85
              },
              "workoutId": "Xbr0rv88oX",
              "contentId": "1HOLjfdUZf",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 45,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 2",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4072222222222222,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "MGb1NCbPVj",
              "contentId": "saI89XPgSw",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 45,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "5 x 1000",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm up**\n\n10 minutes @ RPE 2-4 (Z1-Z2)\n\n​\n\n**Activation 1 10-second accelerations**\n\nNumber of Sets: 3\n\nRest Between Sets: 30s\n\nInterval Effort: Build from 145% of RTP to 100% RTP (Z2-Z4b)\n\n​\n\n**Main Effort**\n\nNumber of Sets: 5\n\nRest Between Sets: 4 minutes\n\nInterval Distance: 1000m\n\nInterval Effort: RPE 9-10 --\u003C85% of RTP --HR NA (Z5)\n\nRecovery: RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\n​\n\n**Cool down**\n\n5-10 minutes @ RPE 2 -- \u003E145% of RTP -- \u003C70% of RTHR (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 3,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 68,
                "intensityFactor": 0.9
              },
              "workoutId": "A2wZ1t6ZgR",
              "contentId": "3v4NpBsCrw",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 46,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Distance set at race pace",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warmup**\n\n200m @ RPE 3 -- Z2\n\n​\n\n**Activation**\n\n4 x 50m build RPE 3 -- Z2 to RPE 7 -- Z4a\n\nRecovery: 15s rest\n\n​\n\n**Main Effort**\n\n4 x 50m @ RPE 10 -- Z6\n\nRecovery: 20s rest\n\n500 free @ RPE 7 -- Z4a\n\nRecovery: 50m pull w/buoy @ RPE 2 -- Z1\n\n400m @ RPE 7 -- Z4a\n\nRecovery: 50m pull w/buoy @ RPE 2 -- Z1\n\n300m @ RPE 7 -- Z4a\n\nRecovery: 50m pull w/buoy @ RPE 2 -- Z1\n\n400m @ RPE 7 -- Z4a\n\nRecovery: 50m pull w/buoy @ RPE 2 -- Z1\n\n500m @ RPE 7 -- Z4a\n\nRecovery: 50m pull w/buoy @ RPE 2 -- Z1\n\n​\n\n**Cool down**\n\n150m choice of strokes @ RPE 4 -- Z2 slowing to RPE 1 -- Z1\n\n​\n\n**Total Distance**\n\n3250m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 72,
                "intensityFactor": 0.85
              },
              "workoutId": "fo6dH3NbNC",
              "contentId": "sz2lB8VF87",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 47,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Progressive Brick 35",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 35 minutes\n\nInterval Effort: Building RPE 2-6 -- 145-110% of RTP --HR 70-95% (Z1-Z3)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\n5 min @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 0,
                "intensityFactor": 0
              },
              "workoutId": "F6ryHJx7xG",
              "contentId": "4vVUZzn0CF",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 47,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Surges: 3 x 12",
              "style": null,
              "compatibility": 100,
              "description": "Yep, there are good chunks of sub-threshold in here. But what makes this session special are the surges above threshold during each effort. Your body\u0027s ability to clear metabolites and process oxygen doesn\u0027t really change at 90% of FTP and above. What that means it that whether you are at 90% or 100% of FTP your body is clearing those things out at the same rate. It\u0027s just that at FTP your body is producing more of those metabolites that it is capable of clearing.\n\n​\n\nBy surging above FTP you are creating metabolites faster than your body can clear them. If you were to settle into 100% of FTP, you would only be clearing things out at the rate you are producing them. That means whatever you have produced from that surge will just stay there. By dropping just below FTP your body is clearing things out faster than you are producing them. That means that the excess you got from that surge will slowly be cleared out.\n\n​\n\nEach time a surge pops up during this workout, your body should have just about cleared what was made from the last surge. Not only does this push your body\u0027s ability to clear these things to the max, but it also teaches your mind to deal with the discomfort of burning lungs and legs associated with these efforts at or above threshold.\n\n​\n\nA simpler way to think of this is that you are teaching your body and mind to \u0022recover\u0022 just below FTP. Not only does this help bump up your FTP, but it also helps you recover that much faster anytime you let off the gas, whether for a downhill, turn, or finding a good draft. Having the confidence that you can recover while feeling so uncomfortable can mean the difference between hanging onto to a new personal best and completely throwing in the towel.\n\n​\n\nThis is the perfect session to practice your positive thinking from the Mental Toughness Program (If you haven\u0027t checked that out already you definitely should!).\n\n​\n\n**Warm Up**\n\n20 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 5.5 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest between sets: 10 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval repeats per set: 3\n\n​\n\n**Interval**\n\nWork: 30 seconds @ RPE 8.5 -- 120% of FTP -- HR \u003E105%\n\nSteady: 2 minutes 30 seconds @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n25 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down**\n\n7 minutes @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 141,
                "intensityFactor": 0.75
              },
              "workoutId": "GPNxrIyCmI",
              "contentId": "QKORqWbc36",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 48,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "5K Tempo",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% \r\n\r\nActivation 1\r\nDrills of choice: butt kicks, high knees\r\nNumber of Sets\r\n2 each\r\nRest Between Sets \r\n30s\r\nInterval Distance:\r\n50m each\r\n\r\nActivation 2\r\nNumber of Sets\r\n2\r\nRest Between Sets \r\n30s\r\nInterval Distance:\r\n100m \r\nInterval Effort: \r\nGradual build @ RPE 3-8 --145-92% of RTP --HR 70-105%\r\n\r\nMain Effort 1\r\nNumber of Sets\r\n1\r\nRest Between Sets \r\nNA\r\nInterval Distance Per set\r\n5k\r\nInterval Effort: \r\nRPE 5-6 --120-110% of RTP --HR 87-95%\r\nRecovery: \r\nNA\r\n\r\nExtra Volume \r\nNA\r\n\r\nCool Down \r\n5-10 minutes @ RPE 2 -- 145% of FTP -- HR \u003C70%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "The length of this run will be specified in the Weekly Overview section, but the format and goals of the plan remain the same regardless of the distance required. The goal of this run is not to run as fast as you can for the duration of the main set, but to find a steady running rhythm that you could comfortably hold for an hour or more. \r\n\r\nThe warm up includes strides, high knees and butt kick drills so make sure you review those prior to starting your run. Choose a flat track or running course, grab your heart rate monitor and timepiece and you’re ready for your tempo run!",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 50,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Full Circle",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2021): From filmmaker / ultra-endurance cyclist Mike Cotty:\n\n​\n\n\u0022For many of us, cycling serves as a means of self-exploration—bridging gaps between the past, present and future. The blend between mind and body, working together to overcome hard moments—be it physical, mental or emotional—and how we learn to cope in our own mind is essential in being able to process the past, be true to ourselves in the present, and create moments of inner peace in the future.\n\n​\n\nA decade after crossing the French Pyrénées non-stop on a ride that would act as a catalyst for change, I wanted to share this story for the first time. To give an insight into the deeper meaning behind some of the mountain challenges you may have seen me undertake over the years, I felt now was the time to head back to my mountains, return to source, and embrace the unknown.\n\n​\n\nOvercoming the mountains of our mind, from escapism to reconnection. 10 years, 10 cols and 10,000 meters of climbing. This is my story of going Full Circle.\n\n​\n\nThank you for watching. I truly hope there is something in this video that can help you in your own journey.\n\n​\n\nPeace,\n\nMike Cotty\u0022\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session, which is a very low-intensity ride. It\u0027s so easy that your power remains at or below 50% of FTP or an RPE less than 2.5, and your heart rate stays in zone 1 the entire time. The intensity and cadence targets will vary throughout this session to keep it interesting (But not so interesting that you can\u0027t pay attention to the film).\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3675,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 8,
                "intensityFactor": 0.48
              },
              "workoutId": "UqXDIVqe0v",
              "contentId": "BXI1FC1oHr",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 50,
          "type": "Running",
          "rank": 203,
          "prospects": [
            {
              "type": "Running",
              "name": "Strides \u0026 Drills",
              "style": null,
              "compatibility": 100,
              "description": "Warm-up: Start off with 5 minutes of easy jogging/walking.\r\n\r\n\r\nHigh Knees: 2-3 sets of 75m high knees. Easy jog/walk for 30-60 seconds between.\r\n\r\n\r\nButt Kicks: 2-3 sets of 100m butt kicks. Easy jog/walk for 30-60 seconds between.\r\n\r\n\r\nSkipping: 3-4 sets of 50m skipping. Easy jog/walk for 30-60 seconds between.\r\n\r\n\r\nCarioka: 4 sets of 30m Carioka in each direction (8 total). Rest for 20 seconds between direction changes (at your discretion). \r\n\r\n\r\nStrides: 2-3 sets of 60m; Gradually build effort from RPE 3-8. Easy jog/walk for 30-60 seconds between.\r\n\r\n\r\nHigh Knees \u002B Butt Kicks: Finish these drills with one set each of 50m high knees and butt kicks.\r\n\r\n\r\nCool-down: Walk or jog for 5 minutes to cool down.\r\n\r\n\r\nBrush up on your running [drills](http://thesuf.com/HCtechrun)",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This is a technique focused session designed to develop your agility, stability, range of motion and foot speed. There is no focus of heart rate zones so you may choose to leave your monitor at home for these sessions. Between sets of each drill you should easy jog/walk to fully recover between the efforts. While these efforts shouldn’t be too taxing on you, the key is perfect form, so you want to be hitting each one rested enough that you can maintain great form for the duration. You should take a bit of extra rest between techniques, again to ensure you are rested and can nail the form. Before starting the workout, familiarise yourself with the format for high knees, butt kicks, skipping, Carioka and strides. Find a flat track, field or 50-100m of open space (football and soccer fields are great for this).",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 51,
          "type": "Swimming",
          "rank": 100,
          "prospects": [
            {
              "type": "Swimming",
              "name": "30 min Continuous Swim",
              "style": null,
              "compatibility": 100,
              "description": "Swim continuously in the pool for 30 minutes or 1000-1600m. Practice sighting without stopping and use the pace clock or a watch to monitor your pace throughout the swim.\n\n​\n\nCount strokes every 4-6 lengths to make sure you are staying consistent.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Total Distance**\n\n1600m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 13,
                "intensityFactor": 0.5
              },
              "workoutId": "UlnkBzz75P",
              "contentId": "uHwHFHsbKX",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 52,
          "type": "Running",
          "rank": 200,
          "prospects": [
            {
              "type": "Running",
              "name": "Recovery Run",
              "style": null,
              "compatibility": 100,
              "description": "This is as easy as easy gets.\n\nYou should hardly be going fast enough to consider this a jog.\n\nYou want to focus on taking very short strides but keeping your stride rate at least 80 steps per minute.\n\nYou should be embarrassed to be seen going this slowly!\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up **NA\n\n​\n\n**Main Effort** \n\nNumber of Sets 1 \n\nRest Between Sets: NA \n\nInterval Repeats Per Set NA \n\nInterval Effort: 20 minutes @ RPE 1-3 -- 165-140% of RTP -- HR \u003C70% (Z1) \n\nRecovery: NA\n\n​\n\n**Extra Volume** NA\n\n​\n\n**Cool Down** NA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 1,
                "intensityFactor": 0.2
              },
              "workoutId": "NSFBYpA28h",
              "contentId": "ixGIERsp4a",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 53,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Primers",
              "style": null,
              "compatibility": 100,
              "description": "Whether you have a 4DP® fitness test coming up, a group ride you want to smash, that event you have been training all winter for, or even just a fun route you want to have a great ride on, this is the perfect session to do the day before. Unlike other SYSTM sessions, this one should not be viewed as a stand-alone “training” session, but rather, the ace up your sleeve you pull out when that big ride comes around. The key to this session is having you spend just enough time right around threshold, with sufficient recovery between efforts and a handful of sprints to prime all of your systems for tomorrow\u0027s event.  \n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7252777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 42,
                "intensityFactor": 0.76
              },
              "workoutId": "ZH40tnQwpo",
              "contentId": "J4Qiw1pvbL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 54,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Half Monty (Ramp Test)",
              "style": null,
              "compatibility": 100,
              "description": "**Half Monty: The Easy One.**\n\n​\n\nWe recommend this fitness test for:\n\n- Newer riders\n- Athletes with limited experience pacing maximal efforts / fitness testing.\n- Those who are mid-plan or who just want to get a sense of where their fitness is.\n\nThe _Half Monty_ 4DP fitness test is the most accurate and complete ramp test available. While it\u0027s not as comprehensive or as accurate as our main fitness test, _Full Frontal_, it\u0027s far more approachable and easier to pace for new riders. It also doesn\u0027t require any special preparation. You just need to feel relatively fresh.\n\n​\n\nBased on more than a year of research (and after dozens of lab tests and thousands of online tests) and using sophisticated analysis of power and heart rate data, _Half Monty_ is far more accurate and comprehensive than standard ramp tests.\n\n​\n\nIt also tells you more about who you are as an athlete. _Half Monty_ provides you with your FTP, Maximal Aerobic Power (MAP), and Cycling Threshold Heart Rate (cTHR), all of which we use to personalize your workout targets.\n\n​\n\nIf you\u0027re still using the 4DP estimates when you set up your account, _Half Monty_ will also refine your AC and NM estimates (but will not do so if you\u0027ve done _Full Frontal_ or manually adjusted your estimates). If you want fully accurate AC and NM, as well as your Rider Type, Strengths, Weaknesses, and training plans adjusted to those Strengths and Weaknesses, you\u0027ll need to expose yourself to the _Full Frontal_ 4DP fitness test.\n\n​\n\nReady to climb the ramp? You\u0027ll need the following before you start:\n\n- A heart rate monitor if you want the most accurate results. Don\u0027t have one? Order one [HERE](https://wahoofitness.com/devices)\n- Some kind of power device connected (trainer, power meter, virtual power, etc.)\n- Be ready to pay close attention to the instructions in the workout\n- Be sure your profile is complete and up-to-date (Profile \u003E About You). Accurate information helps us make our calculations\n\n**LEARN MORE**\n\nListen to \u0027[Why Fitness Testing Matters](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/testing-testing-1-2-3-why-fitness-testing-matters)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n\n​\n\n[Here\u0027s some more information on how to get the most from your fitness test.](https://wahoosystm.com/HelpCenterFitnessAssessment)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9666666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 5,
                  "ftp": 3
                },
                "tss": 71,
                "intensityFactor": 0.85
              },
              "workoutId": "0SmbqUIZZo",
              "contentId": "OIJSfIrGTL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 54,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Short endurance brick",
              "style": null,
              "compatibility": 100,
              "description": "This is a short, simple workout that can be used frequently by triathletes training for any level or distance event to give your running volume a bump without adding much overall stress. It\u0027s also a great way to practice the bike to run transition and develop aerobic and muscular endurance.\n\n​\n\nThis is a NoVid workout; if you have a treadmill, play this workout in the app and enjoy the guided workout as you would a cycling NoVid! Just turn off or ignore the power targets or any others that don\u0027t pertain to running.\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Main Effort**\n\n15 minute @ RPE 5 -- 80% of RTP -- HR \u003C80%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 16,
                "intensityFactor": 0.79
              },
              "workoutId": "FdTydT1jBm",
              "contentId": "4wDYXHEm3l",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 55,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "3 x (8 x 25m)",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\nNumber of Sets: 1\n\nNumber of Repeats: 6 x 100m @ RPE 3-4-- Z2, Focusing on distance per stroke\n\n20 sec rest\n\n​\n\n**Activation**\n\nNumber of sets: 1\n\nNumber of Repeats: 8\n\nInterval: 50m @ RPE 3-4 -- Z2 as 25m Side-Glide-Kick drill \u002B 25m swim\n\nRecovery: 20 sec rest\n\n- Push off the wall on your side and kick for eight kicks. Keep your ear on your arm and your body straight. Make sure your knees are passing one another when you kick. Eight strokes and then take a good pull with the arm up top. Use this pull to roll you to the other side and repeat the cycle. For variation do this drill with three strokes in between. I.e. on right side with right arm up and left arm at your side. Take a pull with the right, left and right. End with your left arm up and your right arm at your side. This will help improve your body position in the water and if you keep your head on your arm when you are on your side it will help your head position when you breathe.\n\n**Main Set**\n\nNumber of Sets: 3\n\nInterval 1: 8 x 25m @ RPE 9 -- Z5\n\nRecovery: 15 sec rest\n\nInterval 2: (Between each set of 25\u0027s) 100m backstroke or breaststroke @ RPE 2 -- Z1\n\n​\n\n**Cool Down**\n\n200m @ RPE 2 -- Z1, choice of strokes\n\n​\n\n**Total Distance**\n\n1900m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 48,
                "intensityFactor": 0.8
              },
              "workoutId": "WvQoEUwSsW",
              "contentId": "VrhLVXBNYV",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 56,
          "type": "Swimming",
          "rank": 200,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique C",
              "style": null,
              "compatibility": 100,
              "description": "Brush up on your [technique definitions or drills](http://thesuf.com/HCtechswim)\r\n\r\nWarm Up\r\n200m stroke of your choice @ RPE 2\r\n\r\nActivation 1\r\nNumber of Sets:\r\n4 \r\nInterval Distance:\r\n25m Drill\r\nRecovery:\r\n10 seconds rest\r\n \r\nActivation 2\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n100m kick\r\nRecovery:\r\n20 seconds rest\r\n\r\nActivation 3\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n100m Pull\r\nRecovery:\r\n20 seconds rest\r\n\r\nMain Set\r\nComplete at least six of the drills that you struggle the most with. Aim for 150-200m of each one. The only way to get better is to work on your weaknesses! So be honest with yourself and pick the drills you have the hardest time with.\r\n  \r\nCool Down \r\n200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4166666666666667,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Good swimming technique is the key to efficient swimming.  Today is about improving your technique by challenging you with a series of drills and specific moves.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 57,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 3",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.41694444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "W8oOfGcDMU",
              "contentId": "VeuEp2qpp3",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 58,
          "type": "Swimming",
          "rank": 201,
          "prospects": [
            {
              "type": "Swimming",
              "name": "6 x 300",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n300m stroke of your choice @ RPE 2\r\n\r\nActivation \r\nNumber of Sets: \r\n1\r\nInterval Distance \r\n300m Kick\r\nRecovery:\r\n45 seconds rest\r\nInterval Distance \r\n300m Pull\r\nRecovery\r\n60 seconds rest\r\n\r\nMain Effort\r\nNumber of Sets:\r\n2\r\nInterval Distance and Effort\r\n150m @ RPE 7\r\nRecovery:\r\n20 seconds rest \r\n\r\nNumber of Sets:\r\n3 \r\nInterval Distance and Effort\r\n100m @ RPE 7\r\nRecovery:\r\n15 seconds rest\r\n\r\nNumber of Sets:\r\n1\r\nInterval Distance and Effort\r\n300m @ RPE 6\r\nRecovery:\r\n60 seconds rest\r\n\r\nNumber of Sets:\r\n3 \r\nInterval Distance and Effort\r\n100m @ RPE 7\r\nRecovery\r\n30 seconds rest\r\n\r\nNumber of Sets:\r\n6 \r\nInterval Distance and Effort\r\n50m @ RPE 7.5-9.5\r\nRecovery\r\n20 seconds rest\r\n\r\nNumber of Sets:\r\n1\r\nInterval Distance and Effort\r\n300m @ RPE 7\r\n\r\nCool Down \r\n 300m stroke of your choice @ RPE \u003C2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This swim is designed to work your ability to swim efficiently through multiple distances and with variable rest rates. The pyramid is a great way of getting in a lot of swim distance. You\u0027ll need to finish pretty hard, so make sure you keep some gas in the tank for the last few sets.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 59,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Phil wins the Tour",
              "style": null,
              "compatibility": 100,
              "description": "Join Phil Gaimon in his bid to “win the Tour” as he takes on France’s most iconic mountains—The Tourmalet, Mont Ventoux, Alpe d’Huez and Galibier. This session captures the feel of those legendary ascents with 4 x 10-minute descending threshold intervals. Each one starting above threshold before easing down, forcing you to pace smart, clear the burn, and stay locked in until the summit.\n\n​\n\nBetween climbs, you’ll get some recovery—time to spin the legs and imagine soaking in the views (or raiding a French bakery, Phil-style).\n\n​\n\nPhysiologically, you’ll build muscular endurance, improve your ability to process oxygen, and train your body to go deep without breaking. Mentally, you’ll sharpen pacing skills and resilience—the hallmarks of any great climber.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9830555555555556,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 81,
                "intensityFactor": 0.91
              },
              "workoutId": "BqNqT59BWH",
              "contentId": "wvpZ4nx37B",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 59,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Sub-Threshold Brick Run 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 20 mins\n\nInterval Effort:\n\n5-minute build RPE 2-6 -- 145-110% of RTP --HR 70-95%\n\n15 minutes steady @ RPE 6.5-7 --110-100% of RTP --HR 95-100% Recovery: NA\n\n​\n\n**Extra Volume:**\n\nNA\n\n​\n\n**Cool Down**\n\n10 min @ RPE \u003C 2 -- \u003E 145% of RTP -- HR \u003C 70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 28,
                "intensityFactor": 0.75
              },
              "workoutId": "",
              "contentId": "AwTfTx6EpA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 60,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Race Pace Training- 40 x 50s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n200m stroke of your choice @ RPE 3 -- Z2\n\n​\n\n**Activation**\n\nNumber of Sets: 1\n\nInterval 1: 25m Two Left Two Right, 25m Swim @ RPE 3 --Z2\n\nInterval 2: 25m 3 Count, 3 Stroke Switch, 25m Swim @ RPE 3 -- Z2\n\nInterval 3: 25m Three Quarter Catch Up, 25m Swim @ RPE 3 -- Z2\n\nInterval 4: 25m Shoulder to Cheek, 25m Swim @ RPE 3 -- Z2\n\nInterval 5: 50m Swim @ RPE 3 -- Z2 building to RPE 6.5-7 -- Z4a\n\nInterval 6: 50m Swim @ RPE 3 -- Z2 building to RPE 6.5-7 -- Z4a\n\nRecovery: 10 seconds rest between each\n\nNumber of Sets: 2\n\nInterval 1: 50m Swim @ RPE 5-6 -- Z3\n\nRecovery: 20 seconds rest\n\n​\n\n**Main Effort**\n\nNumber of Sets: 40\n\nNumber of Efforts: 1\n\nInterval 1: 50m Swim @ RPE 7.5-8 -- Z4b\n\nRecovery: 15 seconds rest\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C 2 -- Z1\n\n​\n\n**Total Distance**\n\n2800m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 66,
                "intensityFactor": 0.85
              },
              "workoutId": "",
              "contentId": "XfZQfLVNIq",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 61,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Surges: 4 x 8",
              "style": null,
              "compatibility": 100,
              "description": "While some of you will know this intensity level as \u0022Sweet-Spot\u0022, we prefer the name Sub-Threshold, because we want to drive home the fact that you should keep your power below FTP. In the same way that longer Tempo efforts can feel \u0022easy,\u0022 these shorter Sub-Threshold efforts can also feel \u0022easy\u0022. After all, if you can hold 100% of FTP for about an hour, then holding less than that for 8 minutes should be a piece of cake right? We know you can go harder for this short amount of time, but that is not what we are asking for.\n\n​\n\nThis session is not intended to push you to your limits, nor is it designed to be a massive training load. The real purpose is to essentially keep your fatigue levels right where they are, by giving your body just enough intensity to ensure that you are not \u0022more recovered\u0022 after today.\n\n​\n\nWhile some folks will say that there is no training benefit to such short Sub-Threshold efforts, when viewed in a bigger picture sense (like a 3-week training block) they can be the perfect efforts to ensure you get the most out of a longer training block.\n\n​\n\nWe would even ask that you view this session as more of an assessment, rather than strictly a workout. That\u0027s because you should be comparing this power output to heart rate response and your own internal RPE. When you have heavy fatigue, your heart rate will struggle to hit its normal peaks. When fresh you would be getting into Z4 heart rate by the end of the last two intervals, and your RPE should never really climb above a 7. When holding onto excess fatigue, your heart rate won\u0027t climb above Z3, and your RPE will be above an 8. At the same time, if you have gained a significant amount of fitness, your Heart Rate will stay in Z3, and your RPE won\u0027t climb above 6. The secondary tell between improved fitness and fatigue is how quickly your heart rate drops after each effort. When fatigued, your heart rate won\u0027t drop below Z2 during the recovery.\n\n​\n\nWhile it is easy to rely solely on Power, you should always refer back to RPE and Heart Rate, and today is the perfect session to practice comparing the 3.\n\n​\n\n​\n\n**Warm-Up**\n\n20 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C95%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 4\n\nRest Between Sets: 10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\nInterval Repeats per Set: 4\n\n**Interval**\n\nSurge: 30 sec @ RPE 8.5 -- 90% of MAP (105-130% of FTP)\n\nSteady: 1 minutes 30 seconds @ RPE 7 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n13 minutes @ RPE 3 -- 60% of FTP -- HR \u003C85%\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 2,
                  "ftp": 4
                },
                "tss": 116,
                "intensityFactor": 0.76
              },
              "workoutId": "CsXpw751dP",
              "contentId": "JTtsBUhCO5",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 61,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 35",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up:**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 30 minutes\n\nInterval Effort: RPE 3-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down:**\n\n5 min @ RPE 1-2 -- \u003E145% of RTP -- HR \u003C 70% (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5833333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 21,
                "intensityFactor": 0.6
              },
              "workoutId": "",
              "contentId": "dbPBxzSWHJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 62,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "2 x 5k tempo",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this run is not to run as fast as you can for the duration of the main set but to find a steady running rhythm that you could comfortably hold for an hour or more.\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87%\n\n​\n\n**Activation 1: Drills of choice: butt kicks, high knees**\n\nNumber of Sets: 2 each\n\nRest Between Sets: 30 sec\n\nInterval Distance: 50m each\n\n**Activation 2**\n\nNumber of Sets: 2\n\nRest Between Sets: 30 sec\n\nInterval Distance: 100m\n\nInterval Effort: Gradual build @ RPE 3-8 --145-92% of RTP --HR 70-105%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 2\n\nRest Between Sets: 5 minutes\n\nInterval Distance Per set: 5k\n\nInterval Effort:RPE 5-6 --120-110% of RTP --HR 87-95%\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- 145% of RTP -- HR \u003C70%\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 3,
                  "ftp": 2
                },
                "tss": 70,
                "intensityFactor": 0.75
              },
              "workoutId": "BJSl4h8IUl",
              "contentId": "klJAbixhry",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 62,
          "type": "Swimming",
          "rank": 100,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Open Water Simulation (long)",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n100m stroke of your choice @ RPE 3 -- Z2\n\nRecovery: 15 seconds rest\n\n100m Drill @ RPE 2 -- Z1\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nContinuous swim @ RPE 5-6 -- Z3 for duration of workout as dictated by your training plan.\n\nFocus on alternate side breathing (left and right) and practice your sighting.\n\n​\n\n**Cool Down**\n\n100m @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n3500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 25,
                "intensityFactor": 0.5
              },
              "workoutId": "VuhsK2vyD5",
              "contentId": "TtbKgnSKwH",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 63,
          "type": "Swimming",
          "rank": 201,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Steady Aerobic ",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n100m stroke of your choice @ RPE 2\r\nRecovery:\r\n15 seconds rest\r\n100m Kicking \r\nRecovery:\r\n15 seconds rest\r\n\r\nMain Effort\r\nSteady swim @ RPE 3-4 for duration of workout as specified by your training plan.\r\n \r\nUse pace clock to ensure lap times are remaining consistent    \r\n \r\nCount strokes every 5 laps to ensure consistency    \r\n\r\nPractice your sighting at least once every 100m\r\n\r\n\r\nCool Down \r\n200m Pull @ RPE 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This is an easy, fun and unstructured swim, designed to keep your system ticking over without adding too much fatigue. make it a priority to never go above Z2.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 64,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Blender (Mini Version)",
              "style": null,
              "compatibility": 100,
              "description": "_Mini Blender_ takes all the best parts of the SUF classic _Blender_ and condenses them into a workout that\u0027s less than 60-minutes long. The sustained efforts at the start ensure your Anaerobic Capacity (AC) and Maximal Aerobic Power (MAP) are really put to the test during the two sets of micro-intervals (the dreaded \u0022Pain Shakes\u0022). Just like the regular _Blender_, throwing some shorter threshold efforts your way after those AC and MAP builders means that your FTP doesn’t get left out. A perfect session for those who want to hit lots of improvement areas within an hour.  \n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9058333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 4,
                  "ftp": 4
                },
                "tss": 72,
                "intensityFactor": 0.89
              },
              "workoutId": "J76BUNUCLe",
              "contentId": "i0cPf4mAxq",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 64,
          "type": "Running",
          "rank": 203,
          "prospects": [
            {
              "type": "Running",
              "name": "3 x 1 / 1 x 3",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% \r\n\r\nActivation 1\r\nDrills: butt kicks, high knees, builds, strides\r\nNumber of Sets\r\n2 each\r\nRest Between Sets \r\n30s\r\nInterval Distance:\r\n50m each\r\n\r\nMain Effort 1\r\nNumber of Sets\r\n3\r\nRest Between Sets \r\n3 minutes\r\nInterval Distance Per set\r\n1k \r\nInterval Effort: \r\nZ3- RPE 5-6 --110-100% of RTP --HR 87-95%\r\nZ4- RPE 7-8--110-92% of RTP --HR 95-105%\r\nRecovery: \r\nRPE 1-2 --\u003E145% RTP --HR \u003C70%\r\n\r\nNote: Complete each set a few seconds faster than the last, finishing with your strongest 1K.\r\n\r\nMain Effort 2\r\nNumber of Sets\r\n1\r\nRest Between Sets \r\nNA\r\nInterval Distance Per set\r\n3k \r\nInterval Effort: \r\nRPE 5 --120% of RTP --HR 87%\r\nRecovery: \r\nNA\r\n\r\nExtra Volume \r\nNA\r\n\r\nCool Down \r\n5-10 minutes @ RPE 2 -- 145% of FTP -- HR \u003C70%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Here’s a mixed bag session that focuses on steadier efforts at your tempo pace. We throw in a few drills just to keep you sharp and your legs firing.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 65,
          "type": "Swimming",
          "rank": 202,
          "prospects": [
            {
              "type": "Swimming",
              "name": "7 x 300",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n300m stroke of your choice @ RPE 2\r\n\r\nActivation \r\nNumber of Sets: \r\n1\r\nInterval Distance \r\n300m Kick\r\nRecovery:\r\n45 seconds rest\r\nInterval Distance \r\n300m Pull\r\nRecovery\r\n60 seconds rest\r\n\r\nMain Effort\r\nNumber of Sets:\r\n2\r\nInterval Distance and Effort\r\n150m @ RPE 7\r\nRecovery:\r\n20 seconds rest \r\n\r\nNumber of Sets:\r\n3 \r\nInterval Distance and Effort\r\n100m @ RPE 7\r\nRecovery:\r\n15 seconds rest\r\n\r\nNumber of Sets:\r\n1\r\n300m @ RPE 6\r\nRecovery:\r\n60 seconds rest\r\n\r\nNumber of Sets:\r\n3 \r\nInterval Distance and Effort\r\n100m @ RPE 7\r\nRecovery\r\n30 seconds rest\r\n\r\nNumber of Sets:\r\n6 \r\nInterval Distance and Effort\r\n50m @ RPE 7.5-9.5\r\nRecovery\r\n20 seconds rest\r\n\r\nNumber of Sets:\r\n1\r\nInterval Distance and Effort\r\n300m Pull @ RPE 6\r\nRecovery:\r\n60 seconds rest\r\n\r\nNumber of Sets:\r\n1\r\nInterval Distance and Effort\r\n300m @ RPE 7\r\n\r\nCool Down \r\n 300m stroke of your choice @ RPE \u003C2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0833333333333333,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This swim is designed to work your ability to swim efficiently through multiple distances and with variable rest rates. The pyramid is a great way of getting in a lot of swim distance. You\u0027ll need to finish pretty hard, so make sure you keep some gas in the tank for the last few sets.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 66,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 4",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4261111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "6ITstvyaRu",
              "contentId": "xQ2H675VAR",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 67,
          "type": "Swimming",
          "rank": 202,
          "prospects": [
            {
              "type": "Swimming",
              "name": "20 x 50 Speed",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up\r\n300m stroke of your choice @ RPE 2\r\n\r\nActivation\r\nNumber of Sets: \r\n1 \r\nInterval Distance and Recovery:\r\n200m Kick, 30 seconds rest\r\n300m Pull, 30 seconds rest\r\n50m Drill, 10 seconds rest\r\nInterval Effort:\r\nRPE 2-3\r\n\r\nMain Effort\r\nNumber of Sets: \r\n4 \r\n\r\nInterval #1\r\nNumber of Repeats: \r\n2\r\nInterval Distance:\r\n50m \r\nInterval Effort:\r\nRPE 10\r\nRecovery: \r\n15 seconds\r\n\r\nInterval #2\r\nNumber of repeats:\r\n2\r\nInterval Distance:\r\n50m \r\nInterval Effort:\r\nStarting @ RPE 7\r\nRecovery: \r\n25 seconds\r\n\r\nInterval #3\r\nNumber of repeats:\r\n1\r\nInterval Distance:\r\n50m \r\nInterval Effort:\r\n@ RPE 10\r\nRecovery: \r\n40 seconds\r\n\r\nExtra Volume\r\n400m pull, building from RPE 3-RPE 7 over the entire distance\r\n\r\nCool Down \r\n300m stroke of your choice @ RPE \u003C2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This swim is designed to work your top end speed in the water by getting you to work hard over a short 50m distance, but you\u0027ll have to do it at different levels of rest and fatigue. Unless otherwise indicated, the stroke is freestyle.\r\nMake sure you complete 4 sets of the entire main effort!",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 68,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Surges: 3 x 9",
              "style": null,
              "compatibility": 100,
              "description": "While some of you will know this intensity level as \u0022Sweet-Spot\u0022, we prefer the name Sub-Threshold, because we want to drive home the fact that you should keep your power below FTP. In the same way that longer Tempo efforts can feel \u0022easy,\u0022 these shorter Sub-Threshold efforts can also feel \u0022easy\u0022. After all, if you can hold 100% of FTP for about an hour, then holding less than that for 5-minutes should be a piece of cake right? We know you can go harder for 5-minutes, but that is not what we are asking for.\nThis session is not intended to push you to your limits, nor is it designed to be a massive training load. The real purpose is to essentially keep your fatigue levels right where they are, by giving your body just enough intensity to ensure that you are not \u0022more recovered\u0022 after today.\nWhile some folks will say that there is no training benefit to such short Sub-Threshold efforts, when viewed in a bigger picture sense (like a 3-week training block) they can be the perfect efforts to ensure you get the most out of a longer training block.\nWe would even ask that you view this session as more of an assessment, rather than strictly a workout. That\u0027s because you should be comparing this power output to heart rate response and your own internal RPE. When you have heavy fatigue, your heart rate will struggle to hit its normal peaks. When fresh you would be getting into Z4 heart rate by the end of the last two intervals, and your RPE should never really climb above a 7. When holding onto excess fatigue, your heart rate won\u0027t climb above Z3, and your RPE will be above an 8. At the same time, if you have gained a significant amount of fitness, your Heart Rate will stay in Z3, and your RPE won\u0027t climb above 6. The secondary tell between improved fitness and fatigue is how quickly your heart rate drops after each effort. When fatigued, your heart rate won\u0027t drop below Z2 during the recovery.\nWhile it is easy to rely solely on Power, you should always refer back to RPE and Heart Rate, and today is the perfect session to practice comparing the 3.\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C95%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest Between Sets: 10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\nInterval Repeats per Set: 3\n\n**Interval**\n\nSurge: 30 sec @ RPE 8.5 -- 90% of MAP (105-130% of FTP)\n\nSteady: 2 minutes 30 seconds @ RPE 7 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n30 minutes @ RPE 3 -- 60% of FTP -- HR \u003C85%\n\n​\n\n**Cool Down**\n\n8 minutes @ RPE 1.5 -- \u003C45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 98,
                "intensityFactor": 0.7
              },
              "workoutId": "kt5fPn4lAN",
              "contentId": "lgDIJtwAYG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 68,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Sub-Threshold Brick Run 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm Up**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 20 mins\n\nInterval Effort:\n\n5-minute build RPE 2-6 -- 145-110% of RTP --HR 70-95%\n\n15 minutes steady @ RPE 6.5-7 --110-100% of RTP --HR 95-100% Recovery: NA\n\n​\n\n**Extra Volume:**\n\nNA\n\n​\n\n**Cool Down**\n\n10 min @ RPE \u003C 2 -- \u003E 145% of RTP -- HR \u003C 70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 28,
                "intensityFactor": 0.75
              },
              "workoutId": "",
              "contentId": "AwTfTx6EpA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 71,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 15",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 15 mins\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\nExtra Volume:NA\n\n​\n\n**Cool Down**\n\nNA (This is a steady Z2 run immediately after your bike session. Use this as an opportunity to practice your second transition!)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 9,
                "intensityFactor": 0.6
              },
              "workoutId": "HE2K3d4eew",
              "contentId": "aw9CrLNISP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 71,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Gran Canaria: Serenity",
              "style": null,
              "compatibility": 100,
              "description": "Starting at the islands iconic rainbow rocks at Los Azulejos de Veneguera in this session we tackle one of the most stunning climbs on the whole island, known locally as “Serenity”. We’ll be breaking this 10km climb down into three distinct sections, kicking off with a block of 6 x 50 second high tempo efforts with a 10 second burst out of the saddle before taking a swift breather before getting back on it. As we climb through the pine forest we’ll switch things up a touch, alternating between low and high cadence for 30 seconds at a time for around 7 minutes. We’ll then revert back to our 50 second high tempo with 10 second burst out of the saddle efforts before we build up our effort to the summit. This is going to be a challenging workout so make sure you’re ready and whatever you do don’t forget to take a moment to look at the views!!\n\n​\n\nThis workout combines multiple different interval types that focus on improving threshold power via over-under style efforts along with low cadence work for your muscular endurance. The first and last climbs also fire up your whole energy systems with some sprints to the summit.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/8735613403)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9230555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 2,
                  "map": 3,
                  "ftp": 5
                },
                "tss": 62,
                "intensityFactor": 0.86
              },
              "workoutId": "keD5MA4ABE",
              "contentId": "sXC2D7jqYs",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 72,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Threshold: 5 x 100",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warmup**\n\n400 @ RPE 2 -- Z1\n\nRecovery: 15s rest\n\n300 pull @ RPE 3 -- Z2\n\nRecovery: 15s rest\n\n200 Kick @ RPE 4 -- Z2\n\nRecovery: 15s rest\n\n100 swim @ RPE 5 -- Z3\n\nRecovery: 15s rest\n\n​\n\n**Activation**\n\nNumber of Sets: 4\n\nEffort 1: 50m @ RPE 3 -- Z2: drill 25m \u002B swim 25m\n\nRecovery: 15s rest between each\n\nEffort 2:\n\nNumber of Sets: 4\n\nInterval Distance and Effort: 50m as: 20m @ RPE 3 -- Z2, then 30m build to RPE 8 -- Z4b\n\nRecovery: 15s rest\n\n​\n\n**Main Effort**\n\nNumber of Sets: 5\n\nInterval Distance: 100m\n\nInterval Effort: RPE 7 -- Z4a\n\nRecovery Duration: 20 seconds\n\n​\n\n**Cool down**\n\n300m swim starting @ RPE 5 -- Z3 and slowing to RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2200m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 43,
                "intensityFactor": 0.8
              },
              "workoutId": "AiDcGmLV8c",
              "contentId": "ry4b8BItud",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 73,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "8 x 200m",
              "style": null,
              "compatibility": 100,
              "description": "Make sure you have a level track or field with distance markers and prepare yourself to open the throttle!\n\n​\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 2-4 -- 145-120% of RTP -- HR 70-87% (Z1-Z2)\n\n​\n\n**Activation: Strides**\n\nNumber of Sets 5\n\nRest Between Sets 1 min\n\nInterval Distance 50m build\n\nInterval Effort Gradually increase from RPE 3-8 (Z2-Z4)\n\nRecovery RPE \u003C2 --\u003E145% of RTP -- HR \u003C70% (Z1)\n\n​\n\n**Main Effort**\n\nNumber of Sets 8\n\nRest Between Sets 1 minute\n\nInterval Distance Per set 200m\n\nInterval Effort RPE 9-10 --\u003C85% of RTP --HR NA (Z5)\n\nRecovery RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\nNote: If necessary this can be split into 2 sets of 4 repeats, adding in 5-8 minutes of easy jogging between the 2 sets. The goal here is maximal speed for each and every effort!\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- 145% of RTP -- HR \u003C70% (Z1)\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 3,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 60,
                "intensityFactor": 0.95
              },
              "workoutId": "xgdpSENPXu",
              "contentId": "rY78vUcMwk",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 73,
          "type": "Cycling",
          "rank": 102,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 5",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.475,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 17,
                "intensityFactor": 0.6
              },
              "workoutId": "GWPNRR4Elm",
              "contentId": "wtSHP9TanR",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 74,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Race pace Training- 16 x 50s, 6 x 100s",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n200m stroke of your choice @ RPE 3 -- Z2\n\n​\n\n**Activation**\n\nNumber of Sets: 1\n\nInterval 1: 25m Two Left Two Right, 25m Swim @ RPE 3 --Z2\n\nInterval 2: 25m 3 Count, 3 Stroke Switch, 25m Swim @ RPE 3 -- Z2\n\nInterval 3: 25m Three Quarter Catch Up, 25m Swim @ RPE 3 -- Z2\n\nInterval 4: 25m Shoulder to Cheek, 25m Swim @ RPE 3 -- Z2\n\nInterval 5: 50m Swim @ RPE 3 -- Z2 building to RPE 6.5-7 -- Z4a\n\nInterval 6: 50m Swim @ RPE 3 -- Z2 building to RPE 6.5-7 -- Z4a\n\nRecovery: 10 seconds rest between each\n\nNumber of Sets: 2\n\nInterval 1: 50m Swim @ RPE 5-6 -- Z3\n\nRecovery: 20 seconds rest\n\n​\n\n**Main Effort 1**\n\nNumber of Sets: 16\n\nNumber of Efforts: 1\n\nInterval 1: 50m Swim @ RPE 7.5-8 -- Z4b\n\nRecovery: 10 seconds rest\n\n**Main Effort 2**\n\nNumber of Sets: 6\n\nNumber of Efforts: 1\n\nInterval 1: 100m Swim @ RPE 7.5-8 -- Z4b\n\nRecovery: 15 seconds rest\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C 2 -- Z1\n\n​\n\n**Total Distance**\n\n2200m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 60,
                "intensityFactor": 0.85
              },
              "workoutId": "BKwCmgkuxa",
              "contentId": "iQkoFFfVr9",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 75,
          "type": "OutdoorCycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Standing Starts Into FTP: 4 x 2",
              "style": null,
              "compatibility": 100,
              "description": "Standing starts closely simulates a lifting session on the bike because it requires the engagement of your core, upper, and lower body. It trains your ability to generate force through the pedals by ensuring you recruit ALL of your muscles to get that crank turning. No matter your preferred discipline, these efforts are key to teaching your body to recruit all of the muscle fibers in your legs. The saying “Use it or Lose it” actually does apply here.\n\n​\n\nAll of the benefits in this session come from hitting these 20-second efforts as hard as you possibly can. To do that, you need full recovery between each sprint, and you need to respect that recovery! These efforts should see you start at super low RPMs with very high torque. As you start and increase the effort, your cadence will naturally increase. Your goal is to get your cadence as high as possible by the end of each 20-second effort. To maximize your muscle recruitment, you want to both push down and pull up on the pedals at the start. Proper core engagement is a must - your legs need a good strong backboard to push against.\n\n​\n\nWe understand that not everyone\u0027s trainer has the necessary resistance or the required stability to perform this workout as described. If you can\u0027t safely stand up, then you can get much of the same benefit by doing these efforts seated. If your trainer can’t handle the rapid change in speed or does not have high enough resistance at a super low cadence, then you can start the efforts at a higher cadence and treat them as “normal” all-out sprints.\n\n​\n\n**Warm-Up **\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n2 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C75%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C 80%\n\n6 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort **\n\nNumber of Sets: 1\n\nRest Between Sets: N/A\n\nInterval Repeats per Set: 4\n\n**Interval **\n\nStanding Start: 20 seconds @ RPE 10 --\n\nStarting from standing (or very very very slow rolling) starts in a 53x14 gear. Really focus on pushing and pulling, try to get on top of the gear as quickly as possible\n\nHold: 1 minute 40 seconds @ RPE 7.5 -- 100% of FTP\n\nRecovery: 8 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume **\n\nN/A\n\n​\n\n**Cool Down **\n\n5 minutes @ RPE 1.5 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 49,
                "intensityFactor": 0.73
              },
              "workoutId": "a830uWKLhB",
              "contentId": "MWoSIEuPRN",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 75,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Progressive Brick 20",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up**\n\nBike Session\n\n​\n\n**Main Effort:**\n\nInterval Duration: 20 minutes\n\nInterval Effort: Building RPE 2-6 -- 145-110% of RTP --HR 70-95% (Z1-Z3)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\n5 min @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% (Z2)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4166666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 30,
                "intensityFactor": 0.85
              },
              "workoutId": "ZFH9di6BKa",
              "contentId": "pxDBMixGyX",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 76,
          "type": "Running",
          "rank": 202,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 45",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\nThis is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\nFor help understanding your run workout and calculating your pace zones, please see this article.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 45 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "tvV3J76Z7l",
              "contentId": "yvcdSYNPIG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 77,
          "type": "Swimming",
          "rank": 202,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Progressive Sprints",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n300m stroke of your choice @ RPE 2\r\n\r\nActivation 1\r\nNumber of Sets:\r\n8 \r\nInterval Distance:\r\n50m Drill\r\nRecovery:\r\n10 seconds rest\r\n\r\nNumber of Sets:\r\n4 \r\nInterval Distance:\r\n75m (first 25m @ RPE 2-3, second 25m @ RPE 5-6, final 25m @ RPE 7-8\r\nRecovery:\r\n10 seconds rest \r\n\r\nMain Effort\r\nNumber of Sets:\r\n3\r\nInterval Distance and Effort\r\n25m @ RPE 10 (all out)\r\n  30 seconds rest \r\n25m @ RPE 10 (all out)\r\n  30 seconds rest \r\n25m @ RPE 10 (all out)\r\n  30 seconds rest \r\n25m @ RPE 10 (all out)\r\n  30 seconds rest \r\n50m @ RPE 9\r\n  30 seconds rest\r\n100m @ RPE 8\r\n  45 seconds rest \r\n\r\nCool Down \r\n 200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6666666666666666,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This swim is designed to work your top end speed in the water by getting you to work hard over short distances. You\u0027ll be asked to give it your max effort over 25m, 50m and 100m. Unless otherwise indicated, the stroke is freestyle.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 78,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Recovery Spin",
              "style": null,
              "compatibility": 100,
              "description": "Don’t be afraid of the Two Rs: rest and recovery. Believe it or not, you get faster when your body is taking it easy after all that suffering. A recovery spin is a very low intensity ride, so easy that you’d feel embarrassed to ride so slowly if you didn’t know you were helping your body get so much faster.\n\n​\n\nA good recovery spin is done at a cadence above 90 RPM. While keeping power below 50% of FTP, or an RPE less than 2.5, and keeping your heart rate in Zone 1 the entire time. Recovery spins can be done outdoors, but due to the low power demands, they are often easier done on the trainer. Resist the voice of your inner Sufferlandrian telling you to go faster.\n\n​\n\n**Main Set**\n\n30 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 10,
                "intensityFactor": 0.45
              },
              "workoutId": "jeZrkThiTw",
              "contentId": "b16D760xKz",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 79,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance with Pickups",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n5 minutes RPE 2-4 -- 145-120% of RTP --HR 70-87%\r\n\r\nMain Effort: \r\nNumber of Sets\r\n1\r\nInterval Repeats Per set\r\n5\r\nInterval Effort: \r\n30 second acceleration from RPE 4 to RPE 8 -- 120% of RTP up to 90% of RTP\r\nRecovery: \r\n4 minutes RPE 2-4 -- 145-120% of RTP --HR 70-87%Extra Volume:\r\nNA\r\n\r\nCool Down \r\nEnd your workout with 5 minutes of easy jogging.",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Run at Zone 2 except for a 10-30 second acceleration every 3-8 minutes.\r\nBe sure to keep good form throughout run, and fuel and hydrate appropriately.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 80,
          "type": "Swimming",
          "rank": 202,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique B",
              "style": null,
              "compatibility": 100,
              "description": "Brush up on your [technique definitions or drills](http://thesuf.com/HCtechswim)\r\n\r\nWarm Up\r\n200m stroke of your choice @ RPE 2\r\n\r\nActivation 1\r\nNumber of Sets:\r\n4 \r\nInterval Distance:\r\n25m Drill\r\nRecovery:\r\n10 seconds rest\r\n \r\nActivation 2\r\nNumber of Sets:\r\n1\r\nInterval Distance:\r\n200m Kick \r\nRecovery:\r\n20 seconds rest\r\n\r\nMain Effort\r\nInterval 1   \r\n100m Super Slow Drill   \r\nRecovery:\r\n20 Seconds Rest   \r\nInterval 2\r\n150m 3-3-3 Drill   \r\nRecovery\r\n20 Seconds Rest   \r\nInterval 3\r\n200m Catch Up Drill \r\nRecovery\r\n20 Seconds Rest   \r\nInterval 4\r\n200m Side-Glide-Kick Drill  \r\nRecovery\r\n20 Seconds Rest   \r\nInterval 5\r\n200m Corkscrew Swim\r\nRecovery\r\n20 Seconds Rest   \r\nInterval 6\r\n200m Pull   \r\nRecovery\r\n20 Seconds Rest\r\n\r\nRepeat until full swim time is completed as directed by your training plan \r\n\r\nCool Down \r\n200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Good swimming technique is the key to efficient swimming.  Today is about improving your technique by challenging you with a series of drills and specific moves.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 80,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
              "style": null,
              "compatibility": 100,
              "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6011111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 20,
                "intensityFactor": 0.62
              },
              "workoutId": "rUrrfvb8ii",
              "contentId": "p6E2zIaYNZ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 82,
          "type": "Swimming",
          "rank": 201,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Swim Primers",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up\r\n200m stroke of your choice @ RPE 2\r\n\r\nActivation \r\n100m Kick\r\nRecovery:\r\n 30 seconds rest\r\n100m Pull \r\nRecovery:\r\n 30 seconds rest\r\n\r\nMain Effort: Primers\r\nNumber of Sets:\r\n1\r\nInterval 1\r\n100m @ RPE 5-6\r\nRecovery:\r\n10 seconds rest\r\nInterval 2\r\n100m @ RPE 6.5-8\r\nRecovery:\r\n20 seconds rest\r\n\r\nNumber of Sets:\r\n2 \r\nInterval 1:\r\n100m @ RPE 5-6\r\nRecovery\r\n10 seconds rest\r\nInterval 2:\r\n25m @ RPE 9\r\n150m @ RPE 5-6\r\n25m @ RPE 9\r\nRecovery\r\n60 seconds rest\r\n\r\nCool Down\r\n200m stroke of your choice @ RPE \u003C 2",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4166666666666667,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "This swim is short and sweet and straight to the point. The goal isn\u0027t to give you a hard workout, just give you a chance to get your body fully prepared for tomorrow\u0027s swim! Ideally you will do this on the course you will be swimming tomorrow, however if that is not possible do your best to find a similar area or a pool nearby.",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 82,
          "type": "OutdoorCycling",
          "rank": 203,
          "prospects": [
            {
              "type": "OutdoorCycling",
              "name": "Openers",
              "style": null,
              "compatibility": 100,
              "description": "Warm-Up \r\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C65% \r\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70% \r\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80% \r\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85% \r\n30 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75% \r\n30 seconds @ RPE 9 -- 90-95% of AC (130-190% of FTP) \r\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\r\n\r\nMain Efforts \r\nNumber of Sets\r\n3, all unique \r\nRest Between Sets:\r\n8 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75% \r\n\r\nSet 1 \r\nInterval Repeats per Set\r\n1\r\nInterval\r\nEffort: 3 minutes at @ RPE 7 -- 90% of FTP --HR \u003C95%\r\n\r\nSet 2 \r\nInterval Repeats per Set\r\n1\r\nInterval\r\nEffort: 2 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\r\n\r\nSet 3 \r\nInterval Repeats per Set\r\n3\r\nInterval\r\nEffort: 30 seconds @ RPE 9 -- 95% of MAP (110-130% of FTP)\r\nRecovery: 90 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\r\n\r\nExtra Volume \r\nN/A\r\n\r\nCool Down \r\n6 minutes @ RPE 1.5 -- \u003C45% of FTP",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": null,
              "fourDPWorkoutGraph": null
            },
            {
              "type": "Cycling",
              "name": "Primers",
              "style": null,
              "compatibility": 90,
              "description": "Whether you have a 4DP® fitness test coming up, a group ride you want to smash, that event you have been training all winter for, or even just a fun route you want to have a great ride on, this is the perfect session to do the day before. Unlike other SYSTM sessions, this one should not be viewed as a stand-alone “training” session, but rather, the ace up your sleeve you pull out when that big ride comes around. The key to this session is having you spend just enough time right around threshold, with sufficient recovery between efforts and a handful of sprints to prime all of your systems for tomorrow\u0027s event.  \n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7252777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 42,
                "intensityFactor": 0.76
              },
              "workoutId": "ZH40tnQwpo",
              "contentId": "J4Qiw1pvbL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 82,
          "type": "Running",
          "rank": 204,
          "prospects": [
            {
              "type": "Running",
              "name": "Running Primers",
              "style": null,
              "compatibility": 100,
              "description": "Warm Up \r\n10 minutes @ RPE 3-4 -- 145-120% of RTP -- HR 70-87% \r\n\r\nMain Effort \r\nNumber of Sets\r\n1\r\nRest Between Sets \r\nNA\r\nInterval Repeats Per set\r\n4\r\nInterval\r\nEffort: 30sec Accelerations from RPE 4 up to RPE 8 --120% of RTP to 90-100% RTP -- HR 90\u002B %\r\nRecovery: 90 seconds @ RPE 2 -- 145% of FTP -- HR \u003C70%\u0022\r\n\r\nExtra Volume \r\nNA \r\n\r\nCool Down \r\n5 minutes @ RPE 2 -- 145% of FTP -- HR \u003C70%",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.3333333333333333,
              "durationType": "Time",
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": "Just like the Primers Video, this session is about getting getting your body prepped and ready to run your absolute best tomorrow.  That means you either have a fitness test, race, or super intense workout tomorrow, so make sure to cool down properly and re-fuel after this one!",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 83,
          "type": "Event",
          "rank": 200,
          "prospects": [
            {
              "type": "Event",
              "name": "Sprint Distance Triathlon",
              "style": null,
              "compatibility": 100,
              "description": "",
              "intensity": null,
              "trainerSetting": null,
              "plannedDuration": null,
              "durationType": null,
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Recovery Spin",
              "style": null,
              "compatibility": 100,
              "description": "Don’t be afraid of the Two Rs: rest and recovery. Believe it or not, you get faster when your body is taking it easy after all that suffering. A recovery spin is a very low intensity ride, so easy that you’d feel embarrassed to ride so slowly if you didn’t know you were helping your body get so much faster.\n\n​\n\nA good recovery spin is done at a cadence above 90 RPM. While keeping power below 50% of FTP, or an RPE less than 2.5, and keeping your heart rate in Zone 1 the entire time. Recovery spins can be done outdoors, but due to the low power demands, they are often easier done on the trainer. Resist the voice of your inner Sufferlandrian telling you to go faster.\n\n​\n\n**Main Set**\n\n30 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 10,
                "intensityFactor": 0.45
              },
              "workoutId": "jeZrkThiTw",
              "contentId": "b16D760xKz",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 2,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique A",
              "style": null,
              "compatibility": 100,
              "description": "In case you need to brush up on your other [technique definitions or drills](https://wahoosystm.com/HelpCenterSwimDrills).\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\nGood swimming technique is the key to efficient swimming. Today\u0027s session is a low intensity workout that challenges you with a series of drills designed to reinforce proper technique that will make you a more efficient, powerful and faster swimmer.\n\n​\n\n**Warm-Up**\n\n200m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval Distance: 25m Drill of choice\n\nThe goal of a Drill set is not to swim at any given pace, but instead focus on proper form. Choose a drill or focus on one of these key points for each 25m interval:\n\n- \\*Body position- swim on horizontal plane\n- \\*Enter in front of shoulder- preventing cross over\n- \\*Breathe early- prevent wide stroke- elbow is always widest point\n- \\*Elbow is always the highest point of the stroke\n- \\*Back of hand always faces direction of travel\n- \\*Fingers to point at the bottom of pool\n- \\*Initiate your stroke from the hips\n\nRecovery: 10 seconds rest\n\n​\n\n**Activation 2**\n\nNumber of Sets: 1\n\nInterval Distance:\n\n200m Pull @ RPE 3-4 -- Z2\n\n- This set eliminates the use of your legs. It requires a buoy that you can swim with between your legs. The buoy will keep your body in the correct orientation. By removing your legs from the drill you will be required to only use your arms. This will help you focus on efficient form and making the most of each stroke!\n\nRecovery: 20 seconds rest\n\n​\n\n**Main Effort**\n\nThe following should all be done at a moderate pace (RPE 2-4 -- Z1-Z2), with enough rest between that you can focus on proper form\n\nInterval 1: 150m of One Arm Freestyle drill\n\n- This is an old standby. Put your non-pulling arm out in front of your body and swim with only the opposite arm. Take some time to watch the arm that is pulling. Feel your elbow directly above your hand and that you are pulling right down the midline of your body. Split your body in half with your fingertips. Your emphasis should be on power and efficiency not on speed.\n- See how few strokes you can take to get down the pool.\n- Once you have it mastered, you can leave the non-pulling arm at your side.\n\nRecovery: 20-sec rest\n\nInterval 2: 200m of 3/4 Catch Up drill\n\n- A variation to catch-up that takes us closer to the full stroke. Another way to describe this is almost catch-up. Take a stroke with the right hand, wait until this hand is almost all the way through recovery and then start your pull with the left. This creates a very rhythmic feel, almost like skating through the water. Take your pull and ride the glide from it. When you lose speed, take your next pull. Want a good example of this? Watch Olympic replays of the Aussies, particularly Ian Thorpe. He races like this drill. Efficiency is your goal.\n\nRecovery: 20-sec rest\n\nInterval 3: 200m of Elbow-Hip-Elbow drill\n\n- A variation on side glide kick. The same goals apply balance, body roll, and head position during breathing. Start on either side with one arm extended out front, and the other at your side. With the fingers of the hand at your side, touch the elbow of your upper arm, then your hip, and then the elbow again. Now take your stroke or three strokes. Kick and glide and repeat.\n\nRecovery: 20-sec rest\n\nInterval 4: 150m of Fist Drill\n\n- Swim freestyle with your hands in fists. This is going to force you to get your forearms involved in the stroke because they have more surface area than your hands. Keep your elbow high under the water. Your forearm, from elbow to fingertips should be perpendicular to the bottom of the pool. Again, watch Ian Thorpe. You will feel like you are slipping through the water which is normal, however, the more water you feel like you are pulling the more efficient you are getting.\n\nRecovery: 20-sec rest\n\nInterval 5: 200m of Zipper Drill\n\n- This drill is done by pulling the fingers up the side of the body until they come into the armpit. The point of this is to keep a nice high elbow on recovery and to force the body to roll. Many use the Fingertip drag drill to accomplish this but we prefer this drill because the body roll essentially gives this drill a dual purpose.\n\nRecovery: 20-sec rest\n\nRepeat until full swim time is completed\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C 2 -- Z1\n\n​\n\n**Total Distance**\n\n1600m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 19,
                "intensityFactor": 0.5
              },
              "workoutId": "78sRao8nrj",
              "contentId": "JiS1UvEPGG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z1\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent.\n\nCount strokes every 5 laps to ensure that your form is not deteriorating.\n\nPractice your sighting at least once every 100m.\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 42,
                "intensityFactor": 0.65
              },
              "workoutId": "eGJNUinB1C",
              "contentId": "t36WK6pbfA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 10,
          "type": "Cycling",
          "rank": 104,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Found in America",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2020): After finishing the Race Across America on the podium, Dave Haase is coming back to win it. But is that what he\u0027s really looking for? Is there more to why he\u0027s taking on such a formidable challenge than the pursuit of victory alone? This is an honest look at the demands of a legendary ultra-endurance race and what one finds out on the road.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9502777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 37,
                "intensityFactor": 0.63
              },
              "workoutId": "D1FL5kUhQh",
              "contentId": "ESIO4QRoSb",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 11,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Technique B",
              "style": null,
              "compatibility": 100,
              "description": "Good swimming technique is the key to efficient swimming. Today\u0027s session is a low intensity workout that challenges you with a series of drills designed to reinforce proper technique that will make you a more efficient, powerful and faster swimmer.\n\n​\n\nIn case you need to brush up on your other swimming [technique definitions or drills](https://wahoosystm.com/HelpCenterSwimDrills).\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n200m stroke of your choice @ RPE 2 -- Z1\n\n​\n\n**Activation 1**\n\nNumber of Sets: 4\n\nInterval Distance: 25m Drill of your choice\n\nThe goal of a Drill set is not to swim at any given pace, but instead focus on proper form. Choose a drill or focus on one of these key points for each 25m interval:\n\n- Body position- swim on horizontal plane\n- Enter in front of shoulder- preventing cross over\n- Breathe early- prevent wide stroke- elbow is always widest point\n- Elbow is always the highest point of the stroke\n- Back of hand always faces direction of travel\n- Fingers to point at the bottom of pool\n- Initiate your stroke from the hips\n\nRecovery: 10 sec rest\n\n**Activation 2**\n\nNumber of Sets: 1\n\nInterval Distance: 200m Kick @ RPE 5 -- Z3\n\n- This drill requires you to only use your legs for propulsion. Face the sky with your arms extended above your head, biceps squeezing your ears. Kick from the hips with straight legs, toes just breaking the surface of the water. When you see the flags above your head, flip onto your belly so you don\u0027t hit the wall. Make note if there are no flags at your pool before doing this drill so you can look for another sign that the wall is near.\n\nRecovery: 20-sec rest\n\n​\n\n**Main Effort**\n\nThe following should all be done at a moderate pace (RPE 2-4 -- Z1-Z2), with enough rest between that you can focus on proper form\n\nInterval 1: 100m of Super Slow Drill\n\n- This should be done for 25m at a time. Slow down your stroke rate as much as possible. In fact, the point here is to see how slowly you can go without sinking. Work hard to swim with perfect form concentrating not on how much water you are pulling but rather what position your hands, body, and feet are in. This drill will help you keep your balance in the water. If you can balance going slow, you can balance going fast.\n\nRecovery: 20-sec rest\n\nInterval 2: 100m swim, incorporating the Super Slow Drill\n\nInterval 3: 150m of 3-3-3 Drill\n\n- Simply put, take three strokes with your left, three with your right, and three whole strokes (6 arm pulls). This is good for a couple of things: First, continue to work on the efficiency of the one-arm strokes. Secondly, When you switch sides, you want to work on the transfer of power from right to left. Then when you take full strokes, you can quickly get into long, efficient strokes.\n\nRecovery: 20-sec rest\n\nInterval 3: 200m of Catch Up Drill\n\n- Another old standby. Swim freestyle one arm at a time. Take a stroke with the right and touch your left arm that is out in front of the body. Then take your pull with the left hand. Be sure that you are not rushing. Get as much out of each arm stroke that you can. Remember, freestyle is not of stroke of constant propulsion. It is a pull with the left and then the right. It is important that we approach it this way.\n\nRecovery: 20 sec rest\n\nInterval 4: 200m of Side-Glide-Kick Drill\n\n- Push off the wall on your side and kick for eight kicks. Keep your ear on your arm and your body straight. Make sure your knees are passing one another when you kick. After eight kicks, take a good pull with the arm on top. Use this pull to roll you to the other side and repeat the cycle. For variation do this drill with three strokes in between. I.e. on the right side with the right arm up and the left arm at your side. Take a pull with the right, left, and then right. End with your left arm up and your right arm at your side. This will help your body position in the water and if you keep your head on your arm when you are on your side it will help your head position when you breathe.\n\nRecovery: 20-sec rest\n\nInterval 5: 200m of Corkscrew Swim\n\n- This is done by alternating one stroke of freestyle and one stroke of backstroke. This repetition makes you roll over and around from front to back repeatedly, thus \u0022corkscrewing.” This is useful because most of us will want to cross our bodies when we roll from our back to our stomach. Fight this and try to take perfect midline strokes over and over.\n\nRecovery: 20-sec rest\n\nInterval 6: 200m Pull\n\n- This set eliminates the use of your legs to focus on your catch and pull. Squeeze a pull buoy between your legs to keep your hips afloat and body in the correct orientation.\n- While the back of the hand always faces the direction of travel and the elbow remains the highest point of the stroke, your leading hand spears the water and the Catch phase is initiated by obtaining a grasp on the water while reaching forward. This first phase is not about producing power, rather, it sets you up for the Pull and Push Phases. Imagine pulling yourself over a barrel. Hold as much water as possible while pulling, then pushing the water back to your thigh keeping the hand on the inside on the elbow. Your stroke should accelerate as you progress through the Pull and Push Phases. There is a subtle S formation that occurs during the phases, starting with the Pull Phase just above the shoulder and continuing through the Push Phase until your hand exits the water to begin the recovery phase. Always imagine a line dividing your body lengthwise, with your left arm staying on the left side and your right arm staying on the right side. Crossover will result in additional drag and unwanted sway in the lower body.\n\nRecovery: 20-sec rest\n\nRepeat until full swim time is completed as directed by your training plan\n\n​\n\n**Cool Down**\n\n200m stroke of your choice @ RPE \u003C 2 -- Z1\n\n​\n\n**Total Distance**\n\n1750m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 12,
                "intensityFactor": 0.4
              },
              "workoutId": "oA5AlMHAEA",
              "contentId": "een8IfBWVb",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 20,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 45",
              "style": null,
              "compatibility": 100,
              "description": "This session can also be performed in open water if available. \n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\nThis is a steady, low-intensity swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z2\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent\n\nCount strokes every 5 laps to ensure consistency\n\nPractice your sighting at least once every 100m\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2000m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 19,
                "intensityFactor": 0.5
              },
              "workoutId": "",
              "contentId": "HY3ZIZSybT",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 27,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Recovery Swim",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\nSwim at RPE 1-2 -- Z1 for 20-30 minutes or 1000m.\n\n​\n\nMix drills with steady easy swimming\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": null,
                "intensityFactor": null
              },
              "workoutId": "",
              "contentId": "Hsz4YbQr0w",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 34,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z1\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent.\n\nCount strokes every 5 laps to ensure that your form is not deteriorating.\n\nPractice your sighting at least once every 100m.\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 42,
                "intensityFactor": 0.65
              },
              "workoutId": "eGJNUinB1C",
              "contentId": "t36WK6pbfA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 41,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z1\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent.\n\nCount strokes every 5 laps to ensure that your form is not deteriorating.\n\nPractice your sighting at least once every 100m.\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 42,
                "intensityFactor": 0.65
              },
              "workoutId": "eGJNUinB1C",
              "contentId": "t36WK6pbfA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 48,
          "type": "Swimming",
          "rank": 1000,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Aerobic Swim 60",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured swim designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2.\n\n​\n\nFor help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm-Up**\n\n100m stroke of your choice @ RPE 3 -- Z1\n\nRecovery: 15 seconds rest\n\n100m Kicking @ RPE 5 -- Z3\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nSteady swim @ RPE 3-4 -- Z2 for the duration of the workout as specified by your training plan.\n\nUse pace clock to ensure lap times are remaining consistent.\n\nCount strokes every 5 laps to ensure that your form is not deteriorating.\n\nPractice your sighting at least once every 100m.\n\n​\n\n**Cool Down**\n\n200m Pull @ RPE 2 -- Z1\n\n​\n\n**Total Distance**\n\n2500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 42,
                "intensityFactor": 0.65
              },
              "workoutId": "eGJNUinB1C",
              "contentId": "t36WK6pbfA",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 55,
          "type": "Running",
          "rank": 200,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 30",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\nThis is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\nFor help understanding your run workout and calculating your pace zones, please see this article.\n\n​\n\n**Warm-Up**\n\nNA\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 30 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "RCbVa2QJmE",
              "contentId": "8My1kzRLAo",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 57,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "4 x 1200",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm up**\n\n10 minutes @ RPE 2-4 (Z1-Z2)\n\n​\n\n**Activation 1 10-second accelerations**\n\nNumber of Sets: 3\n\nRest Between Sets: 30s\n\nInterval Effort: Build from 145% of RTP to 100% RTP (Z2-Z4b)\n\n​\n\n**Main Effort**\n\nNumber of Sets: 4\n\nRest Between Sets: 4 minutes\n\nInterval Distance: 1200m\n\nInterval Effort: RPE 9-10 --\u003C85% of RTP --HR NA (Z5)\n\nRecovery: RPE 1-2 --\u003E145% RTP --HR \u003C70% (Z1)\n\n​\n\n**Cool Down**\n\n5-10 minutes @ RPE 2 -- \u003E145% of RTP -- \u003C70% of RTHR (Z1)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8333333333333334,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 3,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 68,
                "intensityFactor": 0.9
              },
              "workoutId": "7kS7ViPUWE",
              "contentId": "PfeGdcdelx",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 66,
          "type": "Running",
          "rank": 201,
          "prospects": [
            {
              "type": "Running",
              "name": "Endurance Brick 45",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n​\n\n**Warm-Up:**\n\nBike Session\n\n​\n\n**Main Effort**\n\nInterval Duration: 40 minutes\n\nInterval Effort: RPE 3-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n​\n\n**Cool Down:**\n\n5 min @ RPE 1-2 -- \u003E145% of RTP -- HR \u003C 70% (Z1\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 32,
                "intensityFactor": 0.65
              },
              "workoutId": "",
              "contentId": "iiIkWWVfB0",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 69,
          "type": "Swimming",
          "rank": 100,
          "prospects": [
            {
              "type": "Swimming",
              "name": "Open Water Simulation (long)",
              "style": null,
              "compatibility": 100,
              "description": "For help understanding your swim workout and calculating your pace zones, please see [this article](https://wahoosystm.com/SwimSessionFAQ).\n\n​\n\n**Warm Up**\n\n100m stroke of your choice @ RPE 3 -- Z2\n\nRecovery: 15 seconds rest\n\n100m Drill @ RPE 2 -- Z1\n\nRecovery: 15 seconds rest\n\n​\n\n**Main Effort**\n\nContinuous swim @ RPE 5-6 -- Z3 for duration of workout as dictated by your training plan.\n\nFocus on alternate side breathing (left and right) and practice your sighting.\n\n​\n\n**Cool Down**\n\n100m @ RPE \u003C2 -- Z1\n\n​\n\n**Total Distance**\n\n3500m\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 25,
                "intensityFactor": 0.5
              },
              "workoutId": "VuhsK2vyD5",
              "contentId": "TtbKgnSKwH",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 69,
          "type": "Running",
          "rank": 200,
          "prospects": [
            {
              "type": "Running",
              "name": "Aerobic Run 75",
              "style": null,
              "compatibility": 100,
              "description": "This is an easy, fun, and unstructured run designed to keep your system ticking over without adding too much fatigue. Make it a priority to never go above Z2, and a good way to do this is to go for a run with a friend and keep it at a conversational pace (or talk to yourself!).\n\nFor help understanding your run workout and calculating your pace zones, please see [this article](https://wahoosystm.com/RunningSessionFAQ).\n\nLearn how to perform your [**Running Drills**](https://support.wahoofitness.com/hc/en-us/articles/4404080091922-Running-Drills) here.\n\n**Warm-Up**\n\nNA\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: NA\n\nInterval Duration: 75 minutes\n\nInterval Effort: RPE 2-4 -- 145-120% of RTP --HR 70-87% (Z2)\n\nRecovery: NA\n\n**Cool Down**\n\nNA\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.25,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": null,
                  "nm": null,
                  "map": null,
                  "ftp": null
                },
                "tss": 36,
                "intensityFactor": 0.6
              },
              "workoutId": "8VtH36r1nD",
              "contentId": "CLo1K0MBo2",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": []
    }
  ]
}