{
  "previewPlan": [
    {
      "id": "BaThjnAKAM",
      "name": "KoS Quest - Pain Suckers Delight (hardest)",
      "weakness": "NoWeakness",
      "grouping": "Pain Suckers Delight (hardest route)",
      "category": "",
      "subcategory": "None",
      "description": "**Congrats on accepting the Knighthood Challenge!**\n\nThis plan will load the 10 hardest (highest TSS) workouts available for you to complete your Knighthood.\n\nA reminder of the rules:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
      "planDescription": "Quest",
      "fixedEndDate": "",
      "level": "",
      "type": "Cycling",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "1 Week",
      "progression": "None",
      "hidden": false,
      "createdAt": "2024-04-16T15:42:32.043Z",
      "updatedAt": "2025-09-02T10:43:51.959Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 0,
          "type": "Event",
          "rank": 222,
          "prospects": [
            {
              "type": "Event",
              "name": "Knighthood Quest ",
              "style": null,
              "compatibility": 100,
              "description": "Today is the big day! A few reminders and tips before you begin your quest:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": null,
                "intensityFactor": null
              },
              "workoutId": "",
              "contentId": "zo5GHq3hvi",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 223,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Blender",
              "style": null,
              "compatibility": 100,
              "description": "A smorgasbord of Suffering, this session has it all. Originally created in Coach Sir Neal Henderson\u0027s Penn State dorm room in 1992, it\u0027s his weapon of choice for bringing the pain (shakes).\n\n​\n\nWhat\u0027s in the Blender? First, a variety of longer efforts build sustained power while also making sure you\u0027re sufficiently fatigued. This initial beatdown is necessary to ensure you get the maximum benefit from _Blender_\u0027s infamous \u0027Pain Shakes.\u0027 Three sets of these little devils help you develop a supernatural ability to recover from big efforts. The bonus is that you also beef up your ability to produce high-end power, building Anaerobic Capacity and Maximal Aerobic Power simultaneously.\n\n​\n\nThe threshold efforts at the end are the bitter cherry on the sundae, improving your body\u0027s ability to produce aerobic power and helping make sure your FTP will get the same boost as your AC and MAP. A rising tide of lactic acid raises all boats. Oh, and clocking in at one hour and 40 minutes, Blender will also help whip your endurance into a frenzy.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.696388888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 133,
                "intensityFactor": 0.89
              },
              "workoutId": "ZWePe15MOH",
              "contentId": "14TmGHiqpC",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 225,
          "prospects": [
            {
              "type": "Cycling",
              "name": "It Seemed Like A Good Idea At The Time (ISLAGIATT)",
              "style": null,
              "compatibility": 100,
              "description": "When you want to increase your endurance and add some threshold work but only have two hours, this is the session you need. By adding in multiple surges and short chunks of time above threshold, ISLAGIATT overloads your system with metabolic byproducts (\u0027the nasties\u0027), which your body has to learn to clear out more efficiently.\n\n​\n\nCombining such long interval durations with these hard surges not only forces your body to cope with the effort, but it pushes you harder mentally because after each surge, the effort right at threshold “feels” harder than it should. With the final intervals focusing more on short, repeated efforts, you\u0027ll stress your body\u0027s ability to recover when deeply fatigued, making this more than just an “endurance builder\u0022 workout, but one that will help you keep churning out power deep into the final kilometers of challenging rides or events.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.8494444444444444,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 149,
                "intensityFactor": 0.9
              },
              "workoutId": "PiW27golWh",
              "contentId": "FML2PrDvkR",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 226,
          "prospects": [
            {
              "type": "Cycling",
              "name": "14 Vise Grips",
              "style": null,
              "compatibility": 100,
              "description": "You can never have too many tools in the shed. After years of lobbying, we finally convinced Grunter von Agony to share his favorite set of implements with us: the fabled _14 Vise Grips_. Taken individually, each of the 14 intervals might appear tame, incapable of inflicting a significant squeeze. But when expertly applied in the correct order, they apply just the right kind of pressure to turn a Couchlandrian into a Sufferlandrian, just like turning coal into diamonds.\n\n​\n\nWhile the duration of each Vise Grip varies (from 30 seconds to 2 minutes), the power targets and recovery durations between them remain constant. The first 30-second interval should feel like a Sunday stroll in the park, but by the end of the first 2-minute Vise Grip, you\u0027ll be cursing Grunter\u0027s name. As the intervals get shorter, time will appear to stretch. That final 30-second effort will feel like an eternity. When you roll up to the second set, you\u0027ll know what you\u0027re in for, so just put your head down and prepare yourself to crush or be crushed.\n\n​\n\nOnce you make it through all 14 Vise Grips, you will have been north of your Maximal Aerobic Power (MAP) for a total of 16 minutes. Changing the duration of the efforts (while keeping the same recovery) stresses your Anaerobic Capacity (AC) in a more dynamic way than, say, a more straightforward on/off session like _Half is Easy_. Since the longer efforts have the same recovery duration as the shorter ones, you will eventually deplete your AC, forcing your body to rely on your MAP to hit the required power targets. As the intervals get shorter in the second half of each set, you\u0027ll find that you have just enough left in the tank to complete the next effort.\n\n​\n\nUltimately this workout combines the advantages of shorter, higher-power intervals with longer recovery (great for building muscular strength) with the advantages of longer, higher-power intervals with inadequate recovery (great for driving up your MAP and improving your AC).\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9191666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 4,
                  "nm": 1,
                  "map": 5,
                  "ftp": 2
                },
                "tss": 77,
                "intensityFactor": 0.91
              },
              "workoutId": "q92iqWDfcB",
              "contentId": "PexwKSHyz6",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 227,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Clobber",
              "style": null,
              "compatibility": 100,
              "description": "The 3x25-minute sub-threshold workout is one of the most classic interval sessions out there, so prepare for a trip to the northern Painlands for this FTP-builder. The reason the 3x25 sub-threshold workout is so popular is that it is easy to follow, helps teach good pacing, and gives you a great threshold training stimulus.\n\n​\n\nIn this case, you\u0027re looking at three, (roughly) 25-minute blocks at around 90% of your FTP, an effort we refer to as \u0022Sub-Threshold\u0022. Many refer to this intensity as \u0022Sweet-Spot\u0022, but we prefer Sub-Threshold, as the real key is to never let your power creep above your FTP. Staying just below threshold ensures that your effort remains at an intensity you know your body can handle but that is close to what would not be sustainable.\n\n​\n\nThe only way you\u0027re going to make it through three of these efforts is if you pace yourself properly. Everyone feels just fine for the first 5 minutes of the first effort, and are often tempted to go harder. Don\u0027t be that person. More often than not, that person blows up spectacularly in the second interval, unable to finish the session. Or they have to ride that second interval at lower power, turning it into a Tempo session, which is not the goal.\n\n​\n\nGetting a sense of how these efforts \u0022bite\u0022 towards the end is vital to learning how to pace yourself over longer steady-state efforts; whether that\u0027s a time trial, local climb, breakaway, triathlon, or even a good old fitness test. In each of those cases, the pacing is key. Learning how your perceived effort can steadily climb even though your power remains unchanged is critical to good pacing.\n\n​\n\nSo how do you know if you are doing this one right? As we said, the first 5 minutes should feel relatively easy. Around that 5-minute mark, your heart rate should stop climbing, and settle into 2-5% below your Lactate Threshold Heart Rate (LTHR). If your heart rate is climbing for the entire effort and goes above your LTHR, then you are going too hard.\n\nIf you hit the 10-minute mark, your legs feel fine, and your heart rate is still in Zone 3, then you aren\u0027t going hard enough.\n\nIf you\u0027ve never done a session like this before, you can consider only doing the first 20-minute effort, or even sticking to just the first 15 minutes of each effort. There\u0027s no shame in building up to this full session, so don\u0027t be afraid to pause and fast forward as needed.\n\n​\n\nNailing this session is really about getting in tune with your body and understanding what the edge between a sustainable and an unsustainable effort feels like. Not being able to complete this workout is fairly common, so don\u0027t beat yourself up if you can\u0027t make it through the first few times. As long as you come away from this session with a better understanding of how to pace longer efforts, you\u0027ve improved as an athlete.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.7722222222222221,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 117,
                "intensityFactor": 0.81
              },
              "workoutId": "2z5P3w619N",
              "contentId": "JpDMHRZtaB",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 228,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Nine Hammers",
              "style": null,
              "compatibility": 100,
              "description": "Sometimes you\u0027re the hammer. Sometimes you\u0027re the nail. And sometimes, you\u0027re getting both hammered and nailed. With a series of nine different intervals, all at or above threshold, this is one of the best Maximal Aerobic Power / VO2 sessions in The Sufferfest library. It isn’t just the total amount of time spent above threshold, though.\n\n​\n\nThis workout takes the training stress up a notch by giving you barely enough time to recover from the previous hammer before the next one falls. This ensures your Anaerobic Capacity gets a little boost as well.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9702777777777778,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 5,
                  "ftp": 4
                },
                "tss": 80,
                "intensityFactor": 0.91
              },
              "workoutId": "3QDoncjr5A",
              "contentId": "TBn7DwOwEc",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 229,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Shovel",
              "style": null,
              "compatibility": 100,
              "description": "Time to dig deep into the COURAGE mines. No other workout runs the full range of 4DP® metrics like this one. Intervals get harder as they get shorter, pushing your Anaerobic Capacity (AC) to the very limit and ensuring that after each micro-interval, your body recovers just enough to hit and hold your power target for the next interval...even if you don\u0027t think you can.\n\n​\n\nThe 5 and 10-second efforts hit your Neuromuscular (NM) system hard. No holding back for these short efforts. All out means all out. The 15-60 second efforts all require significant anaerobic energy, but with so little rest, your cardiovascular system never really gets a break. This not only stresses your AC as you try to recover, but it also pushes your Maximal Aerobic Power (MAP) to its limit as your body tries to generate as much aerobic power as possible.\n\n​\n\nEven though there is no single interval in this workout that is longer than 60 seconds, each full set lasts more than 20 minutes, so the unrelenting aerobic stress turns this session into a surprisingly good FTP builder.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.2322222222222223,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 4,
                  "map": 4,
                  "ftp": 3
                },
                "tss": 93,
                "intensityFactor": 0.87
              },
              "workoutId": "Gr8274OKsc",
              "contentId": "YBjIjxrpJ2",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 230,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Violator",
              "style": null,
              "compatibility": 100,
              "description": "If your Neuromuscular Power (NM) and Anaerobic Capacity (AC) got together to throw a party and everybody left that party shattered but better off for it, then this would be it. _Violator_ is the perfect example of how the amount of recovery time between efforts dramatically changes the amount—and type—of training stress you get.\n\n​\n\nYes, there are 64 sprints, but they\u0027re not all doing the same thing for your fitness. The first set of sprints has enough recovery that you\u0027ll be able to work your NM to the max. The second set still has enough recovery to allow you to hit high power numbers, but the reduced time between sprints stresses your ability to recover and repeat that high effort. That means you\u0027ll start to dip into AC. The last set—with equal sprint and recovery times—ensures your heart rate never gets a chance to drop down. That works your MAP like nobody\u0027s business.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0405555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 5,
                  "map": 3,
                  "ftp": 1
                },
                "tss": 85,
                "intensityFactor": 0.91
              },
              "workoutId": "csuS7eLf2m",
              "contentId": "553lkiVNgV",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 231,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Hell Hath No Fury",
              "style": null,
              "compatibility": 100,
              "description": "This takes one of the oldest FTP building workouts, the venerable 2 x 20, and makes it exciting. Forcing your body to churn out power right below, at, and just above threshold for 20-minute intervals dramatically improves your ability to generate sustainable power. It\u0027s great for building your FTP (unless you have an unusually low MAP...in which case you\u0027re going to find this session a bit challenging).\n\n​\n\nBy itself, the 3-minute time trial effort at the end would not be much to deal with, but after churning out threshold power for 40 minutes, hitting this 3-minute effort at 100% will ensure you stress your MAP enough to give this session a slight edge over other FTP Builder workouts.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0686111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 92,
                "intensityFactor": 0.93
              },
              "workoutId": "lVqtKuf15P",
              "contentId": "OIoXe9I4bh",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 232,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Team Scream",
              "style": null,
              "compatibility": 100,
              "description": "Thanks to a last-minute selection, you have been drafted into a 48-kilometer Team Time Trial (TTT). Done correctly, each of the 5 riders will all cross the finish line utterly spent. Pacing is vital. A TTT is essentially one long set of Over / Under intervals. When it\u0027s your turn on the front, you will be well over your FTP, and while those pulls usually only last around 30 seconds, you\u0027ll clock almost 20 pulls over the course of 48k.\n\nPhysiologically speaking, a TTT is one of the best combined AC/MAP/FTP sessions out there. Regardless of your chosen discipline, Rider Type, or rider weakness, this effort will push you to your limits, and you\u0027ll be faster for it.\n\n​\n\nThe original inspiration for our ProRides series, Team Scream just has that bit of...how do we say..._Sufferlandrian-ness_...to make it extra special.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.1613888888888888,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 4,
                  "ftp": 5
                },
                "tss": 89,
                "intensityFactor": 0.88
              },
              "workoutId": "wjsDMXKUuk",
              "contentId": "aB01LoXAZk",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 224,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Model",
              "style": null,
              "compatibility": 100,
              "description": "They say that beauty is in the eye of the beholder. And through the bleeding eyes of Sufferlandrians, what could possibly be more beautiful than the sharp, saw-tooth profile of the workout you see before you? Full of gorgeous, shapely, shimmering blocks of yellow Maximal Aerobic Power (MAP) efforts interspersed with mercifully brief and slightly inadequate recoveries, it\u0027s a real stunner.\n\n​\n\nBut you know what\u0027s even better looking than this alluring workout? You (after you\u0027ve completed the workout, that is). Originally designed by our Head of Sports Science, Neal Henderson, for his professional athletes, The Model is a beautiful portrait of MAP brutality. It\u0027s one of those sessions that you think you can\u0027t finish, but always somehow do. It will leave you breathless, feeling all tingly, a bit confused and lying in a blubbering heap. It\u0027s a look. It will also deliver a nice boost to your fitness that always looks and feels good.\n\n​\n\nA true love letter to the beauty of professional cycling, The Model features a banging soundtrack and thrilling footage from both the men\u0027s and women\u0027s pelotons. With its eclectic design, effects, and graphics, you\u0027ll find yourself unable to tear your eyes away from the action on screen (assuming you can lift them from your stem).\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9844444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 86,
                "intensityFactor": 0.9
              },
              "workoutId": "WQk9TYaUhj",
              "contentId": "NkctG9Onu1",
              "notes": "",
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": []
    }
  ]
}