{
  "previewPlan": [
    {
      "id": "Konx64zm5Y",
      "name": "KoS Quest - Agonian Delicacies (most popular workouts)",
      "weakness": "NoWeakness",
      "grouping": "Agonian Delicacies (most popular workouts)",
      "category": "",
      "subcategory": "None",
      "description": "**Congrats on accepting the Knighthood Challenge!**\n\nThis plan will load the 10 most popular workouts available for you to complete your Knighthood.\n\n​\n\nA reminder of the rules:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
      "planDescription": "Quest",
      "fixedEndDate": "",
      "level": "",
      "type": "Cycling",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "1 Week",
      "progression": "None",
      "hidden": false,
      "createdAt": "2024-04-16T15:34:27.262Z",
      "updatedAt": "2025-07-01T18:06:53.971Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 0,
          "type": "Event",
          "rank": 222,
          "prospects": [
            {
              "type": "Event",
              "name": "Knighthood Quest ",
              "style": null,
              "compatibility": 100,
              "description": "Today is the big day! A few reminders and tips before you begin your quest:\n\n- Please see a doctor. You’re not right and are in desperate need of help.\n- You must be at least 18 years old.\n- You must have an active subscription to Wahoo X in order to be officially recognized as a Knight of Sufferlandria®.\n- You must do 10 eligible Sufferfest videos, back-to-back. Please check the list of eligible Sufferfest videos [here](https://support.wahoofitness.com/hc/en-us/articles/4406074947090-How-to-become-a-Knight-of-Sufferlandria)\n- You can do the videos in any order you like.\n- You may not do any video title more than once (e.g., you can\u0027t do the old and the remastered version of a video.\n- All workouts must be completed in the SYSTM app. Workouts completed outdoors using a Wahoo computer will not be applicable to a Knighthood Quest.\n- You are allowed 10 minutes rest between videos. No more. But less is fine.\n- We do not set any kind of performance benchmark for your ride (i.e., how hard you have to go). However, we insist that you do a ride in which you Suffer and which, most importantly, of which you are immensely proud of yourself for having given all you can give and a bit more.\n- We strongly encourage you to raise money for a good cause. It\u0027ll do good for the world, make you even prouder of yourself and rightly earn the praise of your fellow Sufferlandrians.\n\nPlease note, you can complete these workouts at whatever intensity you choose. Keep in mind you are going to be spending a lot of time in the saddle so we recommend 70% intensity or less as the workouts go on.\n\n​\n\n**Upon completion, fill out this **[form](https://wahoosystm.com/kosapp)[**.**](https://thesufferfest.typeform.com/to/JtS2Df)** **(don’t send us an email – we need it through the form).\n\nGood luck and see you in the castle!\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": null,
                "intensityFactor": null
              },
              "workoutId": "",
              "contentId": "zo5GHq3hvi",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 223,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Shovel",
              "style": null,
              "compatibility": 100,
              "description": "Time to dig deep into the COURAGE mines. No other workout runs the full range of 4DP® metrics like this one. Intervals get harder as they get shorter, pushing your Anaerobic Capacity (AC) to the very limit and ensuring that after each micro-interval, your body recovers just enough to hit and hold your power target for the next interval...even if you don\u0027t think you can.\n\n​\n\nThe 5 and 10-second efforts hit your Neuromuscular (NM) system hard. No holding back for these short efforts. All out means all out. The 15-60 second efforts all require significant anaerobic energy, but with so little rest, your cardiovascular system never really gets a break. This not only stresses your AC as you try to recover, but it also pushes your Maximal Aerobic Power (MAP) to its limit as your body tries to generate as much aerobic power as possible.\n\n​\n\nEven though there is no single interval in this workout that is longer than 60 seconds, each full set lasts more than 20 minutes, so the unrelenting aerobic stress turns this session into a surprisingly good FTP builder.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.2322222222222223,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 4,
                  "map": 4,
                  "ftp": 3
                },
                "tss": 93,
                "intensityFactor": 0.87
              },
              "workoutId": "Gr8274OKsc",
              "contentId": "YBjIjxrpJ2",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 224,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Thin Air",
              "style": null,
              "compatibility": 100,
              "description": "Here it is, a very long sustained effort session unlike any other in The Sufferfest library. Longer sustained efforts like this are crucial for improving your threshold. And while most of the climb is actually at tempo and sub-threshold effort, there are enough surges above it that your body will constantly be responding to them to clear out those nasty metabolites. Painsuckers, rejoice!\n\n​\n\nContrary to popular belief, there are greater improvements that can be made in your FTP by working below FTP than there are in working above it. Also, during such a long effort with limited recovery the seemingly lower intensity is actually quite challenging. That’s one of the reasons why the same power target five minutes into this climb feels much harder when it comes again at minute 30. This is a great session to help you work on your ability to maintain concentration and form even when fatigued…so load this one up and climb your way to greater fitness and performance!\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9833333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 4
                },
                "tss": 68,
                "intensityFactor": 0.83
              },
              "workoutId": "s1Nbw9Vw8c",
              "contentId": "LGt8MqcvdQ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 225,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Violator",
              "style": null,
              "compatibility": 100,
              "description": "If your Neuromuscular Power (NM) and Anaerobic Capacity (AC) got together to throw a party and everybody left that party shattered but better off for it, then this would be it. _Violator_ is the perfect example of how the amount of recovery time between efforts dramatically changes the amount—and type—of training stress you get.\n\n​\n\nYes, there are 64 sprints, but they\u0027re not all doing the same thing for your fitness. The first set of sprints has enough recovery that you\u0027ll be able to work your NM to the max. The second set still has enough recovery to allow you to hit high power numbers, but the reduced time between sprints stresses your ability to recover and repeat that high effort. That means you\u0027ll start to dip into AC. The last set—with equal sprint and recovery times—ensures your heart rate never gets a chance to drop down. That works your MAP like nobody\u0027s business.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0405555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 5,
                  "map": 3,
                  "ftp": 1
                },
                "tss": 85,
                "intensityFactor": 0.91
              },
              "workoutId": "csuS7eLf2m",
              "contentId": "553lkiVNgV",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 226,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Downward Spiral",
              "style": null,
              "compatibility": 100,
              "description": "The very first Sufferfest video ever made (although it\u0027s since been remastered a few times). Both sets of intervals are designed to have equal work to rest ratios, so the longer intervals have longer recovery time afterward. This first set will begin to deplete your Anaerobic Capacity (AC), and by the end, your aerobic system will have to work overtime to help keep the power up. And keep the power up you will, since as the intervals get shorter they also get harder.\n\n​\n\nThe second interval set follows the same pattern as the first, ensuring both your AC and Maximal Aerobic Power are pushed towards their limit. To give it that extra kick, we added a couple of 30-second efforts with 30 seconds of recovery (having flashbacks to Pain Shakes from _Blender_, are we?). These final efforts are just hard enough—with just enough rest—that you will fully deplete your AC, forcing your MAP to pick up the slack.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9011111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 2,
                  "map": 3,
                  "ftp": 1
                },
                "tss": 75,
                "intensityFactor": 0.91
              },
              "workoutId": "S9QhwMs6EZ",
              "contentId": "uLOWEcW9V1",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 227,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Rookie",
              "style": null,
              "compatibility": 100,
              "description": "These race simulations steadily get harder and harder as the workout progresses, so don’t be too keen to increase the intensity after the first 10-minute effort if it felt “too easy.” Just wait. The pain will come.\n\n​\n\nDuring each interval, you\u0027ll be ducking and diving right under and over threshold, forcing your body to churn through all the metabolites you\u0027re producing (that\u0027s the nasty stuff that the Painsuckers love so much). This is one of the best ways to improve your FTP without really overloading your system with too much training stress.\n\n​\n\nThe final two intervals allow you to really charge over your threshold to unleash whatever power you have left in your legs. These two all-out bursts of power, in addition to the constant surges above threshold, means this session works your Anaerobic Capacity more than some of the other FTP-focused sessions.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8816666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 75,
                "intensityFactor": 0.92
              },
              "workoutId": "iPO62IOLa3",
              "contentId": "54dYn0oExU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 228,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Hell Hath No Fury",
              "style": null,
              "compatibility": 100,
              "description": "This takes one of the oldest FTP building workouts, the venerable 2 x 20, and makes it exciting. Forcing your body to churn out power right below, at, and just above threshold for 20-minute intervals dramatically improves your ability to generate sustainable power. It\u0027s great for building your FTP (unless you have an unusually low MAP...in which case you\u0027re going to find this session a bit challenging).\n\n​\n\nBy itself, the 3-minute time trial effort at the end would not be much to deal with, but after churning out threshold power for 40 minutes, hitting this 3-minute effort at 100% will ensure you stress your MAP enough to give this session a slight edge over other FTP Builder workouts.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0686111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 92,
                "intensityFactor": 0.93
              },
              "workoutId": "lVqtKuf15P",
              "contentId": "OIoXe9I4bh",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 229,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Omnium",
              "style": null,
              "compatibility": 100,
              "description": "Do you know what we love about you? Your versatility. You can Suffer anywhere, anytime, and in any way. That\u0027s why Grunter von Agony, Sufferlandrian Team Director, is sending you to compete in The Omnium at the UCI World Track Championships. Over the course of 50 minutes, you\u0027ll do battle in the six different races.\n\n​\n\nNo two intervals in this workout are the same, with each one working slightly different Neuromuscular (NM), Anaerobic Capacity (AC), and Maximal Aerobic Power (MAP) variations. No need for FTP here, friends. It\u0027s the perfect session to improve top-end power without having to do a ton of repetitive efforts.\n\n​\n\nThe Scratch Race and Flying Lap have an easy enough lead-in that you get to put your max sprint to the full test. Add in the standing starts for the Individual Pursuit and Kilo, and you give your NM a real run-through. The repeated surges of the Elimination Race, the all-out nature of the Kilo, and the massive efforts you have to make in the points race really test your powers of recovery while working your AC all the way to the max.\n\n​\n\nSince the efforts come in quick succession, and with most being over four minutes in length, your cardiovascular system never catches a real break, ensuring your MAP doesn’t get left out of the equation.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7888888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 3,
                  "map": 5,
                  "ftp": 2
                },
                "tss": 68,
                "intensityFactor": 0.93
              },
              "workoutId": "ZBJBTvvtfe",
              "contentId": "e0fpoQCSWR",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 230,
          "prospects": [
            {
              "type": "Cycling",
              "name": "It Seemed Like A Good Idea At The Time (ISLAGIATT)",
              "style": null,
              "compatibility": 100,
              "description": "When you want to increase your endurance and add some threshold work but only have two hours, this is the session you need. By adding in multiple surges and short chunks of time above threshold, ISLAGIATT overloads your system with metabolic byproducts (\u0027the nasties\u0027), which your body has to learn to clear out more efficiently.\n\n​\n\nCombining such long interval durations with these hard surges not only forces your body to cope with the effort, but it pushes you harder mentally because after each surge, the effort right at threshold “feels” harder than it should. With the final intervals focusing more on short, repeated efforts, you\u0027ll stress your body\u0027s ability to recover when deeply fatigued, making this more than just an “endurance builder\u0022 workout, but one that will help you keep churning out power deep into the final kilometers of challenging rides or events.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.8494444444444444,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 149,
                "intensityFactor": 0.9
              },
              "workoutId": "PiW27golWh",
              "contentId": "FML2PrDvkR",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 231,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Rollercoaster",
              "style": null,
              "compatibility": 100,
              "description": "Get ready for a workout designed to take you on a wild ride of intensity and focus. _RollerCoaster_ pushes you near your VO2 max, with intervals carefully broken into smaller chunks that gradually build to your peak effort before dropping slightly to keep you going. These dynamic shifts allow you to sustain high-intensity work without hitting your absolute limit the entire time. The structure ensures maximum time spent near VO2 max, boosting endurance and power while helping you mentally tackle each challenge one manageable piece at a time.\n\n​\n\nRecovery is tailored to the effort you just completed, giving your legs the reset they need to dive into the next wave of intensity. Paired with inspiring footage of the Brabantsje Pils Spring Classics, you\u0027ll feel the grit of the cobbles and the thrill of the chase as you power through climbs and recover on the descents. Remember: keep your form smooth, your breathing controlled, and your mind locked into each effort. Treat every interval as a race within the ride. The dips in intensity are there to help you, not let you off the hook—this is one ride you won’t forget!\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7883333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 4,
                  "ftp": 2
                },
                "tss": 65,
                "intensityFactor": 0.89
              },
              "workoutId": "EFRztgyTqJ",
              "contentId": "3aJ8nMrgLd",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 0,
          "type": "Cycling",
          "rank": 232,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Team Scream",
              "style": null,
              "compatibility": 100,
              "description": "Thanks to a last-minute selection, you have been drafted into a 48-kilometer Team Time Trial (TTT). Done correctly, each of the 5 riders will all cross the finish line utterly spent. Pacing is vital. A TTT is essentially one long set of Over / Under intervals. When it\u0027s your turn on the front, you will be well over your FTP, and while those pulls usually only last around 30 seconds, you\u0027ll clock almost 20 pulls over the course of 48k.\n\nPhysiologically speaking, a TTT is one of the best combined AC/MAP/FTP sessions out there. Regardless of your chosen discipline, Rider Type, or rider weakness, this effort will push you to your limits, and you\u0027ll be faster for it.\n\n​\n\nThe original inspiration for our ProRides series, Team Scream just has that bit of...how do we say..._Sufferlandrian-ness_...to make it extra special.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.1613888888888888,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 4,
                  "ftp": 5
                },
                "tss": 89,
                "intensityFactor": 0.88
              },
              "workoutId": "wjsDMXKUuk",
              "contentId": "aB01LoXAZk",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": []
    }
  ]
}