{
  "previewPlan": [
    {
      "id": "Nn09DeHc1j",
      "name": "RAPHA FAR QUEENSTAGE (no strength)",
      "weakness": "NoWeakness",
      "grouping": "Rapha Hilly",
      "category": "None",
      "subcategory": "None",
      "description": "#### **Rapha FAR Training Plan with Wahoo**\n\nThis 8-week plan is designed to prepare you—physically and mentally—for the unique demands of a Rapha FAR ride. Built with Wahoo, it combines structured indoor sessions, targeted outdoor rides, and optional cross-training like yoga, strength, and mobility to develop complete, adventure-ready fitness.\n\nWith a gradual progression in endurance, climbing ability, and ride resilience, the plan adapts to your goals and schedule. Whether you\u0027re tackling tarmac, gravel, or mountain terrain, you’ll arrive on October 4 ready to ride further—and enjoy every mile.\n\n​\n\nFind out more about [Rapha FAR events](https://content.rapha.cc/us/en/story/rapha-far).\n",
      "planDescription": "High Volume - 2:1 - Strength",
      "fixedEndDate": "2025-10-04",
      "level": "",
      "type": "Cycling",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "None",
      "progression": "None",
      "hidden": false,
      "createdAt": "2025-07-30T03:00:54.632Z",
      "updatedAt": "2025-09-02T10:31:14.641Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 28,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Cadence Builds",
              "style": null,
              "compatibility": 100,
              "description": "One of the best sessions for neuromuscular training, this drill asks you to progressively build from a cadence of 90 RPM to your MAX over 30 seconds, recover, and repeat several times. Cadence builds improve how you recruit your leg, gluteal, and core muscles throughout your pedal stroke by progressing to your maximal cadence. By reaching your highest cadence possible, you are training the \u0027on/off\u0027 switch in each muscle group to not only work faster but to have less overlap with your other muscle groups. This session trains your hamstring muscles to \u0027turn off\u0027 when your quads \u0027turn on\u0027 and vice-versa, resulting in a more efficient pedal stroke at both high and low cadences.\n\n​\n\n**LEARN MORE**\n\nListen to The Knowledge podcast, by Wahoo Sports Science - The Benefits of High Cadence Training: [https://wahoosystm.com/BenefitsofHighCadence](https://wahoosystm.com/BenefitsofHighCadence)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5480555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 5,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 21,
                "intensityFactor": 0.62
              },
              "workoutId": "04BfbUGDMk",
              "contentId": "n3WrizBr1g",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 29,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Half Monty (Ramp Test)",
              "style": null,
              "compatibility": 100,
              "description": "**Half Monty: The Easy One.**\n\n​\n\nWe recommend this fitness test for:\n\n- Newer riders\n- Athletes with limited experience pacing maximal efforts / fitness testing.\n- Those who are mid-plan or who just want to get a sense of where their fitness is.\n\nThe _Half Monty_ 4DP fitness test is the most accurate and complete ramp test available. While it\u0027s not as comprehensive or as accurate as our main fitness test, _Full Frontal_, it\u0027s far more approachable and easier to pace for new riders. It also doesn\u0027t require any special preparation. You just need to feel relatively fresh.\n\n​\n\nBased on more than a year of research (and after dozens of lab tests and thousands of online tests) and using sophisticated analysis of power and heart rate data, _Half Monty_ is far more accurate and comprehensive than standard ramp tests.\n\n​\n\nIt also tells you more about who you are as an athlete. _Half Monty_ provides you with your FTP, Maximal Aerobic Power (MAP), and Cycling Threshold Heart Rate (cTHR), all of which we use to personalize your workout targets.\n\n​\n\nIf you\u0027re still using the 4DP estimates when you set up your account, _Half Monty_ will also refine your AC and NM estimates (but will not do so if you\u0027ve done _Full Frontal_ or manually adjusted your estimates). If you want fully accurate AC and NM, as well as your Rider Type, Strengths, Weaknesses, and training plans adjusted to those Strengths and Weaknesses, you\u0027ll need to expose yourself to the _Full Frontal_ 4DP fitness test.\n\n​\n\nReady to climb the ramp? You\u0027ll need the following before you start:\n\n- A heart rate monitor if you want the most accurate results. Don\u0027t have one? Order one [HERE](https://wahoofitness.com/devices)\n- Some kind of power device connected (trainer, power meter, virtual power, etc.)\n- Be ready to pay close attention to the instructions in the workout\n- Be sure your profile is complete and up-to-date (Profile \u003E About You). Accurate information helps us make our calculations\n\n**LEARN MORE**\n\nListen to \u0027[Why Fitness Testing Matters](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/testing-testing-1-2-3-why-fitness-testing-matters)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n\n​\n\n[Here\u0027s some more information on how to get the most from your fitness test.](https://wahoosystm.com/HelpCenterFitnessAssessment)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9666666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 5,
                  "ftp": 3
                },
                "tss": 71,
                "intensityFactor": 0.85
              },
              "workoutId": "0SmbqUIZZo",
              "contentId": "OIJSfIrGTL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 30,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Frozen Road",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2017): From the creator: \u0022Self-shot and edited whilst cycling around the world, this film charts a winter journey into the Canadian Arctic as I completed my bike ride up the American continent. Compelled by Jack London’s assertion, that ‘any man who is a man can travel alone,\u0027 I sought an adventure of perfect solitude. Yet, as I came to realize, the harsh truths of traveling in such a formidable environment were a long way from the romantic images I’d held of this land. _The Frozen Road_’ is an honest reflection on my solo trip; of the wonder, terror and frustration I experienced when riding through the unforgiving emptiness of one of the world’s ‘last great wildernesses.\u0022\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.41805555555555557,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 8,
                "intensityFactor": 0.44
              },
              "workoutId": "bHz6eBsicH",
              "contentId": "fwzyQcEcGW",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 31,
          "type": "Cycling",
          "rank": 206,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Low Cadence Progression 1: 4 Sets 4 x 60/60",
              "style": null,
              "compatibility": 100,
              "description": "Unlike other progression series we don’t change the number of intervals or interval duration for these efforts. Instead, we gradually increase the intensity of the given intervals. By gradually increasing the intensity at the same cadence, we only focus on increasing the torque in each session. It’s important to respect this slow progression to maximize adaptation and reduce risk of injury by giving your tendons and ligaments time to adjust to higher torque loads.\n\n[\nHow to incorporate this session into my training](https://wahoox.forum.wahoofitness.com/t/new-cadence-progression-novids/24715)\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[When to Train with Low Cadence](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/when-to-train-with-low-cadence)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 4,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 38,
                "intensityFactor": 0.64
              },
              "workoutId": "kJzmg34UrI",
              "contentId": "vVAEUMA1Zj",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 33,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Surges: 4 x 12",
              "style": null,
              "compatibility": 100,
              "description": "Yep, there are good chunks of sub-threshold in here. But what makes this session special are the surges above threshold during each effort. Your body\u0027s ability to clear metabolites and process oxygen doesn\u0027t really change at 90% of FTP and above. What that means it that whether you are at 90% or 100% of FTP your body is clearing those things out at the same rate. It\u0027s just that at FTP your body is producing more of those metabolites that it is capable of clearing.\n\n​\n\nBy surging above FTP you are creating metabolites faster than your body can clear them. If you were to settle into 100% of FTP, you would only be clearing things out at the rate you are producing them. That means whatever you have produced from that surge will just stay there. By dropping just below FTP your body is clearing things out faster than you are producing them. That means that the excess you got from that surge will slowly be cleared out.\n\n​\n\nEach time a surge pops up during this workout, your body should have just about cleared what was made from the last surge. Not only does this push your body\u0027s ability to clear these things to the max, but it also teaches your mind to deal with the discomfort of burning lungs and legs associated with these efforts at or above threshold.\n\n​\n\nA simpler way to think of this is that you are teaching your body and mind to \u0022recover\u0022 just below FTP. Not only does this help bump up your FTP, but it also helps you recover that much faster anytime you let off the gas, whether for a downhill, turn, or finding a good draft. Having the confidence that you can recover while feeling so uncomfortable can mean the difference between hanging onto to a new personal best and completely throwing in the towel.\n\n​\n\nThis is the perfect session to practice your positive thinking from the Mental Toughness Program (If you haven\u0027t checked that out already you definitely should!).\n\n​\n\n**Warm Up**\n\n20 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 5.5 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 4\n\nRest between sets: 10 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval repeats per set: 4\n\n**Interval**\n\nWork: 30 seconds @ RPE 8.5 -- 120% of FTP -- HR \u003E105%\n\nSteady: 2 minutes 30 seconds @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\n25 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down**\n\n7 minutes @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 144,
                "intensityFactor": 0.76
              },
              "workoutId": "s5sAaVHynn",
              "contentId": "SRmKoBMs0m",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 34,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance  4",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\n​\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm-Up**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 11\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set: 1\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 4,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 144,
                "intensityFactor": 0.6
              },
              "workoutId": "nbj9gXANpP",
              "contentId": "R53DW65pkI",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 35,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Adventure For All 2023",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2023): As one of Wahoo\u0027s close partners, Adventure For All\u0027s mission is to guide individuals with exceptionalities through life-changing adventures while creating innovative educational practices that ignite a shift in societal belief systems.Together we will guide individuals with exceptionalities through life-changing adventures while creating innovative educational practices that ignite a shift in societal belief systems.\n\n​\n\n**Experience the Adirondacks:**\n\nJoin four exceptional athletes in the Adirondack mountains on the adventure of a lifetime. These athletes challenge themselves, conquer fears, and demonstrate their ability to overcome obstacles, proving to themselves and the world they can achieve anything.\n\n​\n\n**Finish:**\n\nWitness Riley, a remarkable young man with Autism and Tourette\u0027s, as he pedals beyond expectations to conquer the challenging 31\u002B mile Big Sugar gravel bike race. This isn\u0027t just a story about cycling; it\u0027s a journey of courage, hope, and the shattering barriers. With the unwavering support of his mom and the dedicated team at Adventure For All, Riley\u0027s adventure redefines what\u0027s possible, turning every pedal stroke into a victory for him and everyone who believed in his endless potential.\n\n​\n\n[**Find out more about Adventure For All**](https://adventureforall.org/)\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5466666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 23,
                "intensityFactor": 0.65
              },
              "workoutId": "V5zohITfhI",
              "contentId": "UhvP0tN6z6",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 36,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Do As You\u0027re Told",
              "style": null,
              "compatibility": 100,
              "description": "The little voice in your head is telling you to stop. The screams from your legs are nearly deafening. But you hear none of it. You\u0027re following orders to ATTACK.\n\n​\n\nThis is the story of two men in a car—your team directors—who guide you to GLORY. Ignore them at your own risk: They will not tolerate insubordination.\n\n​\n\nIn this session, you\u0027ll tackle two sets of 11 intervals each. The first set has high-intensity efforts with matching recoveries. This pushes your body\u0027s ability to recover right to the limit -- just what you need to improve Anaerobic Capacity (AC). The shorter, super-high intensity efforts also help with your Neuromuscular Power (NM). The second set features inverse intervals with opposite efforts and recoveries. This really depletes your body\u0027s AC, so you need to rely on your aerobic system. This helps develop your Maximal Aerobic Power.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7077777777777777,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 5,
                  "nm": 2,
                  "map": 4,
                  "ftp": 1
                },
                "tss": 57,
                "intensityFactor": 0.9
              },
              "workoutId": "q7Keljwoqq",
              "contentId": "89HeFQSbGE",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 37,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "London-Edinburgh-London",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2016): London Edinburgh London follows a group of cyclists from around the world on a remarkable feat of endurance. Join their ride up the length of Britain - from London to Edinburgh and back again - in under five days. Traveling over 1400km, a continuous distance far further than most of them had ever ridden before, our unlikely and eccentric heroes are not only tested physically but face the mental challenge, \u0022can I push myself further? Can I go one more day?\u0022.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9088888888888889,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 32,
                "intensityFactor": 0.6
              },
              "workoutId": "u3Zi4ltMFp",
              "contentId": "9SXTIEdocd",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 38,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Phil wins the Tour",
              "style": null,
              "compatibility": 100,
              "description": "Join Phil Gaimon in his bid to “win the Tour” as he takes on France’s most iconic mountains—The Tourmalet, Mont Ventoux, Alpe d’Huez and Galibier. This session captures the feel of those legendary ascents with 4 x 10-minute descending threshold intervals. Each one starting above threshold before easing down, forcing you to pace smart, clear the burn, and stay locked in until the summit.\n\n​\n\nBetween climbs, you’ll get some recovery—time to spin the legs and imagine soaking in the views (or raiding a French bakery, Phil-style).\n\n​\n\nPhysiologically, you’ll build muscular endurance, improve your ability to process oxygen, and train your body to go deep without breaking. Mentally, you’ll sharpen pacing skills and resilience—the hallmarks of any great climber.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9830555555555556,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 81,
                "intensityFactor": 0.91
              },
              "workoutId": "BqNqT59BWH",
              "contentId": "wvpZ4nx37B",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 40,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sub-Threshold With Starting Surge: 3 x 20",
              "style": null,
              "compatibility": 100,
              "description": "The idea behind this session can be seen in Who Dares, Fight Club, and Standing Starts into sustained efforts. Your bodies ability to clear out metabolites and process oxygen is nearly identical between 90% of FTP and 100% of FTP, the difference is that at 100% of FTP your body is producing those metabolites at the same rate it is clearing them. At 90% of FTP your body can clear things at the same rate, but your body isn\u0027t producing them at the same rate.\n\n\nLong Sub-Threshold efforts represent an effort that your body can just about handle (assuming you are properly fueled and not completely exhausted), clearing things out faster than they can accumulate. To really stress that clearance rate each of these Sub-Threshold efforts start with a 20-second effort well above FTP. By the time you settle into the Sub-Threshold effort, your body will be flooded with those metabolites that cause your legs and lungs to burn. However, since you are below FTP (clearing things out faster than you are producing them), the concentration of those metabolites will slowly drop over the course of the whole effort. Not only does this train your body to clear things faster, but it will also mentally prepare for the discomfort associated with efforts above FTP.\n\n​\n\nFor this session, we are asking you to dance on that razor\u0027s edge of your FTP, ideally the side that allows you to complete the session. If your legs or lungs aren\u0027t feeling great, you are better off dropping the steady effort by 5% and keeping the starting effort at 100%.\nAnother component of this is settling into a good rhythm of breathing and pedaling. Everyone has a preferred cadence, and this is an instance where your preferred cadence supersedes the cadence targets onscreen. We want you dancing right on that edge of your comfort, and you can get much closer to that edge riding your preferred cadence.\n\n​\n\n**Warm Up **\n\n20 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 5.5 -- 85% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n30 seconds @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n6 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort **\n\nNumber of Sets: 3\n\nRest between sets: 10 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval repeats per set: NA\n\n**Interval**\n\n20 seconds @ RPE 9.5 -- 180% of FTP -- HR \u003E105%\n\n20 minutes @ RPE 6.5 -- 90% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume **\n\n55 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down **\n\n4 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 3,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 169,
                "intensityFactor": 0.75
              },
              "workoutId": "sTj8pRKYHm",
              "contentId": "FXmGn7TLSJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 41,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance  4",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\n​\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm-Up**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 11\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set: 1\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 4,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 144,
                "intensityFactor": 0.6
              },
              "workoutId": "nbj9gXANpP",
              "contentId": "R53DW65pkI",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 42,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Other French Race",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Rupert Guinness entered the Haute Route Alps in France looking for a new challenge to test his physical and mental strength. But after 800km of cycling through the Alps from Nice to Megève, the cycling journalist and author realized that the experience had delivered to him and the 400-plus starters something far greater. It had provided them with the adventure of a lifetime; from a sense of what it would be like to ride in the fabled Tour de France that he has reported on more than 30 times, to the creation of friendships with fellow riders forged by their shared suffering and encouragement for one another as they cycled through some of the toughest and most spectacular mountains that cycling has to offer.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5291666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 19,
                "intensityFactor": 0.6
              },
              "workoutId": "fiQklsxqiH",
              "contentId": "X7LsDQ8h23",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 43,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Bavaria: Burgberg",
              "style": null,
              "compatibility": 100,
              "description": "This may be a short workout, but it packs a serious punch—so lace up those gloves and get ready for 22 powerful 10-second seated sprints!\n\nAfter a gentle warm-up leaving the picturesque village of Sulzberg, we’ll dive straight into our first block: 8 x 10-second high-cadence seated sprints with 50 seconds of recovery.\n\nAs the road naturally levels out, we’ll catch our breath before hitting the core of the workout—9 x 10-second low-cadence seated sprints with the same 50-second recovery, focusing on maintaining rock-solid form.\n\nTo close things out, we’ll return to the high-cadence style for a final round of 5 x 10-second sprints. This session is designed to sharpen muscle activation and improve recovery after intense efforts.\n\nFinish strong, and I’ll see you in Burgberg!\n\n​\n\nWith short near-maximal sprint efforts like these, you’ll recruit all of the muscle fibers in your legs. While cadence builds force your muscles to contract and relax as quickly as possible, this session forces your muscles to contract with maximal power. Just like cadence builds, this session becomes one of the best ways to train your neuromuscular system.\n\nEven if your target event does not require you to complete maximal sprints, there is a substantial trickle-down efficiency effect to the longer-duration power efforts when you train your neuromuscular system.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/9866624296)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5877777777777777,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 5,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 22,
                "intensityFactor": 0.66
              },
              "workoutId": "HK7BfIhBuZ",
              "contentId": "YvxZv18RNn",
              "notes": "\\*Before Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 44,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Clobber",
              "style": null,
              "compatibility": 100,
              "description": "The 3x25-minute sub-threshold workout is one of the most classic interval sessions out there, so prepare for a trip to the northern Painlands for this FTP-builder. The reason the 3x25 sub-threshold workout is so popular is that it is easy to follow, helps teach good pacing, and gives you a great threshold training stimulus.\n\n​\n\nIn this case, you\u0027re looking at three, (roughly) 25-minute blocks at around 90% of your FTP, an effort we refer to as \u0022Sub-Threshold\u0022. Many refer to this intensity as \u0022Sweet-Spot\u0022, but we prefer Sub-Threshold, as the real key is to never let your power creep above your FTP. Staying just below threshold ensures that your effort remains at an intensity you know your body can handle but that is close to what would not be sustainable.\n\n​\n\nThe only way you\u0027re going to make it through three of these efforts is if you pace yourself properly. Everyone feels just fine for the first 5 minutes of the first effort, and are often tempted to go harder. Don\u0027t be that person. More often than not, that person blows up spectacularly in the second interval, unable to finish the session. Or they have to ride that second interval at lower power, turning it into a Tempo session, which is not the goal.\n\n​\n\nGetting a sense of how these efforts \u0022bite\u0022 towards the end is vital to learning how to pace yourself over longer steady-state efforts; whether that\u0027s a time trial, local climb, breakaway, triathlon, or even a good old fitness test. In each of those cases, the pacing is key. Learning how your perceived effort can steadily climb even though your power remains unchanged is critical to good pacing.\n\n​\n\nSo how do you know if you are doing this one right? As we said, the first 5 minutes should feel relatively easy. Around that 5-minute mark, your heart rate should stop climbing, and settle into 2-5% below your Lactate Threshold Heart Rate (LTHR). If your heart rate is climbing for the entire effort and goes above your LTHR, then you are going too hard.\n\nIf you hit the 10-minute mark, your legs feel fine, and your heart rate is still in Zone 3, then you aren\u0027t going hard enough.\n\nIf you\u0027ve never done a session like this before, you can consider only doing the first 20-minute effort, or even sticking to just the first 15 minutes of each effort. There\u0027s no shame in building up to this full session, so don\u0027t be afraid to pause and fast forward as needed.\n\n​\n\nNailing this session is really about getting in tune with your body and understanding what the edge between a sustainable and an unsustainable effort feels like. Not being able to complete this workout is fairly common, so don\u0027t beat yourself up if you can\u0027t make it through the first few times. As long as you come away from this session with a better understanding of how to pace longer efforts, you\u0027ve improved as an athlete.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.7722222222222221,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 117,
                "intensityFactor": 0.81
              },
              "workoutId": "2z5P3w619N",
              "contentId": "JpDMHRZtaB",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 45,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "# Getting Away With It (November Groundwork Challenge)",
              "style": null,
              "compatibility": 100,
              "description": "This workout is part of the Wahoo X Monthly Challenge. Click [\u002B\u002Bhere\u002B\u002B](https://wahoox.forum.wahoofitness.com/t/wahoo-november-challenge-groundwork/30430) to find out more.\n\n​\n\nWouldn\u0027t it be great if you could leave work to go for a ride? Even for an hour? Well, now\u0027s your chance. _Getting Away With It_ gets you out of the office and onto the roads of the French Pyrenees with your guide Michael Cotty of The Col Collective.\n\n​\n\nThis is a great session to add toward the end of a training block. The shorter duration, sub-threshold efforts are fantastic for getting some extra FTP building while you are in a fatigued state. Extra emphasis on cadence stresses your nervous system, making your body more efficient at higher and lower RPMs while improving your form. The Neuromuscular training you get from this session is fantastic, so while your power never exceeds threshold, your body will learn to bring more energy to the pedals at all intensities.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.74,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 45,
                "intensityFactor": 0.78
              },
              "workoutId": "ZF95hVWWkr",
              "contentId": "P2T4sgv1yX",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 47,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance 4.5",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week. Shorter Endurance rides (like this one) can fit in both a hard week of training and a recovery week. That is, only if you do it right!\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022\n\nSo what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70%, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.)\n\nYour heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm\n\nAlso, your RPE should be a 2-3\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm-Up**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set: 13\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C85%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 4.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 162,
                "intensityFactor": 0.6
              },
              "workoutId": "E3d7Q2PBhB",
              "contentId": "RkSr1mWgWe",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 48,
          "type": "Cycling",
          "rank": 210,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Sprints: 15 x 10s",
              "style": null,
              "compatibility": 100,
              "description": "This is a session that you\u0027ll want to complete in Level, rather than Erg, mode. The only time we would suggest Erg mode is if you are unable to maintain the lower power targets set between sprints.\n\nWith short maximal sprint efforts, you\u0027ll recruit every muscle fiber you have in your legs each effort. While cadence builds force your muscles to contract and relax as quickly as possible, this session forces your muscles to contract with maximal force. Just like cadence builds this session becomes one of the best ways to train your neuromuscular system. Even if your target event does not require you to complete maximal sprints, there is a substantial trickle-down effect to the longer duration power efforts when you train your neuromuscular system.\n\nThis session is a great alternate to cadence builds or standing starts for those completing our SUF Strength sessions. On days you complete off the bike strength work you want your on-bike training to complement the suffering you put yourself through off the bike. That means short maximal efforts (whether for power or for cadence) are the best workouts to complement the strength gains you\u0027ve made off the bike.\n\nAs long as you run this session in slope mode you can complete the sprints either seated or out of the saddle. For those competing in events that do not require much (if any) standing (such as Time Trials or Triathlons) you should complete these sprints seated (and in the aero bars or drops if that is where you are racing).\n\nYou should also do these efforts seated if you don\u0027t feel an out-of-the-saddle maximal sprint is stable/safe to do on your trainer. Regardless of using ERG or Slope mode, you do not want to hold anything back on any sprint. Seeing your peak power drop as the session goes on is totally normal as your legs fatigue. This is where RPE really becomes the most important metric, rather than power, heart rate, or cadence.\n\nNow get on that bike and CRUSH IT!\n\n​\n\n**Warm-Up**\n\n10 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets\n\n1\n\nRest Between Sets:\n\nN/A\n\nInterval Repeats per Set:\n\n15\n\n**Interval:**\n\nSprint 10 seconds @ RPE 10 -- MAX SPRINT\n\n**Recovery:**\n\n9 minutes 50 seconds @ RPE 3 -- 55% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 4,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 143,
                "intensityFactor": 0.72
              },
              "workoutId": "Dw1Voo4zvi",
              "contentId": "9idRMjKBqD",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 50,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 1",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.42527777777777775,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "SxPJhao9ey",
              "contentId": "pbFOwRxEMY",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 51,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
              "style": null,
              "compatibility": 100,
              "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6011111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 20,
                "intensityFactor": 0.62
              },
              "workoutId": "rUrrfvb8ii",
              "contentId": "p6E2zIaYNZ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 52,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 2",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4072222222222222,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "MGb1NCbPVj",
              "contentId": "saI89XPgSw",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 53,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Wahoo Frontiers 2023",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2023): Discover the incredible stories behind some of this year\u0027s top Wahooligan athletes:\n\n**Chelsea Sodaro** is the reigning IRONMAN World Champion, but beyond her athletic prowess, Chelsea\u0027s greatest source of pride is her ability to show up for herself and her daughter. Chelsea shares the power of finding her voice, advocating for female athletes, and why motherhood is her most significant victory to date. Follow Chelsea\u0027s journey to defending her World Champion title in 2023.\n\n​\n\n**Heather Jackson:** As one chapter closes, a new one opens. After 15 years as a professional triathlete, Heather Jackson decided to challenge herself in new ways, build a fresh community, and push her own and other\u0027s expectations of what is humanly possible. In June, Heather tackled the Unbound Gravel 200, often hailed as the \u0022Super Bowl\u0022 of gravel bike racing, and the iconic Western States Endurance Run, the world’s oldest 100-mile trail race. Facing these demanding events with just a two-week gap between them, the question looms: how will Heather approach her most ambitious goal yet?\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4633333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 18,
                "intensityFactor": 0.61
              },
              "workoutId": "9EF5bV6urQ",
              "contentId": "WXEfWZDJkJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 54,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Cadence Drills (Builds/Holds/Single Leg)",
              "style": null,
              "compatibility": 100,
              "description": "This workout combines several technique driven intervals. These will improve your overall form and efficiency on the bike. The first two drills, Cadence Holds and Builds, are designed to improve the way you recruit your leg, glute and core muscles throughout your pedal stroke. They do this by forcing you to sustain a cadence just above \u0027comfortable\u0027 and by pushing you to your maximal cadence.\n\n​\n\nThe last drill, Single Leg Efforts, ask you to unclip one leg and ride at a steady, single-legged effort. This forces you to pull up on the pedal instead of just pushing down and ensures maximal muscle awareness and engagement. This workout is best done while riding indoors on a trainer because even small variations in terrain can affect your ability to properly execute this workout. The majority of this workout is done in heart rate Z1/2 /// 50-75% of threshold /// RPE 2-5. You should keep the effort level below threshold (heart rate Z4, 100% of threshold, RPE 7-8) during the max cadence efforts.\n\n​\n\nWORKOUT GOALS:\n\n- To improve stillness and stability at high cadences.\n- To improve muscle fiber engagement for improved efficiency at all cadences.\n- To increase maximum cadence.\n- To make that pedal stroke as smooth as butter.\n\nCADENCE TARGETS:\n\n- Warm-up 80-90rpm\n- Build: 90-150rpm\n- Hold: 115rpm\n- Single Leg: 85rpm\n\nListen to The Knowledge podcast, by Wahoo Sports Science - The Benefits of High Cadence Training: [https://wahoosystm.com/BenefitsofHighCadence](https://wahoosystm.com/BenefitsofHighCadence)\n\n​\n\n**Warm Up**\n\n7 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3 -- 65% of FTP -- HR \u003C70%\n\n1 minute @ RPE 4 -- 75% of FTP -- HR \u003C70%\n\n3 minutes @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest Between Sets: 8 minutes @ RPE 23 -- 55% of FTP -- HR \u003C70%\n\nInterval Repeats Per Set: N/A\n\n**Interval**\n\nCadence Build: 30 seconds @ RPE 8 -- Starting at 90RPM Build to Max RPM -- Max Power is NOT Goal\n\nRecovery: 1 minute @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\nCadence Hold: 45 seconds @ RPE 7.5 -- \u003C100% FTP -- Highest RPM you can hold without Bouncing\n\nRecovery: 1 minute @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\nSingle Leg: 1 minute @ RPE 6 -- Single Leg Only -- \u003C50% of FTP\n\nRecovery: 1 minute @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\nSingle Leg: 1 minute @ RPE 6 -- Single Leg Only, Opposite Leg -- \u003C50% of FTP (100% of FTP with both legs = 50% of FTP\n\nwith one leg)\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n8 minutes 15 seconds @ RPE 2.5 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 5,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 30,
                "intensityFactor": 0.57
              },
              "workoutId": "pUYFYJKAdW",
              "contentId": "4WAO6FqueU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 55,
          "type": "Cycling",
          "rank": 204,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance 2.5",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\n​\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right! Most people ride too hard when they head out for their \u0022base miles.\u0022\n\n​\n\nTruth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like? For 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm. Also, your RPE should be a 2-4.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm-Up**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 7\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set: 1\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C85%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n2 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2.5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 90,
                "intensityFactor": 0.6
              },
              "workoutId": "UJcZc8Cvvt",
              "contentId": "L4074aY4fG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 57,
          "type": "Cycling",
          "rank": 205,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Big Gear MAP: 3 Sets 6 x 30s",
              "style": null,
              "compatibility": 100,
              "description": "This session is the second in a progression focused on building MAP power at low cadence, improving your muscular endurance. This session includes 3 sets of 6 X 30s intervals at 100% of MAP power at 60 RPM with 90s recovery at 50% of FTP and 80 RPM.\n\nWhile the efforts have a MAP target, your heart rate will not likely go over Zone 4 due to the short duration of the efforts and the low cadence targets.\n\n​\n\n**Warm Up**\n\n30 seconds @ RPE 1 -- 40% of FTP -- HR \u003C70%\n\n30 seconds @ RPE 1.5 -- 45% of FTP -- HR \u003C70%\n\n1 minute @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 4 -- 70% of FTP -- HR \u003C70%\n\n30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n30 seconds @ RPE 6 -- 90% of FTP -- HR \u003C100\n\n30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n30 seconds @ RPE 8.5 -- 100% of FTP -- HR \u003E105%\n\n45 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n15 seconds @ RPE 9 -- 100% of MAP -- HR \u003E105%\n\n45 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n15 seconds @ RPE 9.5 -- 90% of AC -- HR \u003E105%\n\n1 minute 30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 3\n\nRest Between Sets: 4 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\nInterval Repeats Per Set: 6\n\n**Interval**\n\nEffort: 30 seconds @ RPE 9.5 -- 103% of MAP -- HR \u003E105%\n\nRecovery: 1 minute 30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n2 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C70%\n\n3 minutes 30 seconds @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 1.5 -- 45% of FTP -- HR \u003C70% 1 minute @ RPE1 -- 40% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 4,
                  "map": 5,
                  "ftp": 3
                },
                "tss": 58,
                "intensityFactor": 0.76
              },
              "workoutId": "xHrXYvJZGA",
              "contentId": "2kYaCQtsVG",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 58,
          "type": "Cycling",
          "rank": 208,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Low Cadence Progression 2: 4 Sets 4 x 60/60\t",
              "style": null,
              "compatibility": 100,
              "description": "Unlike other progression series we don’t change the number of intervals or interval duration for these efforts. Instead, we gradually increase the intensity of the given intervals. By gradually increasing the intensity at the same cadence, we only focus on increasing the torque in each session. It’s important to respect this slow progression to maximize adaptation and reduce risk of injury by giving your tendons and ligaments time to adjust to higher torque loads.\n\n[\nHow to incorporate this session into my training](https://wahoox.forum.wahoofitness.com/t/new-cadence-progression-novids/24715)\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[When to Train with Low Cadence](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/when-to-train-with-low-cadence)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9166666666666666,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 5,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 44,
                "intensityFactor": 0.69
              },
              "workoutId": "j3X7PXPYZG",
              "contentId": "bP7shJDFNU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 59,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Costa Blanca: Coll de Rates",
              "style": null,
              "compatibility": 100,
              "description": "This session is all about building your VO₂ Max power with a focus on pacing. You’ll start with a flat warm-up to get the body ready before diving into a progressive series of ramping intervals. Each interval gets shorter but more intense, pushing your cardiovascular system while keeping your legs working under control. The aim is to help you finish strong — not fade — by learning how to pace properly through effort buildup.\n\n​\n\nSet on the steady slopes of Coll de Rates, the consistent gradient supports rhythm and control, allowing you to focus on cadence, breathing, and technique as you go deeper into the red. The final threshold block adds bonus training stimulus and flushes the legs under fatigue. This is a session that builds smarter, stronger climbers — from both a physical and mental standpoint.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/14035783847)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9627777777777777,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 2,
                  "map": 4,
                  "ftp": 4
                },
                "tss": 75,
                "intensityFactor": 0.92
              },
              "workoutId": "u8zsArm1IE",
              "contentId": "XZs1YfQZ6N",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 61,
          "type": "Cycling",
          "rank": 207,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Tempo Cadence Build: 1 x 60",
              "style": null,
              "compatibility": 100,
              "description": "While the single tempo effort you complete in this session is steady in terms of power, it\u0027s the specific cadence targets that set this session apart from other tempo workouts.\n\n​\n\nEven though an effort at 80% of FTP might seem \u0022easy\u0022, the truth is your body is working at processing oxygen and metabolites at nearly the same rate as when you are right at FTP. The difference is that the overall stress on your system when riding tempo is considerably less than while riding at FTP. That means you can either have harder days before or after a tempo session (compared to a threshold session) or you can increase the duration of those tempo efforts to make the overall training stimulus equal (or greater) than completing several repeats right at your FTP.\n\n​\n\nThis tempo effort is divided into 3 segments of equal duration. While the power is the same across all segments, your target cadence starts off low and increases with each new segment from 60rpm, 75rpm and finally 95rpm. Starting with a long block of low cadence should fatigue your muscles from the start of your effort. As the effort builds and you create more fatigue, the increased cadence targets will place a greater demand on your cardiovascular system. That will feel like a nice break given the load you have been putting on your muscular system. The cadence targets in the final segment will force your fatigued muscles to maintain good coordination as the faster cadence requires your muscles to switch \u0022on\u0022 and \u0022off\u0022 at a faster rate. Between the low-RPM sections and the high-RPM work under fatigue, this tempo session not only helps train your FTP, but also benefits your neuromuscular system.\n\n​\n\nYou can expect your heart rate to remain low for the power targets during the low cadence segment at the start. As the effort progresses and you reach the final 10 minutes of the high rpm segment, your heart rate might go over Z3, which is not something to worry about. While this session appears \u0022easy\u0022 at first glance, don\u0027t be surprised if your legs are feeling it the next day.\n\n​\n\n**Warm Up**\n\n30 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n1 minute @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\n1 minute @ RPE 8 -- 105% of FTP -- HR \u003C100%\n\n7 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 3\n\nRest between sets: NA\n\nInterval repeats per: NA\n\n**Interval**\n\nBuild 1: 20 minutes @ RPE 5 -- 80% of FTP -- HR \u003C80% at 60rpm\n\nBuild 2: 20 minutes @ RPE 5 -- 80% of FTP -- HR \u003C80% at 75rpm\n\nBuild 3: 20 minutes @ RPE 5 -- 80% of FTP -- HR \u003C80% at 95rpm\n\n​\n\n**Extra Volume**\n\n1 hour 15 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 3,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 143,
                "intensityFactor": 0.69
              },
              "workoutId": "fpZaZRj2CV",
              "contentId": "H2q1ObW6fL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 62,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Tempo Increasing: 30/20/10/5min",
              "style": null,
              "compatibility": 100,
              "description": "In this workout, the shorter the interval duration, the higher the power target will be. Starting from 30 minutes of low Tempo, and finishing with 5-minutes of high-quality MAP work, proper pacing is crucial to success in this workout. While you could easily be above target power for the entire 30-minute effort, that would set you up to fail in the last two efforts. Be smart and pace yourself; you can always go harder in the final 5-minute effort if you want to!\n\n​\n\nAt any intensity above Endurance pace, the longer you ride, the more fatigued you become. Completing the final 5-minute target when fresh would be unpleasant, hitting it after all of these other intervals makes it a near maximal effort. Proper hydration/cooling and nutrition are vital if you want to nail this workout.\n\n​\n\nIf you are preparing for any longer ride/event where you will be required to keep on the gas from start to finish, this is the perfect session for you. Completing these efforts in this order not only gives a great physical training boost, but it also toughens you up mentally. Digging deep when fatigued is the key to good performance over longer distances, so expect to suffer in that final 5-minute effort; it will pay off both mentally and physically!\n\n​\n\n**Warm Up**\n\n30 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 4, each unique\n\nRest between sets: 12 minutes @ RPE 2.5 -- 55% of FTP -- HR \u003C70%\n\n**Set 1**\n\n30 minutes @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n**Set 2**\n\n3 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\n1 minute @ RPE 8 -- 105% of FTP -- HR \u003C100%\n\nrepeat 5 times\n\n**Set 3**\n\n1 minute @ RPE 8 -- 105% of FTP -- HR \u003C100%\n\n8 minutes @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n1 minute @ RPE 8.5 -- 120% of FTP -- HR \u003E105%\n\n**Set 4**\n\n1 minute @ RPE 8 -- 105% of FTP -- HR \u003C100%\n\n1 minute @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\n1 minute @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n1 minute @ RPE 8 -- 105% of FTP -- HR \u003C100%\n\n1 minute @ RPE 9.5 -- 180% of FTP -- HR \u003E105%\n\n​\n\n**Extra Volume**\n\n55 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down**\n\n7 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 3.4166666666666665,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 3,
                  "ftp": 5
                },
                "tss": 187,
                "intensityFactor": 0.74
              },
              "workoutId": "X1zo1Mprz2",
              "contentId": "OtI5RHgUEm",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 64,
          "type": "Cycling",
          "rank": 211,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Model",
              "style": null,
              "compatibility": 100,
              "description": "They say that beauty is in the eye of the beholder. And through the bleeding eyes of Sufferlandrians, what could possibly be more beautiful than the sharp, saw-tooth profile of the workout you see before you? Full of gorgeous, shapely, shimmering blocks of yellow Maximal Aerobic Power (MAP) efforts interspersed with mercifully brief and slightly inadequate recoveries, it\u0027s a real stunner.\n\n​\n\nBut you know what\u0027s even better looking than this alluring workout? You (after you\u0027ve completed the workout, that is). Originally designed by our Head of Sports Science, Neal Henderson, for his professional athletes, The Model is a beautiful portrait of MAP brutality. It\u0027s one of those sessions that you think you can\u0027t finish, but always somehow do. It will leave you breathless, feeling all tingly, a bit confused and lying in a blubbering heap. It\u0027s a look. It will also deliver a nice boost to your fitness that always looks and feels good.\n\n​\n\nA true love letter to the beauty of professional cycling, The Model features a banging soundtrack and thrilling footage from both the men\u0027s and women\u0027s pelotons. With its eclectic design, effects, and graphics, you\u0027ll find yourself unable to tear your eyes away from the action on screen (assuming you can lift them from your stem).\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9844444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 3,
                  "nm": 1,
                  "map": 5,
                  "ftp": 5
                },
                "tss": 86,
                "intensityFactor": 0.9
              },
              "workoutId": "WQk9TYaUhj",
              "contentId": "NkctG9Onu1",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 65,
          "type": "Cycling",
          "rank": 212,
          "prospects": [
            {
              "type": "Cycling",
              "name": "The Way Out",
              "style": null,
              "compatibility": 100,
              "description": "One of the few Sufferfest sessions that can be viewed as a sweet-spot session since the intervals aren’t above threshold (except for the very end) but are harder than a tempo effort.\n\n​\n\nThis session pushes your body close to the limit of what it can comfortably handle without going any further. Why? Going above threshold causes a considerable amount of hormonal stress that takes a lot of time to recover from. But you don’t actually have to ride above threshold to improve your FTP. The difference in fitness gains between 30 minutes at 90% of threshold and at 102% of threshold is minimal. Still, the stress on your body from the latter is much greater, and the recovery much longer.\n\n​\n\nThat\u0027s why this session is a key component to any training plan: It gives you enough training stress to help improve your FTP but remains \u0027easy\u0027 enough that you can do it when you\u0027re tired or before a big block of harder efforts.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9836111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 5
                },
                "tss": 68,
                "intensityFactor": 0.83
              },
              "workoutId": "sG7DReLUhT",
              "contentId": "AnUAo2ZSsd",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 66,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Bavaria: Fischen",
              "style": null,
              "compatibility": 100,
              "description": "Meandering along the scenic River Iller, it’s time to break out your gravel bike for a classic cadence build and hold session. We’ll kick off with 5 x 30-second cadence builds, allowing for 2 minutes of recovery between each, before moving on to 5 x 60-second cadence holds, again with 2 minutes recovery.\n\nWhile this session may be short, it’s a key part of your weekly plan, designed to keep you efficient and in top form, even when the cadence ramps up. Stay smooth and steady—and remember, “no bobbing!”\n\n​\n\n**Cadence Builds:** The name of the game here is absolute peak cadence, not peak power. To achieve this, you need to be in a small gear and have very light resistance. Starting at 90-RPM, steadily increase your cadence until you reach your absolute max with about 5-seconds left, and hold that to the end. Your limiting factor on these efforts needs to be leg speed. If resistance/power output is your limiting factor, try starting in an easier gear, or shift into an easier gear 15-seconds in. Bouncing in the saddle is okay for this drill.\n\n​\n\n**Cadence Holds**: These efforts require you to maintain the highest cadence you can without starting to bounce in the saddle. For some of you that will be 100-RPM, for others, it will be 150-RPM. The key is to settle into YOUR peak sustainable cadence. Like the Builds, the goal here is not high power, so these efforts are limited to 90% of FTP. Do not be surprised if your heart rate is well into Zone 4 by the time you hit the last few holds.\n\n\nTo properly execute this session, your effort between drills needs to be low. With limited recovery time between these maximal Neuromuscular Efforts, riding above Zone 1 between efforts will only reduce your ability to max out your cadence. While the power targets between are Zone 1, do not be surprised if your heart rate does not drop below Zone 2 after the first couple builds.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/9885886076)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.5863888888888888,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 5,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 27,
                "intensityFactor": 0.64
              },
              "workoutId": "YqH2WM26O4",
              "contentId": "lmSFFXOtNE",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 67,
          "type": "Cycling",
          "rank": 209,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Wahoo Frontiers 2023",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2023): Discover the incredible stories behind some of this year\u0027s top Wahooligan athletes:\n\n**Chelsea Sodaro** is the reigning IRONMAN World Champion, but beyond her athletic prowess, Chelsea\u0027s greatest source of pride is her ability to show up for herself and her daughter. Chelsea shares the power of finding her voice, advocating for female athletes, and why motherhood is her most significant victory to date. Follow Chelsea\u0027s journey to defending her World Champion title in 2023.\n\n​\n\n**Heather Jackson:** As one chapter closes, a new one opens. After 15 years as a professional triathlete, Heather Jackson decided to challenge herself in new ways, build a fresh community, and push her own and other\u0027s expectations of what is humanly possible. In June, Heather tackled the Unbound Gravel 200, often hailed as the \u0022Super Bowl\u0022 of gravel bike racing, and the iconic Western States Endurance Run, the world’s oldest 100-mile trail race. Facing these demanding events with just a two-week gap between them, the question looms: how will Heather approach her most ambitious goal yet?\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4633333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 18,
                "intensityFactor": 0.61
              },
              "workoutId": "9EF5bV6urQ",
              "contentId": "WXEfWZDJkJ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 68,
          "type": "Cycling",
          "rank": 213,
          "prospects": [
            {
              "type": "Cycling",
              "name": "FTP/MAP Builds: 2 Sets 3 x 6",
              "style": null,
              "compatibility": 100,
              "description": "This brutal but straightforward workout is perfect for developing both FTP and MAP while teaching you a Negative Split pacing strategy. For this workout, you will complete a series of 6-minute efforts. The first 4-minutes are right at your FTP, which isn\u0027t so tough in itself, but the final 2-minutes of each effort are set above 90% of MAP.\n\n​\n\nWhen we talk about a \u0022negative split\u0022 we mean completing the second half of an effort at a higher speed/power than the first half. By the time you hit the MAP portion of each interval, your heart rate and breathing rate will already be nice and high. This limits the AC demand of a standalone MAP effort, where you have a large lag time between producing the power requirement, and your body delivering the oxygen needed to hold that power. Usually, that lag time between oxygen demand and oxygen supply is covered by your AC. Paced correctly, your heart rate should essentially be increasing for the entire 6-minutes, as it will be settling into LTHR right as you up the power output.\n\n​\n\nAs you complete each effort, holding 100% of FTP will feel harder and harder. This in itself is excellent mental practice for \u0022feeling\u0022 how your RPE for the same power can drift up as fatigue sets in. Knowing what 100% of FTP feels like when your legs are nearly spent is a great reminder of why starting an effort too hard will bite you in the end.\n\n​\n\nThis workout ends up delivering a fantastic aerobic workload as you complete 12-minutes of MAP work with minimal help from your AC. Making this an excellent session for those who have a strong AC, but weak MAP. You also rack up 24-minutes at 100% of FTP, which by itself would be a good training load. Add in these MAP efforts, and you multiply the training impact of those 24-minutes.\n\n​\n\nRegardless of your chosen discipline or event, this is a session that will benefit everyone, both regarding learning good pacing and giving your aerobic system a big training boost.\n\n​\n\n**Warm Up**\n\n20 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C100\n\n30 seconds @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n30 seconds @ RPE 8 -- 100% of FTP -- HR \u003C100%\n\n5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort** x2\n\nNumber of sets:\n\nRest between sets: 30 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\nInterval repeats per set: 3\n\n**Interval**\n\nEffort 1: 4 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\nEffort 2: 2 minutes @ RPE 8.5 -- 120% of FTP -- HR \u003E105%\n\nRest: 5 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume**\n\n50 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Cool Down**\n\n5 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 3,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 4,
                  "ftp": 4
                },
                "tss": 173,
                "intensityFactor": 0.76
              },
              "workoutId": "Yx0q6UlCGj",
              "contentId": "EkwPgH9Nhb",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 69,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance 5",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\n**Warm-Up**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 14\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set: 1\n\n**Interval**\n\n10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 5,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 180,
                "intensityFactor": 0.6
              },
              "workoutId": "s7EAe7XhEE",
              "contentId": "wLURhiOmvy",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 71,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 3",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.41694444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "W8oOfGcDMU",
              "contentId": "VeuEp2qpp3",
              "notes": "\\*After Strength\\*  \n",
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 72,
          "type": "Cycling",
          "rank": 214,
          "prospects": [
            {
              "type": "Cycling",
              "name": "FTP/MAP High Cadence: 6 x 1",
              "style": null,
              "compatibility": 100,
              "description": "Although similar to the classic Sufferfest session Revolver, this one has a few differences. Firstly, you get two minutes of recovery for every one-minute effort.  Secondly, there are higher cadence targets to maintain. By maintaining the highest cadence possible (without bouncing in the saddle) you end up pushing your neuromuscular coordination near its limits in a similar way to Cadence Builds.\n\n​\n\nSince muscles can only contract (pull) any given muscle will primarily move a joint in a single direction. When it comes to pedaling a bike, your quads and glutes can push the pedals down, while your hamstrings and hip flexors pull the pedals back up (with the help of your glutes and quads on the other leg). If you were to pedal with one leg (as you do in Cadence Drills) and your hamstrings and glutes were unable to contract, once you get to the bottom of the pedal stroke your leg would be stuck down there. No matter how hard you might try, your glutes and quads will do nothing to help you get that pedal all the way around.\n\n​\n\nNow, suppose you have both feet clipped in, and your opposite leg pushes down to bring your leg back up to 12 o\u0027clock. If your quads and glutes are still contracting (pushing the pedal down) while the glutes and quads of your other leg are starting to push their pedal down, you will end up with one leg working against the other. You must relax the glutes and quads of one leg to get all of the power out of the glutes and quads of your other leg.\n\n​\n\nThis is where neuromuscular coordination comes into play. During each pedal revolution, your legs have to “switch on” and “switch off” almost all of the muscles in your legs. By maintaining your highest cadence without bouncing, you are pushing all of the muscles in each leg to contract and relax (switch on and off) as quickly as possible.\n\n​\n\nWhile we give specific cadence targets in this session, everyone has a different limit to what cadence they can maintain before bouncing in the saddle. To get the intended benefit of this session you need to maintain the power targets at the highest cadence that YOU can maintain.\n\n​\n\n**Warm Up**\n\n3 minutes @ RPE 1 -- 50% of FTP -- HR \u003C70%\n\n2 minutes @ RPE 3 -- 70% of FTP -- HR \u003C70%\n\n1.5 minutes @ RPE 6 -- 90% of FTP -- HR \u003C80%\n\n1 minute @ RPE 1 -- 50% of FTP -- HR \u003C70%\n\n20 seconds @ RPE 7.5 -- 100% of FTP -- HR \u003C90%\n\n40 seconds @ RPE 1 -- 40% of FTP -- HR \u003C70%\n\n20 seconds @ RPE 7.5 -- 100% of FTP -- HR \u003C90%\n\n40 seconds @ RPE 1 -- 40% of FTP -- HR \u003C70%\n\n1 minute @ RPE 1 -- 50% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 6\n\nRest between sets: 2 minutes @ RPE 1 -- 40% of FTP -- HR \u003C70%\n\nInterval repeats per: none\n\n**Interval**\n\n1: 1 minute @ RPE 7.5 -- 105% of FTP -- HR \u003C100%\n\n2: 1 minute @ RPE 8 -- 110% of FTP -- HR \u003C100%\n\n3: 1 minute @ RPE 8.5 -- 115% of FTP -- HR \u003C100%\n\n4: 1 minute @ RPE 8 -- 110% of FTP -- HR \u003C100%\n\n5: 1 minute @ RPE 8.5 -- 115% of FTP -- HR \u003C100%\n\n6: 1 minute @ RPE 7.5 -- 105% of FTP -- HR \u003C100%\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n1 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minutes @ RPE 1.5 -- 40% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.55,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 3,
                  "ftp": 4
                },
                "tss": 32,
                "intensityFactor": 0.73
              },
              "workoutId": "7Yi5DH6Vkx",
              "contentId": "6NpxxFJuZr",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 73,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Into the Rift",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: To simply finish the Atlas Mountain Race means navigating 1,200 kilometres of the most rugged and remote roads in Morocco. To win requires riding almost non-stop, night and day, for days on end. It\u0027s a combination of strength and sleep deprivation that only a few riders in the world can manage. Alone, unsupported and loaded down with supplies, each competitor must constantly battle mechanicals, heat exhaustion and saddle sores to get to the finish. There is no prize, no money, simply the satisfaction that comes from pushing oneself to the limit while exploring the forgotten corners of a beautiful country. With support from PEdALED, Canyon, Fizik and the race crew led by organiser and route creator Nelson Trees, filmmaker Brady Lawrence followed the race documenting everything from a brutal 80 kilometre walk through the high desert with a broken bike, to one racer’s simple joy at realising they’ll soon eat their first warm meal in days. Featuring the sport’s biggest names and first-time, ultra- distance racers alike, the film gets up close to the kind of people crazy enough to take on this epic challenge. Capturing the human drama set against an otherworldly landscape, Into the Rift is an in-depth look at a true cycling adventure.\n\n​\n\n🚴Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6758333333333333,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 24,
                "intensityFactor": 0.6
              },
              "workoutId": "uQlw32nSxL",
              "contentId": "HeWcOMBKuU",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 75,
          "type": "Cycling",
          "rank": 215,
          "prospects": [
            {
              "type": "Cycling",
              "name": "MAP: 3 x 2",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this session is to accumulate a significant amount of time near your VO2max, or the point at which your body is consuming as much oxygen as it possibly can. That means your heart rate and breathing rate will both be near their max by the end of each interval, especially in the final few intervals.\n\n​\n\nSince it takes time for your heart rate and breathing rate to match your effort, for the first part of each interval, you will be tapping into your Anaerobic Capacity to produce the required power. To account for this, we have limited the recovery duration to be equal to the interval duration. Limited recovery ensures that you will drain your Anaerobic Capacity before the end of the intervals, meaning your body will be forced to produce as much power as possible using oxygen.\n\n​\n\n**Warm Up**\n\n10 minutes @ RPE 2 -- 45% of FTP -- HR \u003C65%\n\n7 minutes @ RPE 3 -- 55% of FTP -- HR \u003C75%\n\n2 minute @ RPE 3.5 -- 65% of FTP -- HR \u003C85%\n\n3 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n30 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-180% of FTP)\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Main Effort**\n\nNumber of Sets: 1\n\nRest Between Sets: N/A\n\nInterval Repeats Per Set: 3\n\n**Interval**\n\nEffort: 2 minutes @ RPE 9 -- 95-105% of MAP (115-135% of FTP)\n\nRecovery: 6 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Extra Volume**\n\nNA\n\n​\n\n**Cool Down**\n\n8 minutes @ RPE 1 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 4,
                  "ftp": 1
                },
                "tss": 80,
                "intensityFactor": 0.73
              },
              "workoutId": "I99PKf6jgH",
              "contentId": "qfTuYjw60f",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 76,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Endurance  2",
              "style": null,
              "compatibility": 100,
              "description": "The goal of this workout is to help develop your baseline aerobic fitness. While we are all about the High-Intensity Interval Training that most of our videos dish out, there are just times in a well-structured training plan that a proper Endurance/Base ride is just what your body needs.\n\nThis session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing. Steady Long Endurance rides are one of the best ways to cap off a long 2 or 3-week training block when your fatigue is high, your legs are tired, but you have just a bit more to squeeze out of yourself before you take your rest week, but only if you do it right!\n\n​\n\nMost people ride too hard when they head out for their \u0022base miles.\u0022 Truth be told, a proper Zone 2 ride should not leave you fatigued or your legs wasted. So what does a \u0022proper\u0022 Zone 2 ride look like?\n\nFor 90% of the ride, you should stay between 55% and 65% of your FTP, at times going up to 70% is ok, but not over. (To spice things up, we have broken this session into 10-minute segments alternating from 60 to 65% of FTP.) Your heart rate should be sitting in mid to low Zone 2 heart rate, which is 70-80% of LTHR, up to 85% of LTHR, but not for long. It would be best if you held the highest comfortable cadence you can, for most this is 80-90rpm and your RPE should be a 2-4 on a scale of 1-10.\n\n​\n\nSounds simple right? It\u0027s actually one of the harder sessions to get right because you spend most of the time questioning why you are riding so easy, and if this is really going to make you fitter and faster. You will have to trust us on that one! When you see this session in your Training Plan, follow these instructions! Or you might just pay for it when your next hard session comes around.\n\n​\n\nWarm-Up\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\nMain Effort\n\nNumber of Sets\n\n5\n\nRest Between Sets: 10 minutes @ RPE 3.5 -- 60% of FTP -- HR \u003C80%\n\nInterval Repeats per Set\n\n1\n\nInterval: 10 minutes @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n​\n\nExtra Volume\n\nN/A\n\n​\n\nCool Down\n\n5 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 2,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 72,
                "intensityFactor": 0.6
              },
              "workoutId": "dH1eNOMmdA",
              "contentId": "BNVhbAdPic",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 77,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Serbia Upside Down Ep. 1",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film: Serbia. A small country in the Balkan Peninsula that hides some of the most beautiful natural wonders and unique cultural heritage in this part of the world. Yet it remains unknown to many. Only the alternative, curious and brave plan their journeys in this hidden gem. However, a small self-organized crew from Serbia and Germany set a mission to discover and reveal those stunning natural creations of Serbia. On a bicycle. In just five days, they traversed 450 kilometers across six mountains of Western Serbia, and climbed around 11,000 meters to film and produce what you are about to experience.\n\n​\n\n🚴 Workout: The workout accompanying this film is a recovery session. It\u0027s a very low-intensity ride, with your power remaining at or below 50% of FTP (an RPE less than 2.5 on a scale from 1 to 10) and your heart rate in Zone 1. The intensity and cadence targets will vary throughout this session to keep it interesting, but not so much that it distracts you from the story.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.42527777777777775,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 15,
                "intensityFactor": 0.6
              },
              "workoutId": "SxPJhao9ey",
              "contentId": "pbFOwRxEMY",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 78,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Tapers",
              "style": null,
              "compatibility": 100,
              "description": "When it comes to \u0022peaking\u0022, or performing at your absolute best on a given day, the key is nailing your Taper. The term \u0022Taper\u0022 refers to how you train in the week or so before your target event to ensure you deliver your best performance. Generally, tapering means reducing your total training volume but continuing to hit some high-intensity efforts. While there are individual variations in the best way to taper, this session has been used by countless professionals leading into the biggest races of their lives -- athletes like World Champions Rohan Dennis and Flora Duffy.\n\n​\n\nWith 3 sets of micro-intervals (40/20s, 30/30s, and 20/40s) you will hit your system with just enough intensity to keep your legs sharp and responsive, without adding any real fatigue. Outside of those 3 sets of micro-intervals, this session is purposefully short and easy. This is a preparation session, not a training session! After all, your event is just around the corner and all of the important training is behind you. Riding harder or longer today will do absolutely nothing to increase your fitness by event day; in fact, all that would do is increase your fatigue, which will only hurt your performance. Rather, this session makes sure your body is humming along and ready to perform on the big day.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7805555555555556,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 2,
                  "ftp": 2
                },
                "tss": 52,
                "intensityFactor": 0.82
              },
              "workoutId": "HHWEa0SVBb",
              "contentId": "QYxdHH9lsF",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 79,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
              "style": null,
              "compatibility": 100,
              "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6011111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 20,
                "intensityFactor": 0.62
              },
              "workoutId": "rUrrfvb8ii",
              "contentId": "p6E2zIaYNZ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 81,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Openers",
              "style": null,
              "compatibility": 100,
              "description": "Whether you have power testing, a group ride you want to smash, that event you have been training all winter for, or even just a fun route you want to have a great ride on, this is the perfect session to do the day before. The key to this session is just enough time right around threshold, with sufficient recovery between efforts and a handful of sprints to prime all of your systems for tomorrow\u0027s event.\n\n​\n\n**Warm-Up**\n\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C65%\n\n1 minutes @ RPE 3 -- 55% of FTP -- HR \u003C70%\n\n1 minute @ RPE 4 -- 65% of FTP -- HR \u003C80%\n\n1 minute @ RPE 5 -- 75% of FTP -- HR \u003C85%\n\n30 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n30 seconds @ RPE 9 -- 90-95% of AC (130-190% of FTP)\n\n4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort**\n\nNumber of sets: 3, all unique\n\nRest Between Sets: 8 minutes @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n**Set 1**\n\nInterval Repeats per set: 1\n\nInterval: Effort: 3 minutes at @ RPE 7 -- 90% of FTP --HR \u003C95%\n\n**Set 2**\n\nInterval Repeats per set: 1\n\nInterval: Effort: 2 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003C100%\n\n**Set 3**\n\nInterval Repeats per set: 3\n\nInterval: Effort: 30 seconds @ RPE 9 -- 95% of MAP (110-130% of FTP)\n\nRecovery: 90 seconds @ RPE 2 -- 45% of FTP -- HR \u003C75%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n6 minutes @ RPE 1.5 -- \u003C45% of FTP\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.75,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 3
                },
                "tss": 32,
                "intensityFactor": 0.65
              },
              "workoutId": "nQPP9Fwg2G",
              "contentId": "qsoBpYxlEc",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 82,
          "type": "Event",
          "rank": 200,
          "prospects": [
            {
              "type": "Event",
              "name": "RAPHA Far Ride",
              "style": null,
              "compatibility": null,
              "description": "",
              "intensity": null,
              "trainerSetting": null,
              "plannedDuration": null,
              "durationType": null,
              "metrics": null,
              "workoutId": null,
              "contentId": null,
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": [
        {
          "id": "sk0A3B1JVB",
          "level": "Yes",
          "type": "MentalTraining",
          "schedule": [
            {
              "day": 0,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "02. Identifying Your Personal Big Mountain",
                  "style": null,
                  "compatibility": 100,
                  "description": "What - exactly - are you trying to accomplish? When you\u0027re ready to answer that question, this module will help you gain clarity on who you are as an athlete and identify your major goal—your Personal Big Mountain.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[The Importance of SMART Goal Setting](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/start-now-goal-setting-basics)\u0027 and \u0027[How to use your personal outlook to set more effective goals](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/know-thyself-how-to-use-your-personal-outlook-to-set-more-effective-goals)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.27444444444444444,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 32,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "U6fXCl3UDt",
                  "contentId": "Hei16sQ00t",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 3,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "03. Establishing the Goal Setting Habit",
                  "style": null,
                  "compatibility": 100,
                  "description": "**GOAL SETTING**\n\nA clear plan of action is essential to any undertaking. Setting concrete, actionable goals will keep you motivated and on track; whether you’re eyeing the top podium step or the summit of the local climb. We will help assess where you are today, where you want to go, and identify the steps needed to get there.\n\n​\n\nIn this module, you will enable consistent progress by creating a habit of identifying monthly and weekly goals, with weekly rewards for achieving those goals.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n\n​\n\n​\n\n​\n\n​\n\n​\n\n​\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.15166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 18,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "EbgLcS3DjU",
                  "contentId": "n7Y3HQbXp5",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 6,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "04. Getting Positive",
                  "style": null,
                  "compatibility": 100,
                  "description": "Thoughts matter. To accomplish big goals you need the ability to maintain a positive mindset, regardless of what life gives you. Here\u0027s an overview of the power of maintaining a positive mindset. We’ll introduce specific techniques that will help you identify negative thoughts, see obstacles as opportunities, and take a more positive path forward.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2386111111111111,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 27,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "0BYNToDCNp",
                  "contentId": "5j7NolaDRt",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 7,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "05. Remembering Why",
                  "style": null,
                  "compatibility": 100,
                  "description": "Focus is essential to high performance. Without it, you can become distracted, give in to self-doubt, and struggle to motivate yourself. Strengthen your willpower through a deep understanding of your key motivators and then develop a system to remind you of them on a daily basis.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.14583333333333334,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 15,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "Do6O1llirS",
                  "contentId": "1AGVms2Dxk",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 12,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "06. Relaxing to Recover",
                  "style": null,
                  "compatibility": 100,
                  "description": "Here you will complete a full Progressive Muscle Relaxation session. It’s part guided meditation and part focus exercise. You should listen to this module at least once per week to get in tune with your body, release tension, and maximize recovery.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.3736111111111111,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 37,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "mpUCq7UkVc",
                  "contentId": "vilPYFsASb",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 14,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "07. Positive Self-Talk",
                  "style": null,
                  "compatibility": 100,
                  "description": "Improve your confidence and performance through three types of positive self-talk: Motivational, Instructional, and Reward. Here, we’ll look at the subtle and not-so-subtle effects that words have on our attitude and performance. You’ll listen more closely to the way you talk to yourself so you can improve that internal dialogue and become your own biggest fan.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[The Power of Positive Mental Strategies](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/episode-29-how-to-use-positive-self-talk-to-get-through-tough-moments-on-a-ride-mental-strategies)\u0027 on The Knowledge Podcast by Wahoo Fitness.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24333333333333335,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 26,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "XUrrYkaPzg",
                  "contentId": "7MLgmJEEHC",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 19,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "08. Improving Focus",
                  "style": null,
                  "compatibility": 100,
                  "description": "Develop an understanding of why focused concentration is so important to your performance. We will delve into what it means to be in “The Zone,\u0022 look at the psychology and the physiology of peak performance, and what it takes to get there.\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.09916666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 10,
                    "intensityFactor": 0.98
                  },
                  "workoutId": "LHRs6VM57f",
                  "contentId": "BNiDBJg2p8",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 21,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "09. Focus Exercise",
                  "style": null,
                  "compatibility": 100,
                  "description": "Improve your ability to push away distractions and focus on the task at hand. This five-minute exercise will get you primed and ready to unleash your power from within. That means you should be in your kit and ready to train as soon as you complete this exercise.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.10444444444444445,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 10,
                    "intensityFactor": 0.98
                  },
                  "workoutId": "CuJWY2GD5y",
                  "contentId": "we3cvSjdeM",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 27,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "10. First Month Review \u0026 Improve",
                  "style": null,
                  "compatibility": 100,
                  "description": "You’ll look back at each of your weekly goals, as well as your overall goal for the month, to see how you did. This is your chance to give yourself a pat on the back, celebrate your successes, and identify how you’re going to do even better.\n\n​\n\nAfter looking to see what the past month can teach you, you’re going to turn your attention towards what lies ahead, setting new monthly and weekly goals.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.08638888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 8,
                    "intensityFactor": 0.98
                  },
                  "workoutId": "doKHUDIuAg",
                  "contentId": "37ndUDQDp0",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 28,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "11. The Successful Training Habit",
                  "style": null,
                  "compatibility": 100,
                  "description": "Let\u0027s zoom in on how you actually train, day in and day out. Great training sessions don’t just happen. You have to make a conscious effort, get everything together, then actually do the work. Successful athletes don’t leave their training to chance—they have a specific routine they go through **EVERY. SINGLE. TIME.** The more deliberate you are with your thoughts and actions before, during, and after your workouts, the better your training habit becomes and the greater your progress.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.15638888888888888,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 16,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "zyUpWfH0MH",
                  "contentId": "qjfEb9cbFb",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 33,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "12. Workout Review",
                  "style": null,
                  "compatibility": 100,
                  "description": "We’re going to take the techniques you\u0027ve learned during the “Monthly Review and Improve“ module, and apply them to your training sessions. This module should be completed immediately after finishing a workout. Have your workbook with you so after the cool-down you can start the workout review exercise immediately.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.10166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 10,
                    "intensityFactor": 0.98
                  },
                  "workoutId": "UaBKCTlf67",
                  "contentId": "m5oXc7j9jV",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 35,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "13. Kicking Ass in your Sleep Part I",
                  "style": null,
                  "compatibility": 100,
                  "description": "Pre-sleep visualization is a tool that helps build confidence and willpower. This module includes an exercise to detail what it will feel like to stand on the summit of your Big Mountain.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.12833333333333333,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 13,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "cnijRwaMdl",
                  "contentId": "0qkQsyzWLp",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 38,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "14. Future You Is Now",
                  "style": null,
                  "compatibility": 100,
                  "description": "Here you\u0027ll revisit the description of yourself that you wrote when first embarking on this journey. It is an opportunity to see how far you’ve come, but also a chance to look ahead.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.17666666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 20,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "fQcg7Ki8m3",
                  "contentId": "CkAfA1Hy0S",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 41,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "15. Kicking Ass in your Sleep Part II",
                  "style": null,
                  "compatibility": 100,
                  "description": "This visualization exercise is designed to be completed when you’re in bed, ready to fall asleep. You’ll travel from your bedroom to the summit of your Big Mountain.\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.16666666666666666,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 16,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "Fg1kDaKjdF",
                  "contentId": "z1rU6FrTLZ",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 42,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "17. Overcoming Obstacles",
                  "style": null,
                  "compatibility": 100,
                  "description": "Rainbows? Puppy dogs? Not always. Sometimes things go wrong and this session will get you moving again. As a visualization exercise, this module is meant to be listened to whenever you feel stuck—whether that’s due to an obstacle you can’t see a way around, an injury, a loss of motivation, or any other reason which makes you doubt yourself. Even if you don’t have an obstacle right now, it’s a good idea to go through the module so you know what it’s about and when to use it. It will help you re-focus, reset, and reestablish your confidence in who you are and where you’re headed.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2427777777777778,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "dMrmYQOcvH",
                  "contentId": "BHvdXb2nBN",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 48,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "18. Setting Event Goals",
                  "style": null,
                  "compatibility": 100,
                  "description": "Get clear on what an event really means to you and what your event-specific goals are.\n\n​\n\n\u0022If you are going to win any battle, you have to do one thing: you have to make the mind run the body.\u0022\n\n~ George S. Patton\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.10333333333333333,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 11,
                    "intensityFactor": 0.98
                  },
                  "workoutId": "tGTYuUtF3P",
                  "contentId": "0OjVsJUVL3",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 52,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "19. Planning For Every Event Scenario",
                  "style": null,
                  "compatibility": 100,
                  "description": "Show up prepared by identifying things that could happen during the course of the event and how to deal with them.\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.17722222222222223,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 19,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "RHIcIKJGrw",
                  "contentId": "LbR1YUp0s8",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 54,
              "type": "MentalTraining",
              "rank": 100,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "20. Preparing To Crush It",
                  "style": null,
                  "compatibility": 100,
                  "description": "This pre-event visualization exercise will help you get in the zone to deliver what athletes and sports psychologists call a “peak performance;” it’s when everything flows and operates at the highest level almost without any effort.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.14555555555555555,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 15,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "LhDAu8UJr9",
                  "contentId": "Au7PJtDXCe",
                  "notes": "",
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 55,
              "type": "MentalTraining",
              "rank": 1000,
              "prospects": [
                {
                  "type": "MentalTraining",
                  "name": "21. How Did it Go?",
                  "style": null,
                  "compatibility": 100,
                  "description": "Once the dust has settled and your heart rate has returned to normal levels, listen to this module. It\u0027s meant to be completed 15 minutes after the event ends. Part two of this exercise is completed the next day when you’ve had time to process and reflect on everything that happened during the event day.\n\n​\n\n**GET THE WORKBOOK**\n\nIf you haven\u0027t yet, download the [Mental Training Workbook](https://drive.google.com/file/d/11VIC1ZmuIwDpmv9xdeUrZ6NJ_nZraqPv/view?usp=sharing).\n\nIt\u0027s a fillable PDF, but you can print it if you prefer to work from a hard copy.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.1338888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 14,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "i4LQOKHyns",
                  "contentId": "h7t11MeQFl",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            }
          ]
        },
        {
          "id": "rntw0jclDb",
          "level": "",
          "type": "Yoga",
          "schedule": [
            {
              "day": 2,
              "type": "Yoga",
              "rank": 300,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Basic Yoga Poses",
                  "style": null,
                  "compatibility": 100,
                  "description": "Throughout the SYSTM yoga program there are several basic, foundational moves that form the core of the routines. This session takes you through those moves in detail so you can master them and their more difficult variations.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.25333333333333335,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "epMe0rWKe3",
                  "contentId": "qxs6YvzsoQ",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 6,
              "type": "Yoga",
              "rank": 301,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Super Easy Stretch Routine I",
                  "style": null,
                  "compatibility": 100,
                  "description": "Are you looking for a simple stretching routine you can do on a regular basis? New to yoga? Designed for yoga beginners, this gentle yoga session will get you on the road to a more flexible you. You\u0027ve said for years you\u0027d start stretching. Now\u0027s your chance.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2513888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "ZyVk7r3dWj",
                  "contentId": "OQbPuzfX7F",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 7,
              "type": "Strength",
              "rank": 102,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Full Body 01",
                  "style": null,
                  "compatibility": 100,
                  "description": "_Want a strength training routine that covers all the bases? Our Full Body Strength series is exactly what you’re after, offering a well-rounded series of exercises that covers the lower body, core, posterior chain, and upper body. With a substantial progression, there’s enough here to keep you busy -- and improving -- for a very long time._\n\n​\n\nThis is the first routine in the Full Body series. It introduces the most basic versions of moves that make up the majority of this program. Some of these moves may seem very basic but we encourage you to focus on perfect form and execution during these early levels so that when we turn up the heat you have things nailed. As you\u0027ll see, all the exercises at the lower levels will progress in a similar fashion going forward. We\u0027re building strength, but also fine-tuning your nervous system. As the program progresses you\u0027ll be asked to complete more difficult variations on each foundational move.\n\n​\n\nAs with all the strength training routines, it helps if you’ve done a warm-up before getting started. That can be one of your favorite yoga routines, riding your bike on the trainer for 5-10 minutes, or doing a personal stretching routine.\n\n​\n\nUnsure if this is the correct strength level for you? [Click here for help.](https://wahoosystm.com/HelpCenterChooseStrengthLevel)\n\n​\n\n**Exercises Included:**\n\n- Kneeling Hip Drive - Hands Over Head\n- Kneeling Hip Drive - Hands Side to Side\n- Hip Bridge with Reps\n- Bent Leg Tip at the Hip\n- Goblet Squat\n- Single-Leg Squat\n- Backward Lunge\n- Hip Hinge with Reach\n- Hip Bridge with Reps\n- Push-Up on Knees\n- Back Extension\n- Quadruped with Leg Lifts\n- Plank with Leg Lifts\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.20916666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 5,
                    "intensityFactor": 0.49
                  },
                  "workoutId": "QZ177ROg7C",
                  "contentId": "pqcw0IeBqc",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 9,
              "type": "Yoga",
              "rank": 302,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Loosen Neck and Shoulders",
                  "style": null,
                  "compatibility": 100,
                  "description": "Cycling can put a lot of strain on your neck and shoulders, especially if you spend a lot of time down in the drops or in an aero position. This session will help loosen your neck and shoulders with a series of exercises that will release tension and have you feeling relaxed and ready to hit it again.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 24,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "OMbMF4ZLL2",
                  "contentId": "HrRvxvdfES",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 13,
              "type": "Yoga",
              "rank": 303,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Morning Yoga Routine",
                  "style": null,
                  "compatibility": 100,
                  "description": "In this sequence, we start with a short breathing exercise to relax the body and calm the mind, then mobilize joints throughout the body. From there we move into deeper stretches for the hips and hamstrings and finish with a short meditation.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.25305555555555553,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "3dSiDxhXEJ",
                  "contentId": "4dDcfXlQIK",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 14,
              "type": "Strength",
              "rank": 104,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Recovery Session A",
                  "style": null,
                  "compatibility": 100,
                  "description": "These recovery sessions are easy enough that you get the rest you need, but work you hard enough that your body continues to adapt to the new demands you place on it. You might see these sessions as too short and too easy to be beneficial, but just like a proper recovery spin, active recovery is infinitely better than doing nothing at all. Given how short this session is, we strongly recommend also doing a Yoga Session in the app first. Something like Mobilize and Activate, Balance and Agility, or Full Body Mobilization.\n\n​\n\n**Exercises Included**\n\n- Kneeling Hip Drive with Hands Up\n- Kneeling Hip Drive with Hands to Side\n- High Plank\n- Plank\n- Hip Bridge\n- Bent Leg Tip at the Hip\n- Standing Hip Drive with Hands Up\n- Standing Hip Drive with Hands to Side\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.1527777777777778,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 4,
                    "intensityFactor": 0.49
                  },
                  "workoutId": "nMQ6N6Z53n",
                  "contentId": "4uE2aDnuo6",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 16,
              "type": "Yoga",
              "rank": 304,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Basic Yoga Poses",
                  "style": null,
                  "compatibility": 100,
                  "description": "Throughout the SYSTM yoga program there are several basic, foundational moves that form the core of the routines. This session takes you through those moves in detail so you can master them and their more difficult variations.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.25333333333333335,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "epMe0rWKe3",
                  "contentId": "qxs6YvzsoQ",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 20,
              "type": "Yoga",
              "rank": 305,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Chest \u0026 Shoulder Strength",
                  "style": null,
                  "compatibility": 100,
                  "description": "This yoga sequence is designed to strengthen the upper body, targeting the shoulders, chest, triceps, and core. It\u0027s an ideal routine to practice in the morning or before a workout to activate muscles throughout the body. The intensity can be increased by lifting the knees during push-ups, providing a challenge to work towards.\n\n​\n\nThe objectives are to strengthen the shoulders, chest, triceps, and core, practice synchronizing breath and movement, and potentially alleviate lower back pain.\n\n​\n\n**Poses in this session:**\n\n- Mountain\n- Half Sun Salutations\n- Triceps Push-Ups\n- Plank\n- Child\n- Downward Dog\n- Puppy\n- Chest Stretch\n- Triceps Stretch\n- Final Resting Pose\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "4tA5QEtbiJ",
                  "contentId": "qIK6s5azwj",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 21,
              "type": "Strength",
              "rank": 106,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Full Body 02",
                  "style": null,
                  "compatibility": 100,
                  "description": "_Want a strength training routine that covers all the bases? Our Full Body Strength series is exactly what you’re after, offering a well-rounded series of exercises that covers the lower body, core, posterior chain, and upper body. With a substantial progression, there’s enough here to keep you busy -- and improving -- for a very long time._\n\n​\n\nIn this session, we introduce you to a few more foundational moves. Learn them well as you’ll see them throughout the program as you progress. And as you progress, we\u0027ll continue to add more difficult variations on these basics - so develop good habits now for easy mastery down the road.\n\n​\n\nUnsure if this is the correct strength level for you?  [Click here for help.](https://wahoosystm.com/HelpCenterChooseStrengthLevel)\n\n​\n\n**Exercises Included:**\n\n- Kneeling Hip Drive - Hands Over Head\n- Kneeling Hip Drive - Hands Side to Side\n- Hip Bridge with Reps\n- Bent Leg Tip at the Hip\n- Forward Lunge\n- Lateral Lunge with Extended Hands\n- Hip Hinge\n- Squat with Wide Stance\n- Plank\n- Quadruped with Arm Raise\n- Side Plank\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.19555555555555557,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 5,
                    "intensityFactor": 0.49
                  },
                  "workoutId": "oysCVNFmCC",
                  "contentId": "u9SW542leT",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 23,
              "type": "Yoga",
              "rank": 306,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "End Of Day Stretch",
                  "style": null,
                  "compatibility": 100,
                  "description": "This slow and stretchy sequence is ideal for practicing at the end of a long day at work or after travel. It focuses on opening up the chest and shoulders, stretching the neck and forearms, and releasing tension in the calves, hamstrings, hips, and lower back. These poses can also be used after a workout for a comprehensive full-body stretch.\n\n​\n\nThe objectives are to stretch the neck, shoulders, triceps, chest, and forearms; release tension in the lower back, hips, hamstrings, calves, ankles, and feet; transition the body into parasympathetic \u0022rest or digest\u0022 mode after exercise; and help alleviate lower and mid back pain.\n\n​\n\n**Poses in this session:**\n\n- Puppy\n- Screaming Toe\n- Neck Stretch\n- Ankle Stretch\n- Chest Stretch\n- Forearm Stretch\n- Downward Dog\n- Revolved Standing Forward Bend\n- Low Lunge Chest Opener\n- Dead Pigeon\n- Reclining Spinal Twist\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "GLN8bDnkTz",
                  "contentId": "IhB5vyASlP",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 27,
              "type": "Yoga",
              "rank": 307,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Neck and Upper Back Recovery",
                  "style": null,
                  "compatibility": 100,
                  "description": "In this Beginner sequence, we improve mobility in the neck, shoulders, upper and mid-back, open up the chest and shoulders and relieve tension at the lower back to help alleviate neck, shoulder, and interscapular pain. You can practice it in the morning or the evening.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2538888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 9,
                    "intensityFactor": 0.6
                  },
                  "workoutId": "f8BdieRHEZ",
                  "contentId": "YuKMLjzZJ6",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 28,
              "type": "Strength",
              "rank": 108,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Full Body 03",
                  "style": null,
                  "compatibility": 100,
                  "description": "_Want a strength training routine that covers all the bases? Our Full Body Strength series is exactly what you’re after, offering a well-rounded series of exercises that covers the lower body, core, posterior chain, and upper body. With a substantial progression, there’s enough here to keep you busy -- and improving -- for a very long time._\n\n​\n\nIn this session, we begin adding variations to the foundational moves you’ve mastered so far (you’ve mastered them, right?). This will keep challenging you, as will the increases in duration of a few sets -- such as the squats -- so you can complete a few more reps.\n\n​\n\nUnsure if this is the correct strength level for you?  [Click here for help.](https://wahoosystm.com/HelpCenterChooseStrengthLevel)\n\n​\n\n**Exercises Included:**\n\n- Kneeling Hip Drive with Hands Over Head\n- Kneeling Hip Drive with Hips Side to Side\n- Hip Bridge with Reps\n- Bent Leg Tip at the Hip\n- Forward Lunge\n- Lateral Lunge with Extended Hands\n- Hip Hinge\n- Single-Leg Squat with Opposite Reach\n- Squat with Wide Stance\n- Hip Bridge\n- Frog Crunch\n- Push-Up On Knees\n- Back Extension with Reps\n- Quadruped with Arm Raise\n- Plank\n- Plank with Leg Lifts\n- Side Plank\n- Side Plank with Leg Raise\n- Side Plank with Pulsing Hand\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.33666666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 8,
                    "intensityFactor": 0.5
                  },
                  "workoutId": "tMNDQHiMs1",
                  "contentId": "QAIfCGp5qO",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 30,
              "type": "Yoga",
              "rank": 308,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Recovery Booster",
                  "style": null,
                  "compatibility": 100,
                  "description": "It may seem counterintuitive, but it\u0027s during recovery when you actually get stronger and consolidate the gains you\u0027ve made while training. Without proper recovery, you won\u0027t improve. This session helps boost your recovery time, relaxing you and ensuring you give your body the chance to grow stronger.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2427777777777778,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 24,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "gzgd8DC8J3",
                  "contentId": "D6SEBUnjwW",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 34,
              "type": "Yoga",
              "rank": 309,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Hip Flexor and Groin Recovery",
                  "style": null,
                  "compatibility": 100,
                  "description": "In this Beginner sequence, we release the hip flexors and groin and stretch the hamstrings and calves. It\u0027s a great session to do after a workout or in the evening to prevent and alleviate lower back pain.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2525,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 9,
                    "intensityFactor": 0.6
                  },
                  "workoutId": "DyCuarVW0N",
                  "contentId": "atFlT6FCPH",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 35,
              "type": "Strength",
              "rank": 110,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Recovery Session B",
                  "style": null,
                  "compatibility": 100,
                  "description": "This session is designed to keep your body familiar with the basic movements of strength training without adding any extra fatigue to your system. This keeps your body adapted while allowing it to fully recover. To make the most out of your strength gains, you need to balance the hard work with adequate recovery. Given how short this session is, we strongly recommend completing a supplementary Yoga Session after this video. Something like Improving Posture, Shake Off the Day or Recovery Booster would be perfect.\n\n​\n\n**Exercises Included**\n\n- Kneeling Hip Drive with Hands Over Head\n- Kneeling Hip Drive with Hips Side to Side\n- High Plank to Pigeon Pose\n- Plank with Leg Lifts\n- Hip Bridge with Reps\n- Fast Lateral Lunges with Knees Up\n- Standing Hip Drive with Hands Up\n- Standing Hip Drive with Hands Side to Side\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.15416666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 4,
                    "intensityFactor": 0.49
                  },
                  "workoutId": "4y8mNDongj",
                  "contentId": "c3M0tQQKmK",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 37,
              "type": "Yoga",
              "rank": 310,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Super Easy Stretch Routine I",
                  "style": null,
                  "compatibility": 100,
                  "description": "Are you looking for a simple stretching routine you can do on a regular basis? New to yoga? Designed for yoga beginners, this gentle yoga session will get you on the road to a more flexible you. You\u0027ve said for years you\u0027d start stretching. Now\u0027s your chance.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2513888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "ZyVk7r3dWj",
                  "contentId": "OQbPuzfX7F",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 41,
              "type": "Yoga",
              "rank": 311,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Lower Back Recovery",
                  "style": null,
                  "compatibility": 100,
                  "description": "In this Beginner sequence, we release tension in the hips—the groin, glutes, piriformis, TFL, and external hip rotators, stretch the calves and hamstrings and re-align the pelvis. It\u0027s a great session to practice in the morning or the evening to prevent and alleviate lower back pain.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.25722222222222224,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": 0,
                      "nm": 0,
                      "map": 0,
                      "ftp": 0
                    },
                    "tss": 9,
                    "intensityFactor": 0.6
                  },
                  "workoutId": "g4BWH90Ys2",
                  "contentId": "OmJKEBa3wQ",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 42,
              "type": "Strength",
              "rank": 115,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Full Body 03",
                  "style": null,
                  "compatibility": 100,
                  "description": "_Want a strength training routine that covers all the bases? Our Full Body Strength series is exactly what you’re after, offering a well-rounded series of exercises that covers the lower body, core, posterior chain, and upper body. With a substantial progression, there’s enough here to keep you busy -- and improving -- for a very long time._\n\n​\n\nIn this session, we begin adding variations to the foundational moves you’ve mastered so far (you’ve mastered them, right?). This will keep challenging you, as will the increases in duration of a few sets -- such as the squats -- so you can complete a few more reps.\n\n​\n\nUnsure if this is the correct strength level for you?  [Click here for help.](https://wahoosystm.com/HelpCenterChooseStrengthLevel)\n\n​\n\n**Exercises Included:**\n\n- Kneeling Hip Drive with Hands Over Head\n- Kneeling Hip Drive with Hips Side to Side\n- Hip Bridge with Reps\n- Bent Leg Tip at the Hip\n- Forward Lunge\n- Lateral Lunge with Extended Hands\n- Hip Hinge\n- Single-Leg Squat with Opposite Reach\n- Squat with Wide Stance\n- Hip Bridge\n- Frog Crunch\n- Push-Up On Knees\n- Back Extension with Reps\n- Quadruped with Arm Raise\n- Plank\n- Plank with Leg Lifts\n- Side Plank\n- Side Plank with Leg Raise\n- Side Plank with Pulsing Hand\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.33666666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 8,
                    "intensityFactor": 0.5
                  },
                  "workoutId": "tMNDQHiMs1",
                  "contentId": "QAIfCGp5qO",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 44,
              "type": "Yoga",
              "rank": 315,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Supple Spine \u0026 Hips",
                  "style": null,
                  "compatibility": 100,
                  "description": "This classic yoga sequence enhances mobility in the spine and hips while stretching the calves, hamstrings, hip flexors, and lower back. As you become familiar with the routine, you can begin to focus on synchronizing your breath with your movements, aiming to use nasal breathing as much as possible. It is an excellent practice for the morning to warm up and improve focus, or it can be done directly after a workout to help prevent extreme muscle stiffness.\n\n​\n\nThe objectives are to improve mobility in the spine and hips, stretch the calves, hamstrings, hip flexors, and lower back, practice synchronizing breath and movement, and potentially alleviate lower back pain.\n\n​\n\n**Poses in this session:**\n\n- Mountain\n- Half Sun Salutations\n- Downward Dog\n- Crescent Lunge\n- Bridge\n- Reclining Spinal Twist\n- Final Resting Pose\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "yaoER7YZXN",
                  "contentId": "Hp3cgE0oCL",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 48,
              "type": "Yoga",
              "rank": 316,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Mobilize Your Body",
                  "style": null,
                  "compatibility": 100,
                  "description": "In this video, we focus on mobilizing the wrists, elbows, shoulders, neck, spine, hips, ankles, and toes to enhance overall mobility throughout the body. It is an excellent routine to practice in the morning or evening to alleviate stiffness.\n\n​\n\nThe objectives are to increase mobility in the wrists, elbows, shoulders, neck, spine, hips, and ankles.\n\n​\n\n**Poses in this session:**\n\n- Screaming Toe\n- Wrist Circles\n- Elbow Circles\n- Shoulder Circles\n- Neck Circles\n- Thunderbolt\n- Kneeling Cat-Cow\n- Thoracic Spine Circles\n- Seated Twists\n- Hip Circles\n- Squat Twists\n- Standing Forward Bends\n- Reclining Hip Circles\n- Windscreen Wipers\n- Ankle Mobilisations\n- Knees-To-Chest\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.24166666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "LBMdUl2pcK",
                  "contentId": "EScfx8jFrg",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 49,
              "type": "Strength",
              "rank": 112,
              "prospects": [
                {
                  "type": "Strength",
                  "name": "Recovery Session B",
                  "style": null,
                  "compatibility": 100,
                  "description": "This session is designed to keep your body familiar with the basic movements of strength training without adding any extra fatigue to your system. This keeps your body adapted while allowing it to fully recover. To make the most out of your strength gains, you need to balance the hard work with adequate recovery. Given how short this session is, we strongly recommend completing a supplementary Yoga Session after this video. Something like Improving Posture, Shake Off the Day or Recovery Booster would be perfect.\n\n​\n\n**Exercises Included**\n\n- Kneeling Hip Drive with Hands Over Head\n- Kneeling Hip Drive with Hips Side to Side\n- High Plank to Pigeon Pose\n- Plank with Leg Lifts\n- Hip Bridge with Reps\n- Fast Lateral Lunges with Knees Up\n- Standing Hip Drive with Hands Up\n- Standing Hip Drive with Hands Side to Side\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.15416666666666667,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": {
                      "ac": null,
                      "nm": null,
                      "map": null,
                      "ftp": null
                    },
                    "tss": 4,
                    "intensityFactor": 0.49
                  },
                  "workoutId": "4y8mNDongj",
                  "contentId": "c3M0tQQKmK",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 51,
              "type": "Yoga",
              "rank": 312,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Recovery Booster",
                  "style": null,
                  "compatibility": 100,
                  "description": "It may seem counterintuitive, but it\u0027s during recovery when you actually get stronger and consolidate the gains you\u0027ve made while training. Without proper recovery, you won\u0027t improve. This session helps boost your recovery time, relaxing you and ensuring you give your body the chance to grow stronger.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2427777777777778,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 24,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "gzgd8DC8J3",
                  "contentId": "D6SEBUnjwW",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            },
            {
              "day": 55,
              "type": "Yoga",
              "rank": 314,
              "prospects": [
                {
                  "type": "Yoga",
                  "name": "Super Easy Stretch Routine I",
                  "style": null,
                  "compatibility": 100,
                  "description": "Are you looking for a simple stretching routine you can do on a regular basis? New to yoga? Designed for yoga beginners, this gentle yoga session will get you on the road to a more flexible you. You\u0027ve said for years you\u0027d start stretching. Now\u0027s your chance.\n",
                  "intensity": {
                    "master": 1,
                    "nm": null,
                    "ac": null,
                    "map": null,
                    "ftp": null
                  },
                  "trainerSetting": {
                    "mode": "ERG",
                    "level": null
                  },
                  "plannedDuration": 0.2513888888888889,
                  "durationType": "Time",
                  "metrics": {
                    "ratings": null,
                    "tss": 25,
                    "intensityFactor": 0.99
                  },
                  "workoutId": "ZyVk7r3dWj",
                  "contentId": "OQbPuzfX7F",
                  "notes": null,
                  "fourDPWorkoutGraph": null
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}