{
  "previewPlan": [
    {
      "id": "xcDZIXxQoG",
      "name": "SYSTM STEP Up Challenge",
      "weakness": "NoWeakness",
      "grouping": "",
      "category": "Special Focus",
      "subcategory": "Indoor Only",
      "description": "**Saturday, 27 March: Who Dares \u002B Half the Road.**  \n_Who Dares_: One of our favorite workouts, Who Dares features some of the most exciting footage in pro racing from the women\u0027s Strade Bianche, Tour of Flanders, and Amstel Gold.  \n  \n_Half the Road:_ Part of the Inspiration series in the Wahoo SUF Training App,\\_ Half the Road \\_is Kathryn Bertine’s 2015 documentary that explores the world of women’s pro cycling and the culture of gender inequality in the sport. This is a moderate-intensity base workout so you can focus on the story while still working on your aerobic endurance.  \n  \n**Sunday, 28 March: Fight Club \u002B I Just Want to Ride**  \n_Fight Club_: A recently remastered version of a SUF classic, Fight Club features footage of the women’s UCI road world championships.  \n  \n_I Just Want to Ride_: Part of the Inspiration series, this documentary chronicles Wahoo athlete and ultra-endurance badass Lael Wilcox as she tackles the 2019 edition of The Tour Divide, one of the most grueling off-road races on the North American calendar.  \n  \nKathryn Bertine, creator of _Half the Road_ will be riding _Fight Club_ live with Wahoo Sports Science coach Suzie Snyder on Sunday, 28 March and will be fielding viewer questions. We\u0027ll post details on the SUForum and the Sufferlandria Facebook page as the date gets closer.  \n  \nComplete all 4 workouts to earn the STEP Up Challenge Badge!  \n",
      "planDescription": "To celebrate Women\u0027s History Month and to encourage gender equality in cycling.",
      "fixedEndDate": "2021-03-28",
      "level": "",
      "type": "Cycling",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "None",
      "progression": "None",
      "hidden": false,
      "createdAt": "2021-03-15T16:35:16.299Z",
      "updatedAt": "2025-04-02T09:37:18.889Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 5,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Gran Canaria: Serenity",
              "style": null,
              "compatibility": 100,
              "description": "Starting at the islands iconic rainbow rocks at Los Azulejos de Veneguera in this session we tackle one of the most stunning climbs on the whole island, known locally as “Serenity”. We’ll be breaking this 10km climb down into three distinct sections, kicking off with a block of 6 x 50 second high tempo efforts with a 10 second burst out of the saddle before taking a swift breather before getting back on it. As we climb through the pine forest we’ll switch things up a touch, alternating between low and high cadence for 30 seconds at a time for around 7 minutes. We’ll then revert back to our 50 second high tempo with 10 second burst out of the saddle efforts before we build up our effort to the summit. This is going to be a challenging workout so make sure you’re ready and whatever you do don’t forget to take a moment to look at the views!!\n\n​\n\nThis workout combines multiple different interval types that focus on improving threshold power via over-under style efforts along with low cadence work for your muscular endurance. The first and last climbs also fire up your whole energy systems with some sprints to the summit.\n\n​\n\n[**Route on Strava**](https://www.strava.com/activities/8735613403)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9230555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 2,
                  "map": 3,
                  "ftp": 5
                },
                "tss": 62,
                "intensityFactor": 0.86
              },
              "workoutId": "keD5MA4ABE",
              "contentId": "sXC2D7jqYs",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 5,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Half the Road",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2015): _Half The Road_ is a documentary that explores the world of women’s professional cycling, focusing on both the love of sport and the pressing issues of inequality that modern-day female riders face in a male-dominated sport. With footage from some of the world’s best UCI races and interviews with Olympians, World Champions, rookies, coaches, managers, officials, doctors, and family members, _Half The Road_ offers a unique insight into the drive, dedication, and passion it takes for a female cyclist to thrive.\n\n​\n\nBoth on and off the bike, the voices and advocates of women’s pro cycling take the audience on a journey of enlightenment, depth, strength, love, humor, and best of all, change \u0026 growth.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.7855555555555556,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 80,
                "intensityFactor": 0.67
              },
              "workoutId": "BfMlmFKNwD",
              "contentId": "v9I6LMYanP",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Fight Club",
              "style": null,
              "compatibility": 100,
              "description": "A full remastering of one of our earliest sessions (the original is still available to those of you who are Knights of Sufferlandria), Fight Club is scrappy, messy, and unpredictable. Like a real bike race, you\u0027re working hard to stay with the leaders while fending off attacks and doing your best to make the race by attacking as well.\n\n​\n\nWith significant time spent at power well above your threshold, this is a solid session to improve your Anaerobic Capacity. The fact that all those surges take place during sustained efforts right around threshold makes this one of the most difficult (yet beneficial) workouts in The Sufferfest Library. Repeated surges followed by sustained riding near your threshold stress your body\u0027s ability to clear metabolites (like lactate) and your mental ability to “deal” with the extreme discomfort all those metabolites cause. You\u0027re going to come out of this one a bit battered but a lot stronger for it.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9272222222222222,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 4,
                  "nm": 1,
                  "map": 3,
                  "ftp": 4
                },
                "tss": 80,
                "intensityFactor": 0.93
              },
              "workoutId": "C0q3WCPXm2",
              "contentId": "tJpZlAA0hq",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "From the Ground Up - Season 4 Pt 2",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2024):\n\n**Episode 4: Setting An Example**\n\nIn Episode 4 we arrive in Steamboat Springs, CO and start to settle in before race day. We pre ride the course, pick up packets and find some nerves. In our final athlete feature we dive into what drives Kristen Myers? How does the super mom do it all and still find time to train? This episodes is all about the final preparations before race day.\n\n​\n\n**Episode 5: Mind Over Matter**\n\nIn our last episode, we reach the culmination of all our riders hard work and arrive in Steamboat Springs, CO for the SBT GRVL race. Do they have what it takes to finish 125 miles with less than 6 months of training? Each person will battle their own self doubt as the gun goes off for the final time this season.\n\n​\n\n🚴 Workout: This is a great way to watch a compelling documentary while developing your baseline aerobic fitness. The intensity of this workout will vary mostly between 60-70% of FTP, with heart rate remaining entirely in zone 2. This session will add minimal fatigue to your system, while still giving your aerobic engine the workload it needs to continue progressing.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8069444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 20,
                "intensityFactor": 0.5
              },
              "workoutId": "NN7LGYGdTx",
              "contentId": "hHBWWv6QHn",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": []
    }
  ]
}