{
  "previewPlan": [
    {
      "id": "XXfscDmAGU",
      "name": "Go Beyond FTP: Endurance",
      "weakness": "NoWeakness",
      "grouping": "Go Beyond FTP",
      "category": "Special Focus",
      "subcategory": "4 week block",
      "description": "**Unlock your full potential: ENDURANCE**\n\n​\n\nImprove your **ENDURANCE **capacity to sustain long efforts at a consistent pace over extended periods of time by increasing your functional threshold power with our 4 week focussed plan.\n",
      "planDescription": "Go Beyond FTP",
      "fixedEndDate": "",
      "level": "",
      "type": "Cycling",
      "uniqueToPlan": "None",
      "volume": "None",
      "option": "None",
      "duration": "None",
      "progression": "None",
      "hidden": false,
      "createdAt": "2024-08-08T14:09:24.687Z",
      "updatedAt": "2025-09-02T10:30:15.648Z",
      "version": "1.0.1",
      "isAddOn": false,
      "deleted": null,
      "metadata": {
        "internalNotes": ""
      },
      "primary": [
        {
          "day": 1,
          "type": "Cycling",
          "rank": 202,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Catalunya: Costa Brava Coastline",
              "style": null,
              "compatibility": 100,
              "description": "Today we’re going to be riding one of the most incredible roads of Spain\u0027s Catalan region, going from St Feliu de Guíxols over to Tossa de Mar and hugging the Costa Brava coastline the whole way. Continually undulating we’ll hit each of the eight rolling climbs hard, working at low cadence with high intensity to build strength. Mike will keep you focused on good form, though, and make sure you keep the power down on all the way over each summit.\n\n​\n\nIt wouldn\u0027t be an On Location ride, though, if we didn\u0027t have a look at the scenic attractions along the way, though, so get ready for craggy rocks, turquoise clear waters, and a few opportunities to delve into the Costa Brava’s finest as we find out more about the region along this 21km route.\n\n​\n\n[Route on Strava](https://www.strava.com/routes/2967787441439728434)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8119444444444445,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 3,
                  "ftp": 4
                },
                "tss": 69,
                "intensityFactor": 0.87
              },
              "workoutId": "XDIff4OU0E",
              "contentId": "CPfatYSGH6",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 3,
          "type": "Cycling",
          "rank": 210,
          "prospects": [
            {
              "type": "Cycling",
              "name": "ALL Access EF 2: FTP Over-Unders",
              "style": null,
              "compatibility": 100,
              "description": "Join the mixed EF group ride for 3 FTP over-under intervals. You’ll find out more about the team’s goals for the upcoming 2024 season as well as getting to know some of the stars of the team including Neilson Powless, Kim Cadzow and Michael Valgren who share what life is like as a professional cyclist both on and off the bike.\n\n​\n\nThe concept of over-unders is simple, alternate blocks of time just below your FTP, with equal duration blocks just above your FTP. For this session, each interval is 8-minutes in length, with 1-minute blocks at 95% of FTP (Under) and 1-minute blocks at 105% of FTP (Over). The real training benefit comes from that time spent just below FTP trying to \u0022Recover.\u0022 Physiologically, you train your body to be more efficient when working just below FTP.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8175,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 61,
                "intensityFactor": 0.88
              },
              "workoutId": "ngTEUOMIAr",
              "contentId": "NCHffhDtGa",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 5,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "FTP Progression 1: 5 x 6",
              "style": null,
              "compatibility": 100,
              "description": "As the title suggests, this is the first of a series of workouts designed to help you accumulate time at FTP. In simple terms, this session is 5 repeats of 6 minutes at or just below 100% of FTP with 4 minutes of easy recovery, making for a 60-minute session with 30 minutes of riding at FTP.\n\n​\n\nBy itself, this workout is not super hard, which is the point since it is the first session of our FTP progression series. This session is great for one of your first sessions with some fresh power numbers off of completing Full Frontal to get more comfortable with your new numbers. It also makes for a great second afternoon/evening session when doing two-a-day training sessions.\n\n​\n\n**Warm Up **2 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70% 2 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70% 1 minute @ RPE 6.5 -- 85% of FTP -- HR \u003C80% 1 minute @ RPE 7.5 -- 95% of FTP -- HR \u003C80% 1 minute @ RPE 7.75 -- 105% of FTP -- HR \u003E105% 3 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n**Main Effort **Number of Sets: 5 Rest Between Sets: 4 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70% Interval Repeats Per Set: NA **Interval **6 minute @ RPE 7.5 -- 100% of FTP -- HR \u003E105%\n\n**Extra Volume **N/A\n\n**Cool Down **30 seconds @ RPE 1.5 -- 45% of FTP -- HR \u003C70% 3 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70% 30 seconds @ RPE 1.5 -- 40% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.0666666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 72,
                "intensityFactor": 0.85
              },
              "workoutId": "QtLjkEggLk",
              "contentId": "QFm19JmVVZ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Strength",
          "rank": 100,
          "prospects": [
            {
              "type": "Strength",
              "name": "Core \u0026 Hip Mobility A",
              "style": null,
              "compatibility": 100,
              "description": "This module is a ground-based session designed to improve mobility through your hips and low back while activating and integrating muscles that are key to core stability. Take your time to work through the movements and focus on quality. Be sure to rotate through the other routines in this series on a regular basis for maximum benefit.\n\n​\n\nExercises:\n\n- Inchworm\n- Pigeon Stretch\n- Hip Bridge w/Knee Squeeze\n- Marching Hip Bridge\n- Back Extension w/Arms Overhead\n- Quadruped w/Alt. Leg/Arm\n- Bird Dog\n- Kneeling Pelvic Tilt\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.11138888888888888,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": 4,
                "intensityFactor": 0.59
              },
              "workoutId": "71DLIFZYsf",
              "contentId": "3rHx3ISEtw",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 6,
          "type": "Custom",
          "rank": 209,
          "prospects": [
            {
              "type": "Cycling",
              "name": " [BETA] Understanding 4DP pt.4: Functional Threshold Power (FTP) (The Knowledge Podcast)\n",
              "style": null,
              "compatibility": 100,
              "description": "[**Beta Feedback Thread**](https://forum.wahooligan.com/t/the-knowledge-workouts-beta/24072)\n\n​\n\nThis is a must-listen for anyone serious about getting faster. Sure, you’ll hear why Neal loves going hard for an hour and why Mac feels you should think about 4DP like a cupcake. But, more importantly, they break through all the hype on FTP, explore what’s wrong with most standard FTP tests, and why not everyone’s FTP works the same way. They also explain why FTP is great for setting targets for recovery and endurance - but NOT for high-intensity work — and what understanding your FTP relative to your MAP, AC and NM tell you about your potential for improvement.\n\n​\n\nThe Knowledge podcast by Wahoo is a science-based podcast focused on providing training information for endurance athletes. Hosted by sports scientists, it delves into various training topics, offering actionable insights and key takeaways.\n\n[**Find out more**](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.4419444444444444,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 1
                },
                "tss": 28,
                "intensityFactor": 0.8
              },
              "workoutId": "1X17PPd6X6",
              "contentId": "HLhMwoQc47",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 8,
          "type": "Cycling",
          "rank": 202,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Angels",
              "style": null,
              "compatibility": 100,
              "description": "If you were eating lunch, eight minutes wouldn\u0027t seem like a lot of time. If you were on a beach, it would be cruel to only be there for eight minutes. But during the eight-minute efforts in _Angels_, you\u0027ll think that it\u0027s never going to end. The focus on lower cadences and power targets near or above FTP makes this session perfect for improving your ability to crush shorter climbs. The longer efforts are designed to target your sustained aerobic system, which is great for improving FTP. They\u0027re also just short— and difficult—enough that you can drive improvements in Maximal Aerobic Power.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9141666666666667,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 78,
                "intensityFactor": 0.92
              },
              "workoutId": "10QilUgeAj",
              "contentId": "xzCdnkKwU1",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 10,
          "type": "Cycling",
          "rank": 214,
          "prospects": [
            {
              "type": "Cycling",
              "name": "G.O.A.T.",
              "style": null,
              "compatibility": 100,
              "description": "This session is all about high-torque efforts, very similar to the efforts you would experience riding up the steep slopes of Mt Sufferlandria. While these efforts are short and the intensity isn’t too high, the low cadence targets combined with minimal recovery will leave some begging for the high-cadence sprints of _The Omnium_. High-torque efforts like these have two primary benefits: improved neuromuscular coordination and increased muscular endurance.\n\n​\n\nDuring each pedal revolution, your legs have to “switch on” and “switch off” almost all of the muscles in your legs. High-cadence efforts in something like _Cadence Builds_ are great for teaching these groups to make that switch quickly. These low-cadence efforts are better for teaching ALL of the muscles in your legs to “switch on.” Done properly, you should be pulling with your hamstrings with one leg while the other leg is pushing down with all the force your glutes and quads can muster. If you feel like you are pushing yourself up out of the saddle during harder efforts (like seated sprints), your hamstrings are not being utilized since they should pull you back down into your saddle.\n\n​\n\nThe second main benefit is improved muscular endurance. Even though the session is under 45 minutes, **you\u0027ll put a similar amount of muscular fatigue into your legs as a steady, multi-hour base ride.** You can almost view this session as hitting the leg press for 8 sets of 100 reps. And just like the weight room, proper form is absolutely key. That means:\n\n- You should focus on pushing down AND pulling back up. You want your glutes and quads activated on the way down and your hamstring and hip flexors activated on the way up.\n- To properly engage your hamstrings think about trying to pulling your heel up to your butt when your crank arm is going from 6 o’clock to 10 o’clock.\n- Your knees should be tracking straight up and down, no collapsing in or out.\n- Your core should be fully engaged to keep your hips steady in the saddle. This will be easier if you are both pushing and pulling during each pedal revolution.\n\nThis session is very similar to _Power Station_. Both help improve your muscular endurance and coordination; the biggest difference is the work to rest ratio between the two. While the intervals here are shorter than those in _Power Station_, the decreased recovery duration means fatigue will build faster, especially for those with a weakness in repeated efforts.\n\nModifying interval length and recovery duration can also be seen between sessions like _Revolver_ and _A Very Dark Place_. Both serve up a healthy dose of MAP/VO2 work, but the overall feeling of those two sessions is different.\n\nIf you find that your lower back starts to ache during this session or that you have to start rocking in the saddle to keep the power up, then it’s time for you to get started on the SYSTM Yoga program. Kick it off with “Core Strengtheners ” to make sure your core is just as strong as those legs.\n\n​\n\n**LEARN MORE**\n\nListen to \u0027[When to Train with Low Cadence](https://the-knowledge-by-wahoo-sports-science.simplecast.com/episodes/when-to-train-with-low-cadence)\u0027 on The Knowledge Podcast by Wahoo Sports Science.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6986111111111111,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 3,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 49,
                "intensityFactor": 0.84
              },
              "workoutId": "4tEUYuJNcB",
              "contentId": "cCBhlcg2Ye",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 12,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "FTP Progression 2: 5 x 7",
              "style": null,
              "compatibility": 100,
              "description": "As the title suggests, this is the second addition to our FTP series, designed to help you improve your threshold. This workout is simply 5 repeats of 7 minutes at 96-100% of FTP with 3 minutes of easy recovery, making for a 60-minute session with 35 minutes of riding at FTP.\n\n​\n\nYou should be getting comfortable with your fresh power numbers from your recent Full Frontal test and feel like you\u0027re gaining strength and fitness from completing the first FTP Progression workout a few times. This session has added one minute to the FTP intervals and removed a minute from the recovery sections, getting you closer to that final version of 5 x 9 min efforts with only 3 minutes recovery in between.\n\n​\n\n**Warm Up**\n\n2 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n2 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n1 minute @ RPE 6.5 -- 85% of FTP -- HR \u003C80%\n\n1 minute @ RPE 7.5 -- 95% of FTP -- HR \u003C80%\n\n1 minute @ RPE 7.75 -- 105% of FTP -- HR \u003E105%\n\n3 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort** x5\n\nWork: 7 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003E105%\n\nRest: 3 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n30 seconds @ RPE 1.5 -- 40% of FTP -- HR \u003C70%\n\n2 minutes @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n30 seconds @ RPE 1.5 -- 40% of FTP -- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.05,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 77,
                "intensityFactor": 0.88
              },
              "workoutId": "ZLeDGgpUyz",
              "contentId": "dDDGxKHcVF",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 13,
          "type": "Strength",
          "rank": 101,
          "prospects": [
            {
              "type": "Strength",
              "name": "Core Focus 01",
              "style": null,
              "compatibility": 100,
              "description": "_Looking to improve ALL of the muscles that make up your core? You’ve come to the right place. The Core Focus series builds up everything from your hip to your shoulders - front, back, and side._\n\n​\n\nTo do this, we’ll take you through a variety of contraction types: eccentric (lengthening), concentric (shortening), and isometric (holding a position). The result? Improved core strength, stability, and endurance. You\u0027ll find exercises that carry over into other areas of your body, but all of the moves have a significant impact on your core. Level 1 is ideal for very beginners. Even then, you may find some of these moves challenging if you have never attempted them. That’s ok, take your time and pause the video if you need. Soon you’ll be on your way to mastering your core potential. In addition to a mat, you\u0027ll need some open wall space for this routine.\n\n​\n\nUnsure if this is the correct strength level for you? [Click here for help.](https://wahoosystm.com/HelpCenterChooseStrengthLevel)\n\n​\n\n**Exercises Included:**\n\n- Split Stance Side Bend w/ Arms Overhead\n- Downward Dog\n- Quadruped T-Spine Rotation\n- Back Extension w/ opp arm \u0026 leg raise\n- Hamstring Hip Bridge\n- Oblique Leg Lifts\n- Quadruped w/ alternating arm raise\n- Quad w/ leg raises\n- Low Side Plank w/ toe-tap front/back\n- High Side Plank w/ Hold\n- Quad Toes w/ Alternate Arm Raise\n- Quadruped Pull In \u0026 Hold\n- Quadruped Push Out \u0026 Hold\n- Bird Dogs\n- Back Extension with Hold\n- Child\u0027s Pose\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.22,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": 8,
                "intensityFactor": 0.6
              },
              "workoutId": "9UAvBgShTs",
              "contentId": "olCJUDMFaS",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 15,
          "type": "Cycling",
          "rank": 202,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Attacker",
              "style": null,
              "compatibility": 100,
              "description": "Being able to finish strong comes from properly pacing your efforts and preparing to finish strong. This session is all about improving those abilities. For just over 50 minutes, you\u0027ll tackle five different 6-minute long, progressive efforts that start just below FTP and finish well above it for the final minute.\n\n​\n\nThe real challenge of this workout is the limited 1-minute recovery sections between each effort. You’ll want to savor every second of those short recoveries. This workout will help improve your FTP and improve your ability to recover while pushing just under your threshold for the first half of each effort. You’ll also learn to manage your pacing and put out power above your threshold after holding steady just below that breakpoint.\n\n​\n\nRiders with sustained weakness will benefit greatly from this workout, as will anyone looking to push up their FTP.\n\n_Attacker_ is quite similar to the SUF workout, _Defender._ However, the efforts within each interval are 2-minutes shorter, and instead of starting harder and backing off like in _Defender,_ the efforts in this session start controlled and keep squeezing harder and harder until the end.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.8825,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 2,
                  "nm": 1,
                  "map": 3,
                  "ftp": 5
                },
                "tss": 63,
                "intensityFactor": 0.85
              },
              "workoutId": "2RCUXLPFVH",
              "contentId": "k0MlcITKGW",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 17,
          "type": "Cycling",
          "rank": 211,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Phil wins the Tour",
              "style": null,
              "compatibility": 100,
              "description": "Join Phil Gaimon in his bid to “win the Tour” as he takes on France’s most iconic mountains—The Tourmalet, Mont Ventoux, Alpe d’Huez and Galibier. This session captures the feel of those legendary ascents with 4 x 10-minute descending threshold intervals. Each one starting above threshold before easing down, forcing you to pace smart, clear the burn, and stay locked in until the summit.\n\n​\n\nBetween climbs, you’ll get some recovery—time to spin the legs and imagine soaking in the views (or raiding a French bakery, Phil-style).\n\n​\n\nPhysiologically, you’ll build muscular endurance, improve your ability to process oxygen, and train your body to go deep without breaking. Mentally, you’ll sharpen pacing skills and resilience—the hallmarks of any great climber.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.9830555555555556,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 2,
                  "ftp": 5
                },
                "tss": 81,
                "intensityFactor": 0.91
              },
              "workoutId": "BqNqT59BWH",
              "contentId": "wvpZ4nx37B",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 19,
          "type": "Cycling",
          "rank": 201,
          "prospects": [
            {
              "type": "Cycling",
              "name": "FTP Progression 3: 5 x 8",
              "style": null,
              "compatibility": 100,
              "description": "As the title suggests, this is the 3rd workout in our FTP series, designed to help you improve your sustainable power, or threshold. This session is 5 repeats of 8 minutes at 96-100% of FTP with 2 minutes of easy recovery, making for a 60-minute session with 40 minutes of riding at threshold.\n\nBy itself, this workout is not super hard, since you\u0027ve likely gained some fitness throughout this progression. However, 2 minutes is not a lot of recovery time, so you may start to feel a little fatigue creep in toward the end.\n\n​\n\n**Warm Up**\n\n1 minute @ RPE 1 -- 40% of FTP-- HR \u003C70%\n\n1 minute @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n1 minute @ RPE 4.5 -- 75% of FTP -- HR \u003C90%\n\n1 minute @ RPE 6 -- 85% of FTP -- HR \u003C100\n\n1 minute @ RPE 7 -- 95% of FTP -- HR \u003C100%\n\n3 minutes @ RPE 3 -- 60% of FTP -- HR \u003C70%\n\n​\n\n**Main Effort** x5\n\nWork: 8 minutes @ RPE 7.5 -- 100% of FTP -- HR \u003E105%\n\nRest: 2 minutes @ RPE 2 -- 45% of FTP -- HR \u003C70%\n\n​\n\n**Extra Volume**\n\nN/A\n\n​\n\n**Cool Down**\n\n1 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n\n1 minute @ RPE 2 -- 50% of FTP -- HR \u003C70%\n\n1 minute @ RPE 1.5 -- 45% of FTP-- HR \u003C70%\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.05,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 4
                },
                "tss": 82,
                "intensityFactor": 0.9
              },
              "workoutId": "YJ7zAYQI1q",
              "contentId": "je746iQvh3",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 20,
          "type": "Yoga",
          "rank": 300,
          "prospects": [
            {
              "type": "Yoga",
              "name": "Basic Yoga Poses",
              "style": null,
              "compatibility": 100,
              "description": "Throughout the SYSTM yoga program there are several basic, foundational moves that form the core of the routines. This session takes you through those moves in detail so you can master them and their more difficult variations.\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.25333333333333335,
              "durationType": "Time",
              "metrics": {
                "ratings": null,
                "tss": 25,
                "intensityFactor": 0.99
              },
              "workoutId": "epMe0rWKe3",
              "contentId": "qxs6YvzsoQ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 22,
          "type": "Cycling",
          "rank": 200,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Costa Blanca: Puerto de la Vall de Ebo (Recharger Ride)",
              "style": null,
              "compatibility": 100,
              "description": "This is an active recovery ride built with purpose. Low-intensity endurance work is paired with brief high-cadence neuromuscular activations to keep the nervous system awake without creating new fatigue. You’ll stay well below threshold throughout, allowing your body to absorb previous hard sessions and prepare for what’s ahead.\n\n​\n\nSet on the peaceful roads leading to the summit of Port de la Vall d’Ebo, this ride promotes circulation, technique, and mental reset. It’s ideal after race days or big training blocks — a smart session that helps you recover better, so you can train harder tomorrow. No ego, no watts chasing — just intentional recovery done right.\n\n​\n\n[**Wahoo Route**](https://www.strava.com/activities/13996505846)\n\n​\n\n_Your Host: There are few people who know the mountains and roads of Europe better than Wahoo Ambassador Michael Cotty. As founder of The Col Collective, Mike has made a career out of riding, filming, and telling the story of epic rides and mountains across the continent. As your On Location co-creator and host, Mike\u0027s engaging character, curious mind, and friendly nature will have you cueing up your next ride with him before you\u0027ve even finished the cool-down._\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.6011111111111112,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 2,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 20,
                "intensityFactor": 0.62
              },
              "workoutId": "rUrrfvb8ii",
              "contentId": "p6E2zIaYNZ",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 24,
          "type": "Cycling",
          "rank": 208,
          "prospects": [
            {
              "type": "Cycling",
              "name": "ALL Access EF 1: Tempo Blocks",
              "style": null,
              "compatibility": 100,
              "description": "Saddle up for the high-energy atmosphere of the EF men’s \u0026 women’s team training camp! Warm up with Jonathan Vaughters setting expectations and emphasizing the purpose of the camp: growth, improvement, and team bonding. Then meet the team you will be riding with today over some golf practice: Ali Jackson, Esteban Chavez, and Veronica Ewers. You will then roll out onto the stunning roads of Girona, pushing through 5 tempo blocks. Between sets, reflect with the riders on your goals for the year ahead\n\n​\n\nA tempo session is great for giving your body a decent dose of aerobic training without adding significant fatigue to your system. Over the 5 4 minute blocks, your body will get a decent aerobic workload, perfect for base training.\n\n​\n\n​\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 1.1522222222222223,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 3
                },
                "tss": 63,
                "intensityFactor": 0.65
              },
              "workoutId": "Fqk187JCOP",
              "contentId": "9BNWrHcSl5",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 26,
          "type": "Cycling",
          "rank": 213,
          "prospects": [
            {
              "type": "Cycling",
              "name": "Look For Things Where You Can Find Them",
              "style": null,
              "compatibility": 100,
              "description": "🎬 Film (2025): This film is a visually stunning endurance sports film that reimagines what it means to swim, bike, and run. Professional triathlete Eric Lagerstrom sets out on a summer of self-discovery across Colorado, Arizona, and British Columbia, reconnecting with the curiosity that first pulled him into the sport.\n\nAlong the way, he rides remote gravel roads with endurance legend Heather Jackson, dives into icy open water with Olympic gold medalist Simon Whitfield, and runs high alpine ridgelines far from any race course. Together, they explore a deeper purpose in sport—one rooted in wonder, not competition.\n\nShot across three breathtaking locations, this is triathlon like you’ve never seen it: wild, creative, and free.\n\nThis is multi-sport without rules. Movement without limits. Adventure without a stopwatch.\n\n​\n\n🚴 Workout: the workout accompanying this film varies from endurance to tempo to sub-threshold. The higher intensity efforts aren\u0027t the hardest you\u0027ll experience so that you can keep your attention on the film, however, they are just hard enough to help improve your FTP, oxygen utilization efficiency, and the ability to recover quickly between hard efforts. The workout intensity reflects the intensity of the riders in many places, so you may feel as if you\u0027re climbing Mont Ventoux or that you\u0027re a part of Cav\u0027s lead-out train on the run into the finish line.\n\n​\n\n[Here\u0027s how to turn off on-screen graphics for the best viewing experience.](https://wahoosystm.com/HelpCenterInspiration)\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.7080555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 1,
                  "nm": 1,
                  "map": 1,
                  "ftp": 2
                },
                "tss": 26,
                "intensityFactor": 0.6
              },
              "workoutId": "d73PUjNtHo",
              "contentId": "zVlwTfvyQL",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        },
        {
          "day": 27,
          "type": "Strength",
          "rank": 102,
          "prospects": [
            {
              "type": "Strength",
              "name": "Shoulder \u0026 Upper Back Mobility A",
              "style": null,
              "compatibility": 100,
              "description": "This session is designed to improve motion through your shoulders and upper back as well as activate muscles that are key for upper body stability and posture. Take your time to work through the movements and focus on quality range of motion. Do not move into pain. If you have tingling or numbness from any of these movements stop and consult a medical professional. Be sure to rotate through the other routines in this series on a regular basis for maximum benefit.\n\n​\n\nExercises:\n\n- Forward Shoulder Rolls\n- Backward Shoulder Rolls\n- Standing T-Spine Rotation\n- Standing Scapular Retraction\n- Wall Angels\n- Scapular Depression\n- Quadruped w/Alt. Arm Raise\n- Quadruped w/Push Out\n- Quadruped w/Pull In\n- Downward Dog\n",
              "intensity": {
                "master": 1,
                "nm": null,
                "ac": null,
                "map": null,
                "ftp": null
              },
              "trainerSetting": {
                "mode": "ERG",
                "level": null
              },
              "plannedDuration": 0.11555555555555555,
              "durationType": "Time",
              "metrics": {
                "ratings": {
                  "ac": 0,
                  "nm": 0,
                  "map": 0,
                  "ftp": 0
                },
                "tss": 4,
                "intensityFactor": 0.59
              },
              "workoutId": "WNyRspyeha",
              "contentId": "WSQ9YJ4yRy",
              "notes": null,
              "fourDPWorkoutGraph": null
            }
          ]
        }
      ],
      "addOns": []
    }
  ]
}